/* automatically generated by rust-bindgen 0.70.1 */

#![allow(non_camel_case_types)]
use crate::deps::*;
use libc::{c_char, c_int, c_uint, c_void, size_t, FILE};


#[repr(C)]
pub struct acb_dirichlet_hurwitz_precomp_struct {
    pub s: acb_struct,
    pub err: mag_struct,
    pub coeffs: acb_ptr,
    pub deflate: ::std::os::raw::c_int,
    pub A: mp_limb_signed_t,
    pub N: mp_limb_signed_t,
    pub K: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acb_dirichlet_hurwitz_precomp_struct"]
        [::std::mem::size_of::<acb_dirichlet_hurwitz_precomp_struct>() - 152usize];
    ["Alignment of acb_dirichlet_hurwitz_precomp_struct"]
        [::std::mem::align_of::<acb_dirichlet_hurwitz_precomp_struct>() - 8usize];
    ["Offset of field: acb_dirichlet_hurwitz_precomp_struct::s"]
        [::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, s) - 0usize];
    ["Offset of field: acb_dirichlet_hurwitz_precomp_struct::err"]
        [::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, err) - 96usize];
    ["Offset of field: acb_dirichlet_hurwitz_precomp_struct::coeffs"]
        [::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, coeffs) - 112usize];
    ["Offset of field: acb_dirichlet_hurwitz_precomp_struct::deflate"]
        [::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, deflate) - 120usize];
    ["Offset of field: acb_dirichlet_hurwitz_precomp_struct::A"]
        [::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, A) - 128usize];
    ["Offset of field: acb_dirichlet_hurwitz_precomp_struct::N"]
        [::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, N) - 136usize];
    ["Offset of field: acb_dirichlet_hurwitz_precomp_struct::K"]
        [::std::mem::offset_of!(acb_dirichlet_hurwitz_precomp_struct, K) - 144usize];
};
impl Default for acb_dirichlet_hurwitz_precomp_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type acb_dirichlet_hurwitz_precomp_t = [acb_dirichlet_hurwitz_precomp_struct; 1usize];
#[repr(C)]
pub struct acb_dirichlet_roots_struct {
    pub order: mp_limb_t,
    pub reduced_order: mp_limb_t,
    pub z: acb_t,
    pub size: mp_limb_signed_t,
    pub depth: mp_limb_signed_t,
    pub Z: *mut acb_ptr,
    pub use_pow: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acb_dirichlet_roots_struct"]
        [::std::mem::size_of::<acb_dirichlet_roots_struct>() - 144usize];
    ["Alignment of acb_dirichlet_roots_struct"]
        [::std::mem::align_of::<acb_dirichlet_roots_struct>() - 8usize];
    ["Offset of field: acb_dirichlet_roots_struct::order"]
        [::std::mem::offset_of!(acb_dirichlet_roots_struct, order) - 0usize];
    ["Offset of field: acb_dirichlet_roots_struct::reduced_order"]
        [::std::mem::offset_of!(acb_dirichlet_roots_struct, reduced_order) - 8usize];
    ["Offset of field: acb_dirichlet_roots_struct::z"]
        [::std::mem::offset_of!(acb_dirichlet_roots_struct, z) - 16usize];
    ["Offset of field: acb_dirichlet_roots_struct::size"]
        [::std::mem::offset_of!(acb_dirichlet_roots_struct, size) - 112usize];
    ["Offset of field: acb_dirichlet_roots_struct::depth"]
        [::std::mem::offset_of!(acb_dirichlet_roots_struct, depth) - 120usize];
    ["Offset of field: acb_dirichlet_roots_struct::Z"]
        [::std::mem::offset_of!(acb_dirichlet_roots_struct, Z) - 128usize];
    ["Offset of field: acb_dirichlet_roots_struct::use_pow"]
        [::std::mem::offset_of!(acb_dirichlet_roots_struct, use_pow) - 136usize];
};
impl Default for acb_dirichlet_roots_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type acb_dirichlet_roots_t = [acb_dirichlet_roots_struct; 1usize];
#[repr(C)]
pub struct acb_dirichlet_platt_c_precomp_struct {
    pub len: mp_limb_signed_t,
    pub p: arb_ptr,
    pub Xa: arb_struct,
    pub Xb: arb_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acb_dirichlet_platt_c_precomp_struct"]
        [::std::mem::size_of::<acb_dirichlet_platt_c_precomp_struct>() - 112usize];
    ["Alignment of acb_dirichlet_platt_c_precomp_struct"]
        [::std::mem::align_of::<acb_dirichlet_platt_c_precomp_struct>() - 8usize];
    ["Offset of field: acb_dirichlet_platt_c_precomp_struct::len"]
        [::std::mem::offset_of!(acb_dirichlet_platt_c_precomp_struct, len) - 0usize];
    ["Offset of field: acb_dirichlet_platt_c_precomp_struct::p"]
        [::std::mem::offset_of!(acb_dirichlet_platt_c_precomp_struct, p) - 8usize];
    ["Offset of field: acb_dirichlet_platt_c_precomp_struct::Xa"]
        [::std::mem::offset_of!(acb_dirichlet_platt_c_precomp_struct, Xa) - 16usize];
    ["Offset of field: acb_dirichlet_platt_c_precomp_struct::Xb"]
        [::std::mem::offset_of!(acb_dirichlet_platt_c_precomp_struct, Xb) - 64usize];
};
impl Default for acb_dirichlet_platt_c_precomp_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type acb_dirichlet_platt_c_precomp_t = [acb_dirichlet_platt_c_precomp_struct; 1usize];
#[repr(C)]
pub struct acb_dirichlet_platt_i_precomp_struct {
    pub c1: arb_struct,
    pub c2: arb_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acb_dirichlet_platt_i_precomp_struct"]
        [::std::mem::size_of::<acb_dirichlet_platt_i_precomp_struct>() - 96usize];
    ["Alignment of acb_dirichlet_platt_i_precomp_struct"]
        [::std::mem::align_of::<acb_dirichlet_platt_i_precomp_struct>() - 8usize];
    ["Offset of field: acb_dirichlet_platt_i_precomp_struct::c1"]
        [::std::mem::offset_of!(acb_dirichlet_platt_i_precomp_struct, c1) - 0usize];
    ["Offset of field: acb_dirichlet_platt_i_precomp_struct::c2"]
        [::std::mem::offset_of!(acb_dirichlet_platt_i_precomp_struct, c2) - 48usize];
};
impl Default for acb_dirichlet_platt_i_precomp_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type acb_dirichlet_platt_i_precomp_t = [acb_dirichlet_platt_i_precomp_struct; 1usize];
#[repr(C)]
pub struct acb_dirichlet_platt_ws_precomp_struct {
    pub pre_c: acb_dirichlet_platt_c_precomp_struct,
    pub pre_i: acb_dirichlet_platt_i_precomp_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acb_dirichlet_platt_ws_precomp_struct"]
        [::std::mem::size_of::<acb_dirichlet_platt_ws_precomp_struct>() - 208usize];
    ["Alignment of acb_dirichlet_platt_ws_precomp_struct"]
        [::std::mem::align_of::<acb_dirichlet_platt_ws_precomp_struct>() - 8usize];
    ["Offset of field: acb_dirichlet_platt_ws_precomp_struct::pre_c"]
        [::std::mem::offset_of!(acb_dirichlet_platt_ws_precomp_struct, pre_c) - 0usize];
    ["Offset of field: acb_dirichlet_platt_ws_precomp_struct::pre_i"]
        [::std::mem::offset_of!(acb_dirichlet_platt_ws_precomp_struct, pre_i) - 112usize];
};
impl Default for acb_dirichlet_platt_ws_precomp_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type acb_dirichlet_platt_ws_precomp_t = [acb_dirichlet_platt_ws_precomp_struct; 1usize];
extern "C" {
    pub fn acb_dirichlet_powsum_term(
        res: acb_ptr,
        log_prev: *mut arb_struct,
        prev: *mut mp_limb_t,
        s: *const acb_struct,
        k: mp_limb_t,
        integer: ::std::os::raw::c_int,
        critical_line: ::std::os::raw::c_int,
        len: mp_limb_signed_t,
        prec: mp_limb_signed_t,
    );
    pub fn acb_dirichlet_powsum_sieved(
        z: acb_ptr,
        s: *const acb_struct,
        n: mp_limb_t,
