/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::bindgen::*;
use crate::acb::*;
use crate::acb_calc::*;
use crate::acb_dft::*;
use crate::acb_dirichlet::*;
use crate::acb_elliptic::*;
use crate::acb_hypgeom::*;
use crate::acb_mat::*;
use crate::acb_modular::*;
use crate::acb_poly::*;
use crate::acb_theta::*;
use crate::acb_types::*;
use crate::acf::*;
use crate::acf_types::*;
use crate::aprcl::*;
use crate::arb::*;
use crate::arb_calc::*;
use crate::arb_fmpz_poly::*;
use crate::arb_fpwrap::*;
use crate::arb_hypgeom::*;
use crate::arb_mat::*;
use crate::arb_poly::*;
use crate::arb_types::*;
use crate::arf::*;
use crate::arf_types::*;
use crate::arith::*;
use crate::bernoulli::*;
use crate::bool_mat::*;
use crate::ca::*;
use crate::ca_ext::*;
use crate::ca_field::*;
use crate::ca_mat::*;
use crate::ca_poly::*;
use crate::calcium::*;
use crate::d_mat::*;
use crate::d_vec::*;
use crate::dirichlet::*;
use crate::dlog::*;
use crate::double_extras::*;
use crate::double_interval::*;
use crate::fexpr::*;
use crate::fexpr_builtin::*;
use crate::fft::*;
use crate::fft_tuning::*;
use crate::flint_config::*;
use crate::flint::*;
use crate::fmpq::*;
use crate::fmpq_mat::*;
use crate::fmpq_mpoly::*;
use crate::fmpq_mpoly_factor::*;
use crate::fmpq_poly::*;
use crate::fmpq_types::*;
use crate::fmpq_vec::*;
use crate::fmpz::*;
use crate::fmpz_extras::*;
use crate::fmpz_factor::*;
use crate::fmpz_lll::*;
use crate::fmpz_mat::*;
use crate::fmpz_mod::*;
use crate::fmpz_mod_mat::*;
use crate::fmpz_mod_mpoly::*;
use crate::fmpz_mod_mpoly_factor::*;
use crate::fmpz_mod_poly::*;
use crate::fmpz_mod_poly_factor::*;
use crate::fmpz_mod_types::*;
use crate::fmpz_mod_vec::*;
use crate::fmpz_mpoly::*;
use crate::fmpz_mpoly_factor::*;
use crate::fmpz_mpoly_q::*;
use crate::fmpz_poly::*;
use crate::fmpz_poly_factor::*;
use crate::fmpz_poly_mat::*;
use crate::fmpz_poly_q::*;
use crate::fmpz_types::*;
use crate::fmpz_vec::*;
use crate::fmpzi::*;
use crate::fq::*;
use crate::fq_default::*;
use crate::fq_default_mat::*;
use crate::fq_default_poly::*;
use crate::fq_default_poly_factor::*;
use crate::fq_embed::*;
use crate::fq_embed_templates::*;
use crate::fq_mat::*;
use crate::fq_mat_templates::*;
use crate::fq_nmod::*;
use crate::fq_nmod_embed::*;
use crate::fq_nmod_mat::*;
use crate::fq_nmod_mpoly::*;
use crate::fq_nmod_mpoly_factor::*;
use crate::fq_nmod_poly::*;
use crate::fq_nmod_poly_factor::*;
use crate::fq_nmod_types::*;
use crate::fq_nmod_vec::*;
use crate::fq_poly::*;
use crate::fq_poly_factor::*;
use crate::fq_poly_factor_templates::*;
use crate::fq_poly_templates::*;
use crate::fq_templates::*;
use crate::fq_types::*;
use crate::fq_vec::*;
use crate::fq_vec_templates::*;
use crate::fq_zech::*;
use crate::fq_zech_embed::*;
use crate::fq_zech_mat::*;
use crate::fq_zech_mpoly::*;
use crate::fq_zech_mpoly_factor::*;
use crate::fq_zech_poly::*;
use crate::fq_zech_poly_factor::*;
use crate::fq_zech_types::*;
use crate::fq_zech_vec::*;
use crate::gmpcompat::*;
use crate::gr::*;
use crate::gr_generic::*;
use crate::gr_mat::*;
use crate::gr_mpoly::*;
use crate::gr_poly::*;
use crate::gr_special::*;
use crate::gr_vec::*;
use crate::hypgeom::*;
use crate::limb_types::*;
use crate::long_extras::*;
use crate::longlong::*;
use crate::mag::*;
use crate::mpf_impl::*;
use crate::mpfr_mat::*;
use crate::mpfr_vec::*;
use crate::mpoly::*;
use crate::mpoly_types::*;
use crate::n_poly::*;
use crate::n_poly_types::*;
use crate::nf::*;
use crate::nf_elem::*;
use crate::nmod::*;
use crate::nmod_mat::*;
use crate::nmod_mpoly::*;
use crate::nmod_mpoly_factor::*;
use crate::nmod_poly::*;
use crate::nmod_poly_factor::*;
use crate::nmod_poly_mat::*;
use crate::nmod_types::*;
use crate::nmod_vec::*;
use crate::padic::*;
use crate::padic_mat::*;
use crate::padic_poly::*;
use crate::padic_types::*;
use crate::partitions::*;
use crate::perm::*;
use crate::qadic::*;
use crate::qfb::*;
use crate::qqbar::*;
use crate::qsieve::*;
use crate::templates::*;
use crate::thread_pool::*;
use crate::thread_support::*;
use crate::ulong_extras::*;


#[repr(C)]
pub struct ca_vec_struct {
    pub entries: ca_ptr,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ca_vec_struct"][::std::mem::size_of::<ca_vec_struct>() - 24usize];
    ["Alignment of ca_vec_struct"][::std::mem::align_of::<ca_vec_struct>() - 8usize];
    ["Offset of field: ca_vec_struct::entries"]
        [::std::mem::offset_of!(ca_vec_struct, entries) - 0usize];
    ["Offset of field: ca_vec_struct::alloc"]
        [::std::mem::offset_of!(ca_vec_struct, alloc) - 8usize];
    ["Offset of field: ca_vec_struct::length"]
        [::std::mem::offset_of!(ca_vec_struct, length) - 16usize];
};
impl Default for ca_vec_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type ca_vec_t = [ca_vec_struct; 1usize];
extern "C" {
    #[link_name = "ca_vec_entry_ptr__extern"]
    pub fn ca_vec_entry_ptr(vec: *mut ca_vec_struct, i: mp_limb_signed_t) -> ca_ptr;
    pub fn _ca_vec_init(len: mp_limb_signed_t, ctx: *mut ca_ctx_struct) -> ca_ptr;
    pub fn ca_vec_init(vec: *mut ca_vec_struct, len: mp_limb_signed_t, ctx: *mut ca_ctx_struct);
    pub fn _ca_vec_clear(v: ca_ptr, len: mp_limb_signed_t, ctx: *mut ca_ctx_struct);
    pub fn ca_vec_clear(vec: *mut ca_vec_struct, ctx: *mut ca_ctx_struct);
    pub fn _ca_vec_swap(vec1: ca_ptr, vec2: ca_ptr, len: mp_limb_signed_t, ctx: *mut ca_ctx_struct);
    #[link_name = "ca_vec_swap__extern"]
    pub fn ca_vec_swap(vec1: *mut ca_vec_struct, vec2: *mut ca_vec_struct, ctx: *mut ca_ctx_struct);
    #[link_name = "ca_vec_length__extern"]
    pub fn ca_vec_length(vec: *const ca_vec_struct, ctx: *mut ca_ctx_struct) -> mp_limb_signed_t;
    pub fn _ca_vec_fit_length(
        vec: *mut ca_vec_struct,
        len: mp_limb_signed_t,
        ctx: *mut ca_ctx_struct,
    );
    pub fn ca_vec_set_length(
        res: *mut ca_vec_struct,
        len: mp_limb_signed_t,
        ctx: *mut ca_ctx_struct,
    );
    pub fn _ca_vec_set(res: ca_ptr, src: ca_srcptr, len: mp_limb_signed_t, ctx: *mut ca_ctx_struct);
    pub fn ca_vec_set(res: *mut ca_vec_struct, src: *const ca_vec_struct, ctx: *mut ca_ctx_struct);
    pub fn _ca_vec_zero(res: ca_ptr, len: mp_limb_signed_t, ctx: *mut ca_ctx_struct);
    pub fn ca_vec_zero(res: *mut ca_vec_struct, len: mp_limb_signed_t, ctx: *mut ca_ctx_struct);
    #[link_name = "_ca_vec_unknown__extern"]
    pub fn _ca_vec_unknown(vec: ca_ptr, len: mp_limb_signed_t, ctx: *mut ca_ctx_struct);
    #[link_name = "_ca_vec_undefined__extern"]
    pub fn _ca_vec_undefined(vec: ca_ptr, len: mp_limb_signed_t, ctx: *mut ca_ctx_struct);
    pub fn ca_vec_print(vec: *const ca_vec_struct, ctx: *mut ca_ctx_struct);
    pub fn ca_vec_printn(
        vec: *const ca_vec_struct,
        digits: mp_limb_signed_t,
        ctx: *mut ca_ctx_struct,
    );
    #[link_name = "ca_vec_append__extern"]
    pub fn ca_vec_append(vec: *mut ca_vec_struct, f: *const ca_struct, ctx: *mut ca_ctx_struct);
    pub fn _ca_vec_neg(res: ca_ptr, src: ca_srcptr, len: mp_limb_signed_t, ctx: *mut ca_ctx_struct);
    pub fn ca_vec_neg(res: *mut ca_vec_struct, src: *const ca_vec_struct, ctx: *mut ca_ctx_struct);
    pub fn _ca_vec_add(
        res: ca_ptr,
        vec1: ca_srcptr,
        vec2: ca_srcptr,
        len: mp_limb_signed_t,
        ctx: *mut ca_ctx_struct,
    );
    pub fn _ca_vec_sub(
        res: ca_ptr,
        vec1: ca_srcptr,
        vec2: ca_srcptr,
        len: mp_limb_signed_t,
        ctx: *mut ca_ctx_struct,
    );
    pub fn _ca_vec_scalar_mul_ca(
        res: ca_ptr,
        src: ca_srcptr,
        len: mp_limb_signed_t,
        c: *const ca_struct,
        ctx: *mut ca_ctx_struct,
    );
    pub fn _ca_vec_scalar_div_ca(
        res: ca_ptr,
        src: ca_srcptr,
        len: mp_limb_signed_t,
        c: *const ca_struct,
        ctx: *mut ca_ctx_struct,
    );
    pub fn _ca_vec_scalar_addmul_ca(
        res: ca_ptr,
        vec: ca_srcptr,
        len: mp_limb_signed_t,
        c: *const ca_struct,
        ctx: *mut ca_ctx_struct,
    );
    pub fn _ca_vec_scalar_submul_ca(
        res: ca_ptr,
        vec: ca_srcptr,
        len: mp_limb_signed_t,
        c: *const ca_struct,
        ctx: *mut ca_ctx_struct,
    );
    pub fn _ca_vec_check_is_zero(
        vec: ca_srcptr,
        len: mp_limb_signed_t,
        ctx: *mut ca_ctx_struct,
    ) -> truth_t;
    #[link_name = "_ca_vec_is_fmpq_vec__extern"]
    pub fn _ca_vec_is_fmpq_vec(
        vec: ca_srcptr,
        len: mp_limb_signed_t,
        ctx: *mut ca_ctx_struct,
    ) -> libc::c_int;
    #[link_name = "_ca_vec_fmpq_vec_is_fmpz_vec__extern"]
    pub fn _ca_vec_fmpq_vec_is_fmpz_vec(
        vec: ca_srcptr,
        len: mp_limb_signed_t,
        ctx: *mut ca_ctx_struct,
    ) -> libc::c_int;
    #[link_name = "_ca_vec_fmpq_vec_get_fmpz_vec_den__extern"]
    pub fn _ca_vec_fmpq_vec_get_fmpz_vec_den(
        c: *mut fmpz,
        den: *mut fmpz,
        vec: ca_srcptr,
        len: mp_limb_signed_t,
        ctx: *mut ca_ctx_struct,
    );
    #[link_name = "_ca_vec_set_fmpz_vec_div_fmpz__extern"]
    pub fn _ca_vec_set_fmpz_vec_div_fmpz(
        res: ca_ptr,
        v: *const fmpz,
        den: *const fmpz,
        len: mp_limb_signed_t,
        ctx: *mut ca_ctx_struct,
    );
}
