/* automatically generated by rust-bindgen 0.70.1 */

use crate::deps::*;
use crate::calcium::*;
use crate::fexpr::*;


pub const fexpr_builtin_symbol_FEXPR_AGM: fexpr_builtin_symbol = 0;
pub const fexpr_builtin_symbol_FEXPR_AGMSequence: fexpr_builtin_symbol = 1;
pub const fexpr_builtin_symbol_FEXPR_Abs: fexpr_builtin_symbol = 2;
pub const fexpr_builtin_symbol_FEXPR_Acos: fexpr_builtin_symbol = 3;
pub const fexpr_builtin_symbol_FEXPR_Acosh: fexpr_builtin_symbol = 4;
pub const fexpr_builtin_symbol_FEXPR_Acot: fexpr_builtin_symbol = 5;
pub const fexpr_builtin_symbol_FEXPR_Acoth: fexpr_builtin_symbol = 6;
pub const fexpr_builtin_symbol_FEXPR_Acsc: fexpr_builtin_symbol = 7;
pub const fexpr_builtin_symbol_FEXPR_Acsch: fexpr_builtin_symbol = 8;
pub const fexpr_builtin_symbol_FEXPR_Add: fexpr_builtin_symbol = 9;
pub const fexpr_builtin_symbol_FEXPR_AiryAi: fexpr_builtin_symbol = 10;
pub const fexpr_builtin_symbol_FEXPR_AiryAiZero: fexpr_builtin_symbol = 11;
pub const fexpr_builtin_symbol_FEXPR_AiryBi: fexpr_builtin_symbol = 12;
pub const fexpr_builtin_symbol_FEXPR_AiryBiZero: fexpr_builtin_symbol = 13;
pub const fexpr_builtin_symbol_FEXPR_AlgebraicNumberSerialized: fexpr_builtin_symbol = 14;
pub const fexpr_builtin_symbol_FEXPR_AlgebraicNumbers: fexpr_builtin_symbol = 15;
pub const fexpr_builtin_symbol_FEXPR_All: fexpr_builtin_symbol = 16;
pub const fexpr_builtin_symbol_FEXPR_AnalyticContinuation: fexpr_builtin_symbol = 17;

pub const fexpr_builtin_symbol_FEXPR_gamma: fexpr_builtin_symbol = 440;
pub const fexpr_builtin_symbol_FEXPR_gamma_: fexpr_builtin_symbol = 441;
pub const fexpr_builtin_symbol_FEXPR_iota: fexpr_builtin_symbol = 442;
pub const fexpr_builtin_symbol_FEXPR_iota_: fexpr_builtin_symbol = 443;
pub const fexpr_builtin_symbol_FEXPR_kappa: fexpr_builtin_symbol = 444;
pub const fexpr_builtin_symbol_FEXPR_kappa_: fexpr_builtin_symbol = 445;
pub const fexpr_builtin_symbol_FEXPR_lamda: fexpr_builtin_symbol = 446;
pub const fexpr_builtin_symbol_FEXPR_lamda_: fexpr_builtin_symbol = 447;
pub const fexpr_builtin_symbol_FEXPR_mu: fexpr_builtin_symbol = 448;
pub const fexpr_builtin_symbol_FEXPR_mu_: fexpr_builtin_symbol = 449;
pub const fexpr_builtin_symbol_FEXPR_nu: fexpr_builtin_symbol = 450;
pub const fexpr_builtin_symbol_FEXPR_nu_: fexpr_builtin_symbol = 451;
pub const fexpr_builtin_symbol_FEXPR_omega: fexpr_builtin_symbol = 452;
pub const fexpr_builtin_symbol_FEXPR_omega_: fexpr_builtin_symbol = 453;
pub const fexpr_builtin_symbol_FEXPR_phi: fexpr_builtin_symbol = 454;
pub const fexpr_builtin_symbol_FEXPR_phi_: fexpr_builtin_symbol = 455;
pub const fexpr_builtin_symbol_FEXPR_pi: fexpr_builtin_symbol = 456;
pub const fexpr_builtin_symbol_FEXPR_pi_: fexpr_builtin_symbol = 457;
pub const fexpr_builtin_symbol_FEXPR_rho: fexpr_builtin_symbol = 458;
pub const fexpr_builtin_symbol_FEXPR_rho_: fexpr_builtin_symbol = 459;
pub const fexpr_builtin_symbol_FEXPR_sigma: fexpr_builtin_symbol = 460;
pub const fexpr_builtin_symbol_FEXPR_sigma_: fexpr_builtin_symbol = 461;
pub const fexpr_builtin_symbol_FEXPR_tau: fexpr_builtin_symbol = 462;
pub const fexpr_builtin_symbol_FEXPR_tau_: fexpr_builtin_symbol = 463;
pub const fexpr_builtin_symbol_FEXPR_theta: fexpr_builtin_symbol = 464;
pub const fexpr_builtin_symbol_FEXPR_theta_: fexpr_builtin_symbol = 465;
pub const fexpr_builtin_symbol_FEXPR_varphi: fexpr_builtin_symbol = 466;
pub const fexpr_builtin_symbol_FEXPR_varphi_: fexpr_builtin_symbol = 467;
pub const fexpr_builtin_symbol_FEXPR_vartheta: fexpr_builtin_symbol = 468;
pub const fexpr_builtin_symbol_FEXPR_vartheta_: fexpr_builtin_symbol = 469;
pub const fexpr_builtin_symbol_FEXPR_xi: fexpr_builtin_symbol = 470;
pub const fexpr_builtin_symbol_FEXPR_xi_: fexpr_builtin_symbol = 471;
pub const fexpr_builtin_symbol_FEXPR_zeta: fexpr_builtin_symbol = 472;
pub const fexpr_builtin_symbol_FEXPR_zeta_: fexpr_builtin_symbol = 473;
pub const fexpr_builtin_symbol_FEXPR_BUILTIN_LENGTH: fexpr_builtin_symbol = 474;
pub type fexpr_builtin_symbol = libc::c_uint;
pub type _fexpr_latex_writer = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut calcium_stream_struct,
        arg2: *const fexpr_struct,
        arg3: mp_limb_t,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fexpr_symbol_info {
    pub symbol: fexpr_builtin_symbol,
    pub string: *const libc::c_char,
    pub latex_string: *const libc::c_char,
    pub latex_writer: _fexpr_latex_writer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fexpr_symbol_info"][::std::mem::size_of::<fexpr_symbol_info>() - 32usize];
    ["Alignment of fexpr_symbol_info"][::std::mem::align_of::<fexpr_symbol_info>() - 8usize];
    ["Offset of field: fexpr_symbol_info::symbol"]
        [::std::mem::offset_of!(fexpr_symbol_info, symbol) - 0usize];
    ["Offset of field: fexpr_symbol_info::string"]
        [::std::mem::offset_of!(fexpr_symbol_info, string) - 8usize];
    ["Offset of field: fexpr_symbol_info::latex_string"]
        [::std::mem::offset_of!(fexpr_symbol_info, latex_string) - 16usize];
    ["Offset of field: fexpr_symbol_info::latex_writer"]
        [::std::mem::offset_of!(fexpr_symbol_info, latex_writer) - 24usize];
};
impl Default for fexpr_symbol_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub static fexpr_builtin_table: [fexpr_symbol_info; 474usize];
    pub fn fexpr_builtin_lookup(s: *const libc::c_char) -> mp_limb_signed_t;
    #[link_name = "fexpr_builtin_name__extern"]
    pub fn fexpr_builtin_name(n: mp_limb_signed_t) -> *const libc::c_char;
    #[link_name = "fexpr_builtin_length__extern"]
    pub fn fexpr_builtin_length() -> mp_limb_signed_t;
}
