/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::flint::*;
use crate::fmpq_types::*;
use crate::fmpz_types::*;
use crate::mpoly_types::*;


#[repr(C)]
pub struct fmpq_mpoly_univar_struct {
    pub coeffs: *mut fmpq_mpoly_struct,
    pub exps: *mut fmpz,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpq_mpoly_univar_struct"]
        [::std::mem::size_of::<fmpq_mpoly_univar_struct>() - 32usize];
    ["Alignment of fmpq_mpoly_univar_struct"]
        [::std::mem::align_of::<fmpq_mpoly_univar_struct>() - 8usize];
    ["Offset of field: fmpq_mpoly_univar_struct::coeffs"]
        [::std::mem::offset_of!(fmpq_mpoly_univar_struct, coeffs) - 0usize];
    ["Offset of field: fmpq_mpoly_univar_struct::exps"]
        [::std::mem::offset_of!(fmpq_mpoly_univar_struct, exps) - 8usize];
    ["Offset of field: fmpq_mpoly_univar_struct::alloc"]
        [::std::mem::offset_of!(fmpq_mpoly_univar_struct, alloc) - 16usize];
    ["Offset of field: fmpq_mpoly_univar_struct::length"]
        [::std::mem::offset_of!(fmpq_mpoly_univar_struct, length) - 24usize];
};
impl Default for fmpq_mpoly_univar_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpq_mpoly_univar_t = [fmpq_mpoly_univar_struct; 1usize];
extern "C" {
    #[link_name = "fmpq_mpoly_ctx_init__extern"]
    pub fn fmpq_mpoly_ctx_init(
        ctx: *mut fmpq_mpoly_ctx_struct,
        nvars: mp_limb_signed_t,
        ord: ordering_t,
    );
    #[link_name = "fmpq_mpoly_ctx_init_rand__extern"]
    pub fn fmpq_mpoly_ctx_init_rand(
        ctx: *mut fmpq_mpoly_ctx_struct,
        state: *mut flint_rand_s,
        max_nvars: mp_limb_signed_t,
    );
    #[link_name = "fmpq_mpoly_ctx_clear__extern"]
    pub fn fmpq_mpoly_ctx_clear(ctx: *mut fmpq_mpoly_ctx_struct);
