/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::bindgen::*;
use crate::acb::*;
use crate::acb_calc::*;
use crate::acb_dft::*;
use crate::acb_dirichlet::*;
use crate::acb_elliptic::*;
use crate::acb_hypgeom::*;
use crate::acb_mat::*;
use crate::acb_modular::*;
use crate::acb_poly::*;
use crate::acb_theta::*;
use crate::acb_types::*;
use crate::acf::*;
use crate::acf_types::*;
use crate::aprcl::*;
use crate::arb::*;
use crate::arb_calc::*;
use crate::arb_fmpz_poly::*;
use crate::arb_fpwrap::*;
use crate::arb_hypgeom::*;
use crate::arb_mat::*;
use crate::arb_poly::*;
use crate::arb_types::*;
use crate::arf::*;
use crate::arf_types::*;
use crate::arith::*;
use crate::bernoulli::*;
use crate::bool_mat::*;
use crate::ca::*;
use crate::ca_ext::*;
use crate::ca_field::*;
use crate::ca_mat::*;
use crate::ca_poly::*;
use crate::ca_vec::*;
use crate::calcium::*;
use crate::d_mat::*;
use crate::d_vec::*;
use crate::dirichlet::*;
use crate::dlog::*;
use crate::double_extras::*;
use crate::double_interval::*;
use crate::fexpr::*;
use crate::fexpr_builtin::*;
use crate::fft::*;
use crate::fft_tuning::*;
use crate::flint_config::*;
use crate::flint::*;
use crate::fmpq::*;
use crate::fmpq_mat::*;
use crate::fmpq_mpoly::*;
use crate::fmpq_mpoly_factor::*;
use crate::fmpq_poly::*;
use crate::fmpq_types::*;
use crate::fmpq_vec::*;
use crate::fmpz::*;
use crate::fmpz_extras::*;
use crate::fmpz_factor::*;
use crate::fmpz_lll::*;
use crate::fmpz_mat::*;
use crate::fmpz_mod::*;
use crate::fmpz_mod_mat::*;
use crate::fmpz_mod_mpoly::*;
use crate::fmpz_mod_poly::*;
use crate::fmpz_mod_poly_factor::*;
use crate::fmpz_mod_types::*;
use crate::fmpz_mod_vec::*;
use crate::fmpz_mpoly::*;
use crate::fmpz_mpoly_factor::*;
use crate::fmpz_mpoly_q::*;
use crate::fmpz_poly::*;
use crate::fmpz_poly_factor::*;
use crate::fmpz_poly_mat::*;
use crate::fmpz_poly_q::*;
use crate::fmpz_types::*;
use crate::fmpz_vec::*;
use crate::fmpzi::*;
use crate::fq::*;
use crate::fq_default::*;
use crate::fq_default_mat::*;
use crate::fq_default_poly::*;
use crate::fq_default_poly_factor::*;
use crate::fq_embed::*;
use crate::fq_embed_templates::*;
use crate::fq_mat::*;
use crate::fq_mat_templates::*;
use crate::fq_nmod::*;
use crate::fq_nmod_embed::*;
use crate::fq_nmod_mat::*;
use crate::fq_nmod_mpoly::*;
use crate::fq_nmod_mpoly_factor::*;
use crate::fq_nmod_poly::*;
use crate::fq_nmod_poly_factor::*;
use crate::fq_nmod_types::*;
use crate::fq_nmod_vec::*;
use crate::fq_poly::*;
use crate::fq_poly_factor::*;
use crate::fq_poly_factor_templates::*;
use crate::fq_poly_templates::*;
use crate::fq_templates::*;
use crate::fq_types::*;
use crate::fq_vec::*;
use crate::fq_vec_templates::*;
use crate::fq_zech::*;
use crate::fq_zech_embed::*;
use crate::fq_zech_mat::*;
use crate::fq_zech_mpoly::*;
use crate::fq_zech_mpoly_factor::*;
use crate::fq_zech_poly::*;
use crate::fq_zech_poly_factor::*;
use crate::fq_zech_types::*;
use crate::fq_zech_vec::*;
use crate::gmpcompat::*;
use crate::gr::*;
use crate::gr_generic::*;
use crate::gr_mat::*;
use crate::gr_mpoly::*;
use crate::gr_poly::*;
use crate::gr_special::*;
use crate::gr_vec::*;
use crate::hypgeom::*;
use crate::limb_types::*;
use crate::long_extras::*;
use crate::longlong::*;
use crate::mag::*;
use crate::mpf_impl::*;
use crate::mpfr_mat::*;
use crate::mpfr_vec::*;
use crate::mpoly::*;
use crate::mpoly_types::*;
use crate::n_poly::*;
use crate::n_poly_types::*;
use crate::nf::*;
use crate::nf_elem::*;
use crate::nmod::*;
use crate::nmod_mat::*;
use crate::nmod_mpoly::*;
use crate::nmod_mpoly_factor::*;
use crate::nmod_poly::*;
use crate::nmod_poly_factor::*;
use crate::nmod_poly_mat::*;
use crate::nmod_types::*;
use crate::nmod_vec::*;
use crate::padic::*;
use crate::padic_mat::*;
use crate::padic_poly::*;
use crate::padic_types::*;
use crate::partitions::*;
use crate::perm::*;
use crate::qadic::*;
use crate::qfb::*;
use crate::qqbar::*;
use crate::qsieve::*;
use crate::templates::*;
use crate::thread_pool::*;
use crate::thread_support::*;
use crate::ulong_extras::*;


#[repr(C)]
pub struct fmpz_mod_bpoly_struct {
    pub coeffs: *mut fmpz_mod_poly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_bpoly_struct"][::std::mem::size_of::<fmpz_mod_bpoly_struct>() - 24usize];
    ["Alignment of fmpz_mod_bpoly_struct"]
        [::std::mem::align_of::<fmpz_mod_bpoly_struct>() - 8usize];
    ["Offset of field: fmpz_mod_bpoly_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_mod_bpoly_struct, coeffs) - 0usize];
    ["Offset of field: fmpz_mod_bpoly_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_bpoly_struct, alloc) - 8usize];
    ["Offset of field: fmpz_mod_bpoly_struct::length"]
        [::std::mem::offset_of!(fmpz_mod_bpoly_struct, length) - 16usize];
};
impl Default for fmpz_mod_bpoly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_bpoly_t = [fmpz_mod_bpoly_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_tpoly_struct {
    pub coeffs: *mut fmpz_mod_bpoly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_tpoly_struct"][::std::mem::size_of::<fmpz_mod_tpoly_struct>() - 24usize];
    ["Alignment of fmpz_mod_tpoly_struct"]
        [::std::mem::align_of::<fmpz_mod_tpoly_struct>() - 8usize];
    ["Offset of field: fmpz_mod_tpoly_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_mod_tpoly_struct, coeffs) - 0usize];
    ["Offset of field: fmpz_mod_tpoly_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_tpoly_struct, alloc) - 8usize];
    ["Offset of field: fmpz_mod_tpoly_struct::length"]
        [::std::mem::offset_of!(fmpz_mod_tpoly_struct, length) - 16usize];
};
impl Default for fmpz_mod_tpoly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_tpoly_t = [fmpz_mod_tpoly_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_polyu_struct {
    pub exps: *mut mp_limb_t,
    pub coeffs: *mut fmpz,
    pub length: mp_limb_signed_t,
    pub alloc: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_polyu_struct"][::std::mem::size_of::<fmpz_mod_polyu_struct>() - 32usize];
    ["Alignment of fmpz_mod_polyu_struct"]
        [::std::mem::align_of::<fmpz_mod_polyu_struct>() - 8usize];
    ["Offset of field: fmpz_mod_polyu_struct::exps"]
        [::std::mem::offset_of!(fmpz_mod_polyu_struct, exps) - 0usize];
    ["Offset of field: fmpz_mod_polyu_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_mod_polyu_struct, coeffs) - 8usize];
    ["Offset of field: fmpz_mod_polyu_struct::length"]
        [::std::mem::offset_of!(fmpz_mod_polyu_struct, length) - 16usize];
    ["Offset of field: fmpz_mod_polyu_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_polyu_struct, alloc) - 24usize];
};
impl Default for fmpz_mod_polyu_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_polyu_t = [fmpz_mod_polyu_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_polyun_struct {
    pub coeffs: *mut fmpz_mod_poly_struct,
    pub exps: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_polyun_struct"][::std::mem::size_of::<fmpz_mod_polyun_struct>() - 32usize];
    ["Alignment of fmpz_mod_polyun_struct"]
        [::std::mem::align_of::<fmpz_mod_polyun_struct>() - 8usize];
    ["Offset of field: fmpz_mod_polyun_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_mod_polyun_struct, coeffs) - 0usize];
    ["Offset of field: fmpz_mod_polyun_struct::exps"]
        [::std::mem::offset_of!(fmpz_mod_polyun_struct, exps) - 8usize];
    ["Offset of field: fmpz_mod_polyun_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_polyun_struct, alloc) - 16usize];
    ["Offset of field: fmpz_mod_polyun_struct::length"]
        [::std::mem::offset_of!(fmpz_mod_polyun_struct, length) - 24usize];
};
impl Default for fmpz_mod_polyun_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_polyun_t = [fmpz_mod_polyun_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpolyu_struct {
    pub coeffs: *mut fmpz_mod_mpoly_struct,
    pub exps: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
    pub bits: mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_mpolyu_struct"][::std::mem::size_of::<fmpz_mod_mpolyu_struct>() - 40usize];
    ["Alignment of fmpz_mod_mpolyu_struct"]
        [::std::mem::align_of::<fmpz_mod_mpolyu_struct>() - 8usize];
    ["Offset of field: fmpz_mod_mpolyu_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_mod_mpolyu_struct, coeffs) - 0usize];
    ["Offset of field: fmpz_mod_mpolyu_struct::exps"]
        [::std::mem::offset_of!(fmpz_mod_mpolyu_struct, exps) - 8usize];
    ["Offset of field: fmpz_mod_mpolyu_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_mpolyu_struct, alloc) - 16usize];
    ["Offset of field: fmpz_mod_mpolyu_struct::length"]
        [::std::mem::offset_of!(fmpz_mod_mpolyu_struct, length) - 24usize];
    ["Offset of field: fmpz_mod_mpolyu_struct::bits"]
        [::std::mem::offset_of!(fmpz_mod_mpolyu_struct, bits) - 32usize];
};
impl Default for fmpz_mod_mpolyu_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_mpolyu_t = [fmpz_mod_mpolyu_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpolyn_struct {
    pub coeffs: *mut fmpz_mod_poly_struct,
    pub exps: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
    pub bits: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_mpolyn_struct"][::std::mem::size_of::<fmpz_mod_mpolyn_struct>() - 40usize];
    ["Alignment of fmpz_mod_mpolyn_struct"]
        [::std::mem::align_of::<fmpz_mod_mpolyn_struct>() - 8usize];
    ["Offset of field: fmpz_mod_mpolyn_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_mod_mpolyn_struct, coeffs) - 0usize];
    ["Offset of field: fmpz_mod_mpolyn_struct::exps"]
        [::std::mem::offset_of!(fmpz_mod_mpolyn_struct, exps) - 8usize];
    ["Offset of field: fmpz_mod_mpolyn_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_mpolyn_struct, alloc) - 16usize];
    ["Offset of field: fmpz_mod_mpolyn_struct::length"]
        [::std::mem::offset_of!(fmpz_mod_mpolyn_struct, length) - 24usize];
    ["Offset of field: fmpz_mod_mpolyn_struct::bits"]
        [::std::mem::offset_of!(fmpz_mod_mpolyn_struct, bits) - 32usize];
};
impl Default for fmpz_mod_mpolyn_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_mpolyn_t = [fmpz_mod_mpolyn_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_stack_struct {
    pub array: *mut *mut fmpz_mod_poly_struct,
    pub alloc: mp_limb_signed_t,
    pub top: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_poly_stack_struct"]
        [::std::mem::size_of::<fmpz_mod_poly_stack_struct>() - 24usize];
    ["Alignment of fmpz_mod_poly_stack_struct"]
        [::std::mem::align_of::<fmpz_mod_poly_stack_struct>() - 8usize];
    ["Offset of field: fmpz_mod_poly_stack_struct::array"]
        [::std::mem::offset_of!(fmpz_mod_poly_stack_struct, array) - 0usize];
    ["Offset of field: fmpz_mod_poly_stack_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_poly_stack_struct, alloc) - 8usize];
    ["Offset of field: fmpz_mod_poly_stack_struct::top"]
        [::std::mem::offset_of!(fmpz_mod_poly_stack_struct, top) - 16usize];
};
impl Default for fmpz_mod_poly_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_poly_stack_t = [fmpz_mod_poly_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_bpoly_stack_struct {
    pub array: *mut *mut fmpz_mod_bpoly_struct,
    pub alloc: mp_limb_signed_t,
    pub top: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_bpoly_stack_struct"]
        [::std::mem::size_of::<fmpz_mod_bpoly_stack_struct>() - 24usize];
    ["Alignment of fmpz_mod_bpoly_stack_struct"]
        [::std::mem::align_of::<fmpz_mod_bpoly_stack_struct>() - 8usize];
    ["Offset of field: fmpz_mod_bpoly_stack_struct::array"]
        [::std::mem::offset_of!(fmpz_mod_bpoly_stack_struct, array) - 0usize];
    ["Offset of field: fmpz_mod_bpoly_stack_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_bpoly_stack_struct, alloc) - 8usize];
    ["Offset of field: fmpz_mod_bpoly_stack_struct::top"]
        [::std::mem::offset_of!(fmpz_mod_bpoly_stack_struct, top) - 16usize];
};
impl Default for fmpz_mod_bpoly_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_bpoly_stack_t = [fmpz_mod_bpoly_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_polyun_stack_struct {
    pub array: *mut *mut fmpz_mod_polyun_struct,
    pub alloc: mp_limb_signed_t,
    pub top: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_polyun_stack_struct"]
        [::std::mem::size_of::<fmpz_mod_polyun_stack_struct>() - 24usize];
    ["Alignment of fmpz_mod_polyun_stack_struct"]
        [::std::mem::align_of::<fmpz_mod_polyun_stack_struct>() - 8usize];
    ["Offset of field: fmpz_mod_polyun_stack_struct::array"]
        [::std::mem::offset_of!(fmpz_mod_polyun_stack_struct, array) - 0usize];
    ["Offset of field: fmpz_mod_polyun_stack_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_polyun_stack_struct, alloc) - 8usize];
    ["Offset of field: fmpz_mod_polyun_stack_struct::top"]
        [::std::mem::offset_of!(fmpz_mod_polyun_stack_struct, top) - 16usize];
};
impl Default for fmpz_mod_polyun_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_polyun_stack_t = [fmpz_mod_polyun_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpolyn_stack_struct {
    pub array: *mut *mut fmpz_mod_mpolyn_struct,
    pub alloc: mp_limb_signed_t,
    pub top: mp_limb_signed_t,
    pub bits: mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_mpolyn_stack_struct"]
        [::std::mem::size_of::<fmpz_mod_mpolyn_stack_struct>() - 32usize];
    ["Alignment of fmpz_mod_mpolyn_stack_struct"]
        [::std::mem::align_of::<fmpz_mod_mpolyn_stack_struct>() - 8usize];
    ["Offset of field: fmpz_mod_mpolyn_stack_struct::array"]
        [::std::mem::offset_of!(fmpz_mod_mpolyn_stack_struct, array) - 0usize];
    ["Offset of field: fmpz_mod_mpolyn_stack_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_mpolyn_stack_struct, alloc) - 8usize];
    ["Offset of field: fmpz_mod_mpolyn_stack_struct::top"]
        [::std::mem::offset_of!(fmpz_mod_mpolyn_stack_struct, top) - 16usize];
    ["Offset of field: fmpz_mod_mpolyn_stack_struct::bits"]
        [::std::mem::offset_of!(fmpz_mod_mpolyn_stack_struct, bits) - 24usize];
};
impl Default for fmpz_mod_mpolyn_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_mpolyn_stack_t = [fmpz_mod_mpolyn_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_bpoly_stack_struct {
    pub poly_stack: fmpz_mod_poly_stack_t,
    pub bpoly_stack: fmpz_mod_bpoly_stack_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_poly_bpoly_stack_struct"]
        [::std::mem::size_of::<fmpz_mod_poly_bpoly_stack_struct>() - 48usize];
    ["Alignment of fmpz_mod_poly_bpoly_stack_struct"]
        [::std::mem::align_of::<fmpz_mod_poly_bpoly_stack_struct>() - 8usize];
    ["Offset of field: fmpz_mod_poly_bpoly_stack_struct::poly_stack"]
        [::std::mem::offset_of!(fmpz_mod_poly_bpoly_stack_struct, poly_stack) - 0usize];
    ["Offset of field: fmpz_mod_poly_bpoly_stack_struct::bpoly_stack"]
        [::std::mem::offset_of!(fmpz_mod_poly_bpoly_stack_struct, bpoly_stack) - 24usize];
};
impl Default for fmpz_mod_poly_bpoly_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_poly_bpoly_stack_t = [fmpz_mod_poly_bpoly_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_polyun_stack_struct {
    pub poly_stack: fmpz_mod_poly_stack_t,
    pub polyun_stack: fmpz_mod_polyun_stack_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_poly_polyun_stack_struct"]
        [::std::mem::size_of::<fmpz_mod_poly_polyun_stack_struct>() - 48usize];
    ["Alignment of fmpz_mod_poly_polyun_stack_struct"]
        [::std::mem::align_of::<fmpz_mod_poly_polyun_stack_struct>() - 8usize];
    ["Offset of field: fmpz_mod_poly_polyun_stack_struct::poly_stack"]
        [::std::mem::offset_of!(fmpz_mod_poly_polyun_stack_struct, poly_stack) - 0usize];
    ["Offset of field: fmpz_mod_poly_polyun_stack_struct::polyun_stack"]
        [::std::mem::offset_of!(fmpz_mod_poly_polyun_stack_struct, polyun_stack) - 24usize];
};
impl Default for fmpz_mod_poly_polyun_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_poly_polyun_stack_t = [fmpz_mod_poly_polyun_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_polyun_mpolyn_stack_struct {
    pub poly_stack: fmpz_mod_poly_stack_t,
    pub polyun_stack: fmpz_mod_polyun_stack_t,
    pub mpolyn_stack: fmpz_mod_mpolyn_stack_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_poly_polyun_mpolyn_stack_struct"]
        [::std::mem::size_of::<fmpz_mod_poly_polyun_mpolyn_stack_struct>() - 80usize];
    ["Alignment of fmpz_mod_poly_polyun_mpolyn_stack_struct"]
        [::std::mem::align_of::<fmpz_mod_poly_polyun_mpolyn_stack_struct>() - 8usize];
    ["Offset of field: fmpz_mod_poly_polyun_mpolyn_stack_struct::poly_stack"]
        [::std::mem::offset_of!(fmpz_mod_poly_polyun_mpolyn_stack_struct, poly_stack) - 0usize];
    ["Offset of field: fmpz_mod_poly_polyun_mpolyn_stack_struct::polyun_stack"]
        [::std::mem::offset_of!(fmpz_mod_poly_polyun_mpolyn_stack_struct, polyun_stack) - 24usize];
    ["Offset of field: fmpz_mod_poly_polyun_mpolyn_stack_struct::mpolyn_stack"]
        [::std::mem::offset_of!(fmpz_mod_poly_polyun_mpolyn_stack_struct, mpolyn_stack) - 48usize];
};
impl Default for fmpz_mod_poly_polyun_mpolyn_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_poly_polyun_mpolyn_stack_t = [fmpz_mod_poly_polyun_mpolyn_stack_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpolyv_struct {
    pub coeffs: *mut fmpz_mod_mpoly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_mpolyv_struct"][::std::mem::size_of::<fmpz_mod_mpolyv_struct>() - 24usize];
    ["Alignment of fmpz_mod_mpolyv_struct"]
        [::std::mem::align_of::<fmpz_mod_mpolyv_struct>() - 8usize];
    ["Offset of field: fmpz_mod_mpolyv_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_mod_mpolyv_struct, coeffs) - 0usize];
    ["Offset of field: fmpz_mod_mpolyv_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_mpolyv_struct, alloc) - 8usize];
    ["Offset of field: fmpz_mod_mpolyv_struct::length"]
        [::std::mem::offset_of!(fmpz_mod_mpolyv_struct, length) - 16usize];
};
impl Default for fmpz_mod_mpolyv_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_mpolyv_t = [fmpz_mod_mpolyv_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpoly_pfrac_struct {
    pub bits: mp_limb_t,
    pub w: mp_limb_signed_t,
    pub r: mp_limb_signed_t,
    pub inv_prod_dbetas: *mut fmpz_mod_poly_struct,
    pub inv_prod_dbetas_mvar: *mut fmpz_mod_mpoly_struct,
    pub dbetas: *mut fmpz_mod_poly_struct,
    pub dbetas_mvar: *mut fmpz_mod_mpoly_struct,
    pub prod_mbetas: *mut fmpz_mod_mpoly_struct,
    pub prod_mbetas_coeffs: *mut fmpz_mod_mpolyv_struct,
    pub mbetas: *mut fmpz_mod_mpoly_struct,
    pub deltas: *mut fmpz_mod_mpoly_struct,
    pub xalpha: *mut fmpz_mod_mpoly_struct,
    pub q: *mut fmpz_mod_mpoly_struct,
    pub G: *mut fmpz_mod_mpoly_geobucket_struct,
    pub qt: *mut fmpz_mod_mpoly_struct,
    pub newt: *mut fmpz_mod_mpoly_struct,
    pub delta_coeffs: *mut fmpz_mod_mpolyv_struct,
    pub T: fmpz_mod_mpoly_t,
    pub Q: fmpz_mod_mpoly_t,
    pub R: fmpz_mod_mpoly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_mpoly_pfrac_struct"]
        [::std::mem::size_of::<fmpz_mod_mpoly_pfrac_struct>() - 280usize];
    ["Alignment of fmpz_mod_mpoly_pfrac_struct"]
        [::std::mem::align_of::<fmpz_mod_mpoly_pfrac_struct>() - 8usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::bits"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, bits) - 0usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::w"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, w) - 8usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::r"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, r) - 16usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::inv_prod_dbetas"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, inv_prod_dbetas) - 24usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::inv_prod_dbetas_mvar"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, inv_prod_dbetas_mvar) - 32usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::dbetas"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, dbetas) - 40usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::dbetas_mvar"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, dbetas_mvar) - 48usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::prod_mbetas"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, prod_mbetas) - 56usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::prod_mbetas_coeffs"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, prod_mbetas_coeffs) - 64usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::mbetas"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, mbetas) - 72usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::deltas"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, deltas) - 80usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::xalpha"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, xalpha) - 88usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::q"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, q) - 96usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::G"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, G) - 104usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::qt"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, qt) - 112usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::newt"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, newt) - 120usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::delta_coeffs"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, delta_coeffs) - 128usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::T"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, T) - 136usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::Q"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, Q) - 184usize];
    ["Offset of field: fmpz_mod_mpoly_pfrac_struct::R"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_pfrac_struct, R) - 232usize];
};
impl Default for fmpz_mod_mpoly_pfrac_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_mpoly_pfrac_t = [fmpz_mod_mpoly_pfrac_struct; 1usize];
extern "C" {
    #[link_name = "fmpz_mod_mpoly_factor_init__extern"]
    pub fn fmpz_mod_mpoly_factor_init(
        f: *mut fmpz_mod_mpoly_factor_struct,
        ctx: *const fmpz_mod_mpoly_ctx_struct,
    );
    pub fn fmpz_mod_mpoly_factor_init2(
        f: *mut fmpz_mod_mpoly_factor_struct,
        alloc: mp_limb_signed_t,
        ctx: *const fmpz_mod_mpoly_ctx_struct,
    );
    pub fn fmpz_mod_mpoly_factor_realloc(
        f: *mut fmpz_mod_mpoly_factor_struct,
        alloc: mp_limb_signed_t,
