/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::flint::*;
use crate::fmpz_types::*;
use crate::nmod_types::*;


pub const FMPZ_POLY_INV_NEWTON_CUTOFF: u32 = 32;
pub const FMPZ_POLY_SQRT_DIVCONQUER_CUTOFF: u32 = 16;
pub const FMPZ_POLY_SQRTREM_DIVCONQUER_CUTOFF: u32 = 16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmpz_poly_powers_precomp_struct {
    pub powers: *mut *mut fmpz,
    pub len: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_poly_powers_precomp_struct"]
        [::std::mem::size_of::<fmpz_poly_powers_precomp_struct>() - 16usize];
    ["Alignment of fmpz_poly_powers_precomp_struct"]
        [::std::mem::align_of::<fmpz_poly_powers_precomp_struct>() - 8usize];
    ["Offset of field: fmpz_poly_powers_precomp_struct::powers"]
        [::std::mem::offset_of!(fmpz_poly_powers_precomp_struct, powers) - 0usize];
    ["Offset of field: fmpz_poly_powers_precomp_struct::len"]
        [::std::mem::offset_of!(fmpz_poly_powers_precomp_struct, len) - 8usize];
};
impl Default for fmpz_poly_powers_precomp_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_poly_powers_precomp_t = [fmpz_poly_powers_precomp_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmpz_poly_mul_precache_struct {
    pub jj: *mut *mut mp_limb_t,
    pub n: mp_limb_signed_t,
    pub len2: mp_limb_signed_t,
    pub loglen: mp_limb_signed_t,
    pub bits2: mp_limb_signed_t,
    pub limbs: mp_limb_signed_t,
    pub poly2: fmpz_poly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_poly_mul_precache_struct"]
        [::std::mem::size_of::<fmpz_poly_mul_precache_struct>() - 72usize];
    ["Alignment of fmpz_poly_mul_precache_struct"]
        [::std::mem::align_of::<fmpz_poly_mul_precache_struct>() - 8usize];
    ["Offset of field: fmpz_poly_mul_precache_struct::jj"]
        [::std::mem::offset_of!(fmpz_poly_mul_precache_struct, jj) - 0usize];
    ["Offset of field: fmpz_poly_mul_precache_struct::n"]
        [::std::mem::offset_of!(fmpz_poly_mul_precache_struct, n) - 8usize];
    ["Offset of field: fmpz_poly_mul_precache_struct::len2"]
        [::std::mem::offset_of!(fmpz_poly_mul_precache_struct, len2) - 16usize];
    ["Offset of field: fmpz_poly_mul_precache_struct::loglen"]
        [::std::mem::offset_of!(fmpz_poly_mul_precache_struct, loglen) - 24usize];
    ["Offset of field: fmpz_poly_mul_precache_struct::bits2"]
        [::std::mem::offset_of!(fmpz_poly_mul_precache_struct, bits2) - 32usize];
    ["Offset of field: fmpz_poly_mul_precache_struct::limbs"]
        [::std::mem::offset_of!(fmpz_poly_mul_precache_struct, limbs) - 40usize];
    ["Offset of field: fmpz_poly_mul_precache_struct::poly2"]
        [::std::mem::offset_of!(fmpz_poly_mul_precache_struct, poly2) - 48usize];
};
impl Default for fmpz_poly_mul_precache_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_poly_mul_precache_t = [fmpz_poly_mul_precache_struct; 1usize];
extern "C" {
    pub fn fmpz_poly_init(poly: *mut fmpz_poly_struct);
    pub fn fmpz_poly_init2(poly: *mut fmpz_poly_struct, alloc: mp_limb_signed_t);
    pub fn fmpz_poly_realloc(poly: *mut fmpz_poly_struct, alloc: mp_limb_signed_t);
    pub fn fmpz_poly_fit_length(poly: *mut fmpz_poly_struct, len: mp_limb_signed_t);
    pub fn fmpz_poly_clear(poly: *mut fmpz_poly_struct);
    pub fn _fmpz_poly_normalise(poly: *mut fmpz_poly_struct);
