/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::flint::*;
use crate::fmpz_types::*;


#[repr(C)]
pub struct _fmpz_multi_CRT_instr {
    pub a_idx: slong,
    pub b_idx: slong,
    pub c_idx: slong,
    pub b_modulus: fmpz_t,
    pub c_modulus: fmpz_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fmpz_multi_CRT_instr"][::std::mem::size_of::<_fmpz_multi_CRT_instr>() - 40usize];
    ["Alignment of _fmpz_multi_CRT_instr"]
        [::std::mem::align_of::<_fmpz_multi_CRT_instr>() - 8usize];
    ["Offset of field: _fmpz_multi_CRT_instr::a_idx"]
        [::std::mem::offset_of!(_fmpz_multi_CRT_instr, a_idx) - 0usize];
    ["Offset of field: _fmpz_multi_CRT_instr::b_idx"]
        [::std::mem::offset_of!(_fmpz_multi_CRT_instr, b_idx) - 8usize];
    ["Offset of field: _fmpz_multi_CRT_instr::c_idx"]
        [::std::mem::offset_of!(_fmpz_multi_CRT_instr, c_idx) - 16usize];
    ["Offset of field: _fmpz_multi_CRT_instr::b_modulus"]
        [::std::mem::offset_of!(_fmpz_multi_CRT_instr, b_modulus) - 24usize];
    ["Offset of field: _fmpz_multi_CRT_instr::c_modulus"]
        [::std::mem::offset_of!(_fmpz_multi_CRT_instr, c_modulus) - 32usize];
};
impl Default for _fmpz_multi_CRT_instr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct fmpz_multi_CRT_struct {
    pub prog: *mut _fmpz_multi_CRT_instr,
    pub moduli: *mut fmpz,
    pub fracmoduli: *mut fmpz,
    pub final_modulus: fmpz_t,
    pub moduli_count: slong,
    pub min_modulus_bits: flint_bitcnt_t,
    pub length: slong,
    pub alloc: slong,
    pub localsize: slong,
    pub temp1loc: slong,
    pub temp2loc: slong,
    pub temp3loc: slong,
    pub temp4loc: slong,
    pub good: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_multi_CRT_struct"][::std::mem::size_of::<fmpz_multi_CRT_struct>() - 112usize];
    ["Alignment of fmpz_multi_CRT_struct"]
        [::std::mem::align_of::<fmpz_multi_CRT_struct>() - 8usize];
    ["Offset of field: fmpz_multi_CRT_struct::prog"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, prog) - 0usize];
    ["Offset of field: fmpz_multi_CRT_struct::moduli"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, moduli) - 8usize];
    ["Offset of field: fmpz_multi_CRT_struct::fracmoduli"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, fracmoduli) - 16usize];
    ["Offset of field: fmpz_multi_CRT_struct::final_modulus"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, final_modulus) - 24usize];
    ["Offset of field: fmpz_multi_CRT_struct::moduli_count"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, moduli_count) - 32usize];
    ["Offset of field: fmpz_multi_CRT_struct::min_modulus_bits"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, min_modulus_bits) - 40usize];
    ["Offset of field: fmpz_multi_CRT_struct::length"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, length) - 48usize];
    ["Offset of field: fmpz_multi_CRT_struct::alloc"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, alloc) - 56usize];
    ["Offset of field: fmpz_multi_CRT_struct::localsize"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, localsize) - 64usize];
    ["Offset of field: fmpz_multi_CRT_struct::temp1loc"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, temp1loc) - 72usize];
    ["Offset of field: fmpz_multi_CRT_struct::temp2loc"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, temp2loc) - 80usize];
    ["Offset of field: fmpz_multi_CRT_struct::temp3loc"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, temp3loc) - 88usize];
    ["Offset of field: fmpz_multi_CRT_struct::temp4loc"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, temp4loc) - 96usize];
    ["Offset of field: fmpz_multi_CRT_struct::good"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, good) - 104usize];
};
impl Default for fmpz_multi_CRT_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_multi_CRT_t = [fmpz_multi_CRT_struct; 1usize];
#[repr(C)]
pub struct _fmpz_multi_mod_instr {
    pub in_idx: slong,
    pub out_idx: slong,
    pub modulus: fmpz_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fmpz_multi_mod_instr"][::std::mem::size_of::<_fmpz_multi_mod_instr>() - 24usize];
    ["Alignment of _fmpz_multi_mod_instr"]
        [::std::mem::align_of::<_fmpz_multi_mod_instr>() - 8usize];
    ["Offset of field: _fmpz_multi_mod_instr::in_idx"]
        [::std::mem::offset_of!(_fmpz_multi_mod_instr, in_idx) - 0usize];
    ["Offset of field: _fmpz_multi_mod_instr::out_idx"]
        [::std::mem::offset_of!(_fmpz_multi_mod_instr, out_idx) - 8usize];
    ["Offset of field: _fmpz_multi_mod_instr::modulus"]
        [::std::mem::offset_of!(_fmpz_multi_mod_instr, modulus) - 16usize];
};
impl Default for _fmpz_multi_mod_instr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct fmpz_multi_mod_struct {
    pub prog: *mut _fmpz_multi_mod_instr,
    pub moduli: *mut fmpz,
    pub moduli_count: slong,
    pub min_modulus_bits: flint_bitcnt_t,
    pub length: slong,
    pub alloc: slong,
    pub localsize: slong,
    pub temp1loc: slong,
    pub good: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_multi_mod_struct"][::std::mem::size_of::<fmpz_multi_mod_struct>() - 72usize];
    ["Alignment of fmpz_multi_mod_struct"]
        [::std::mem::align_of::<fmpz_multi_mod_struct>() - 8usize];
    ["Offset of field: fmpz_multi_mod_struct::prog"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, prog) - 0usize];
    ["Offset of field: fmpz_multi_mod_struct::moduli"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, moduli) - 8usize];
    ["Offset of field: fmpz_multi_mod_struct::moduli_count"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, moduli_count) - 16usize];
    ["Offset of field: fmpz_multi_mod_struct::min_modulus_bits"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, min_modulus_bits) - 24usize];
    ["Offset of field: fmpz_multi_mod_struct::length"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, length) - 32usize];
    ["Offset of field: fmpz_multi_mod_struct::alloc"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, alloc) - 40usize];
    ["Offset of field: fmpz_multi_mod_struct::localsize"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, localsize) - 48usize];
    ["Offset of field: fmpz_multi_mod_struct::temp1loc"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, temp1loc) - 56usize];
    ["Offset of field: fmpz_multi_mod_struct::good"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, good) - 64usize];
};
impl Default for fmpz_multi_mod_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_multi_mod_t = [fmpz_multi_mod_struct; 1usize];
#[repr(C)]
pub struct crt_lut_entry {
    pub mod_: nmod_t,
    pub i0: ulong,
    pub i1: ulong,
    pub i2: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of crt_lut_entry"][::std::mem::size_of::<crt_lut_entry>() - 48usize];
    ["Alignment of crt_lut_entry"][::std::mem::align_of::<crt_lut_entry>() - 8usize];
    ["Offset of field: crt_lut_entry::mod_"][::std::mem::offset_of!(crt_lut_entry, mod_) - 0usize];
    ["Offset of field: crt_lut_entry::i0"][::std::mem::offset_of!(crt_lut_entry, i0) - 24usize];
    ["Offset of field: crt_lut_entry::i1"][::std::mem::offset_of!(crt_lut_entry, i1) - 32usize];
    ["Offset of field: crt_lut_entry::i2"][::std::mem::offset_of!(crt_lut_entry, i2) - 40usize];
};
impl Default for crt_lut_entry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mod_lut_entry {
    pub mod_: nmod_t,
    pub mod0: nmod_t,
    pub mod1: nmod_t,
    pub mod2: nmod_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mod_lut_entry"][::std::mem::size_of::<mod_lut_entry>() - 96usize];
    ["Alignment of mod_lut_entry"][::std::mem::align_of::<mod_lut_entry>() - 8usize];
    ["Offset of field: mod_lut_entry::mod_"][::std::mem::offset_of!(mod_lut_entry, mod_) - 0usize];
    ["Offset of field: mod_lut_entry::mod0"][::std::mem::offset_of!(mod_lut_entry, mod0) - 24usize];
    ["Offset of field: mod_lut_entry::mod1"][::std::mem::offset_of!(mod_lut_entry, mod1) - 48usize];
    ["Offset of field: mod_lut_entry::mod2"][::std::mem::offset_of!(mod_lut_entry, mod2) - 72usize];
};
impl Default for mod_lut_entry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct fmpz_comb_struct {
    pub crt_P: fmpz_multi_CRT_t,
    pub mod_P: fmpz_multi_mod_t,
    pub packed_multipliers: *mut ulong,
    pub step: *mut slong,
    pub crt_offsets: *mut slong,
    pub crt_offsets_alloc: slong,
    pub mod_offsets: *mut slong,
    pub mod_offsets_alloc: slong,
    pub crt_lu: *mut crt_lut_entry,
    pub crt_lu_alloc: slong,
    pub crt_klen: slong,
    pub mod_lu: *mut mod_lut_entry,
    pub mod_lu_alloc: slong,
    pub mod_klen: slong,
    pub num_primes: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_comb_struct"][::std::mem::size_of::<fmpz_comb_struct>() - 288usize];
    ["Alignment of fmpz_comb_struct"][::std::mem::align_of::<fmpz_comb_struct>() - 8usize];
    ["Offset of field: fmpz_comb_struct::crt_P"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_P) - 0usize];
    ["Offset of field: fmpz_comb_struct::mod_P"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_P) - 112usize];
    ["Offset of field: fmpz_comb_struct::packed_multipliers"]
        [::std::mem::offset_of!(fmpz_comb_struct, packed_multipliers) - 184usize];
    ["Offset of field: fmpz_comb_struct::step"]
        [::std::mem::offset_of!(fmpz_comb_struct, step) - 192usize];
    ["Offset of field: fmpz_comb_struct::crt_offsets"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_offsets) - 200usize];
    ["Offset of field: fmpz_comb_struct::crt_offsets_alloc"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_offsets_alloc) - 208usize];
    ["Offset of field: fmpz_comb_struct::mod_offsets"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_offsets) - 216usize];
    ["Offset of field: fmpz_comb_struct::mod_offsets_alloc"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_offsets_alloc) - 224usize];
    ["Offset of field: fmpz_comb_struct::crt_lu"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_lu) - 232usize];
    ["Offset of field: fmpz_comb_struct::crt_lu_alloc"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_lu_alloc) - 240usize];
    ["Offset of field: fmpz_comb_struct::crt_klen"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_klen) - 248usize];
    ["Offset of field: fmpz_comb_struct::mod_lu"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_lu) - 256usize];
    ["Offset of field: fmpz_comb_struct::mod_lu_alloc"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_lu_alloc) - 264usize];
    ["Offset of field: fmpz_comb_struct::mod_klen"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_klen) - 272usize];
    ["Offset of field: fmpz_comb_struct::num_primes"]
        [::std::mem::offset_of!(fmpz_comb_struct, num_primes) - 280usize];
};
impl Default for fmpz_comb_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_comb_t = [fmpz_comb_struct; 1usize];
#[repr(C)]
pub struct fmpz_comb_temp_struct {
    pub Alen: slong,
    pub Tlen: slong,
    pub A: *mut fmpz,
    pub T: *mut fmpz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_comb_temp_struct"][::std::mem::size_of::<fmpz_comb_temp_struct>() - 32usize];
    ["Alignment of fmpz_comb_temp_struct"]
        [::std::mem::align_of::<fmpz_comb_temp_struct>() - 8usize];
    ["Offset of field: fmpz_comb_temp_struct::Alen"]
        [::std::mem::offset_of!(fmpz_comb_temp_struct, Alen) - 0usize];
    ["Offset of field: fmpz_comb_temp_struct::Tlen"]
        [::std::mem::offset_of!(fmpz_comb_temp_struct, Tlen) - 8usize];
    ["Offset of field: fmpz_comb_temp_struct::A"]
        [::std::mem::offset_of!(fmpz_comb_temp_struct, A) - 16usize];
    ["Offset of field: fmpz_comb_temp_struct::T"]
        [::std::mem::offset_of!(fmpz_comb_temp_struct, T) - 24usize];
};
impl Default for fmpz_comb_temp_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_comb_temp_t = [fmpz_comb_temp_struct; 1usize];
extern "C" {
    pub fn _fmpz_new_mpz() -> mpz_ptr;
    pub fn _fmpz_promote(f: *mut fmpz) -> mpz_ptr;
    pub fn _fmpz_promote_val(f: *mut fmpz) -> mpz_ptr;
    pub fn _fmpz_init_readonly_mpz(f: *mut fmpz, z: *const __mpz_struct);
    pub fn flint_mpz_init_set_readonly(z: *mut __mpz_struct, f: *const fmpz);
    pub fn fmpz_init_set_readonly(f: *mut fmpz, z: *const __mpz_struct);
    pub fn flint_mpz_clear_readonly(z: *mut __mpz_struct);
    pub fn _fmpz_clear_readonly_mpz(arg1: *mut __mpz_struct);
    pub fn _fmpz_clear_mpz(f: fmpz);
