/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::bindgen::*;
use crate::acb::*;
use crate::acb_calc::*;
use crate::acb_dft::*;
use crate::acb_dirichlet::*;
use crate::acb_elliptic::*;
use crate::acb_hypgeom::*;
use crate::acb_mat::*;
use crate::acb_modular::*;
use crate::acb_poly::*;
use crate::acb_theta::*;
use crate::acb_types::*;
use crate::acf::*;
use crate::acf_types::*;
use crate::aprcl::*;
use crate::arb::*;
use crate::arb_calc::*;
use crate::arb_fmpz_poly::*;
use crate::arb_fpwrap::*;
use crate::arb_hypgeom::*;
use crate::arb_mat::*;
use crate::arb_poly::*;
use crate::arb_types::*;
use crate::arf::*;
use crate::arf_types::*;
use crate::arith::*;
use crate::bernoulli::*;
use crate::bool_mat::*;
use crate::ca::*;
use crate::ca_ext::*;
use crate::ca_field::*;
use crate::ca_mat::*;
use crate::ca_poly::*;
use crate::ca_vec::*;
use crate::calcium::*;
use crate::d_mat::*;
use crate::d_vec::*;
use crate::dirichlet::*;
use crate::dlog::*;
use crate::double_extras::*;
use crate::double_interval::*;
use crate::fexpr::*;
use crate::fexpr_builtin::*;
use crate::fft::*;
use crate::fft_tuning::*;
use crate::flint_config::*;
use crate::flint::*;
use crate::fmpq::*;
use crate::fmpq_mat::*;
use crate::fmpq_mpoly::*;
use crate::fmpq_mpoly_factor::*;
use crate::fmpq_poly::*;
use crate::fmpq_types::*;
use crate::fmpq_vec::*;
use crate::fmpz::*;
use crate::fmpz_extras::*;
use crate::fmpz_factor::*;
use crate::fmpz_lll::*;

use crate::fmpz_mod_mpoly::*;
use crate::fmpz_mod_mpoly_factor::*;
use crate::fmpz_mod_poly_factor::*;
use crate::fmpz_mod_types::*;
use crate::fmpz_mod_vec::*;
use crate::fmpz_mpoly::*;
use crate::fmpz_mpoly_factor::*;
use crate::fmpz_mpoly_q::*;
use crate::fmpz_poly::*;
use crate::fmpz_poly_factor::*;
use crate::fmpz_poly_mat::*;
use crate::fmpz_poly_q::*;
use crate::fmpz_types::*;
use crate::fmpz_vec::*;
use crate::fmpzi::*;
use crate::fq::*;
use crate::fq_default::*;
use crate::fq_default_mat::*;
use crate::fq_default_poly::*;
use crate::fq_default_poly_factor::*;
use crate::fq_embed::*;
use crate::fq_embed_templates::*;
use crate::fq_mat::*;
use crate::fq_mat_templates::*;
use crate::fq_nmod::*;
use crate::fq_nmod_embed::*;
use crate::fq_nmod_mat::*;
use crate::fq_nmod_mpoly::*;
use crate::fq_nmod_mpoly_factor::*;
use crate::fq_nmod_poly::*;
use crate::fq_nmod_poly_factor::*;
use crate::fq_nmod_types::*;
use crate::fq_nmod_vec::*;
use crate::fq_poly::*;
use crate::fq_poly_factor::*;
use crate::fq_poly_factor_templates::*;
use crate::fq_poly_templates::*;
use crate::fq_templates::*;
use crate::fq_types::*;
use crate::fq_vec::*;
use crate::fq_vec_templates::*;
use crate::fq_zech::*;
use crate::fq_zech_embed::*;
use crate::fq_zech_mat::*;
use crate::fq_zech_mpoly::*;
use crate::fq_zech_mpoly_factor::*;
use crate::fq_zech_poly::*;
use crate::fq_zech_poly_factor::*;
use crate::fq_zech_types::*;
use crate::fq_zech_vec::*;
use crate::gmpcompat::*;
use crate::gr::*;
use crate::gr_generic::*;
use crate::gr_mat::*;
use crate::gr_mpoly::*;
use crate::gr_poly::*;
use crate::gr_special::*;
use crate::gr_vec::*;
use crate::hypgeom::*;
use crate::limb_types::*;
use crate::long_extras::*;
use crate::longlong::*;
use crate::mag::*;
use crate::mpf_impl::*;
use crate::mpfr_mat::*;
use crate::mpfr_vec::*;
use crate::mpoly::*;
use crate::mpoly_types::*;
use crate::n_poly::*;
use crate::n_poly_types::*;
use crate::nf::*;
use crate::nf_elem::*;
use crate::nmod::*;
use crate::nmod_mat::*;
use crate::nmod_mpoly::*;
use crate::nmod_mpoly_factor::*;
use crate::nmod_poly::*;
use crate::nmod_poly_factor::*;
use crate::nmod_poly_mat::*;
use crate::nmod_types::*;
use crate::nmod_vec::*;
use crate::padic::*;
use crate::padic_mat::*;
use crate::padic_poly::*;
use crate::padic_types::*;
use crate::partitions::*;
use crate::perm::*;
use crate::qadic::*;
use crate::qfb::*;
use crate::qqbar::*;
use crate::qsieve::*;
use crate::templates::*;
use crate::thread_pool::*;
use crate::thread_support::*;
use crate::ulong_extras::*;


pub const FMPZ_MOD_POLY_HGCD_CUTOFF: u32 = 128;
pub const FMPZ_MOD_POLY_GCD_CUTOFF: u32 = 256;
pub const FMPZ_MOD_POLY_INV_NEWTON_CUTOFF: u32 = 64;
pub const FMPZ_MOD_POLY_EVALUATE_FMPZ_VEC: u32 = 32;
#[repr(C)]
pub struct fmpz_mod_poly_res_struct {
    pub res: fmpz_t,
    pub lc: fmpz_t,
    pub len0: mp_limb_signed_t,
    pub len1: mp_limb_signed_t,
    pub off: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_poly_res_struct"]
        [::std::mem::size_of::<fmpz_mod_poly_res_struct>() - 40usize];
    ["Alignment of fmpz_mod_poly_res_struct"]
        [::std::mem::align_of::<fmpz_mod_poly_res_struct>() - 8usize];
    ["Offset of field: fmpz_mod_poly_res_struct::res"]
        [::std::mem::offset_of!(fmpz_mod_poly_res_struct, res) - 0usize];
    ["Offset of field: fmpz_mod_poly_res_struct::lc"]
        [::std::mem::offset_of!(fmpz_mod_poly_res_struct, lc) - 8usize];
    ["Offset of field: fmpz_mod_poly_res_struct::len0"]
        [::std::mem::offset_of!(fmpz_mod_poly_res_struct, len0) - 16usize];
    ["Offset of field: fmpz_mod_poly_res_struct::len1"]
        [::std::mem::offset_of!(fmpz_mod_poly_res_struct, len1) - 24usize];
    ["Offset of field: fmpz_mod_poly_res_struct::off"]
        [::std::mem::offset_of!(fmpz_mod_poly_res_struct, off) - 32usize];
};
impl Default for fmpz_mod_poly_res_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_poly_res_t = [fmpz_mod_poly_res_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_frobenius_powers_2exp_struct {
    pub pow: *mut fmpz_mod_poly_struct,
    pub len: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_poly_frobenius_powers_2exp_struct"]
        [::std::mem::size_of::<fmpz_mod_poly_frobenius_powers_2exp_struct>() - 16usize];
    ["Alignment of fmpz_mod_poly_frobenius_powers_2exp_struct"]
        [::std::mem::align_of::<fmpz_mod_poly_frobenius_powers_2exp_struct>() - 8usize];
    ["Offset of field: fmpz_mod_poly_frobenius_powers_2exp_struct::pow"]
        [::std::mem::offset_of!(fmpz_mod_poly_frobenius_powers_2exp_struct, pow) - 0usize];
    ["Offset of field: fmpz_mod_poly_frobenius_powers_2exp_struct::len"]
        [::std::mem::offset_of!(fmpz_mod_poly_frobenius_powers_2exp_struct, len) - 8usize];
};
impl Default for fmpz_mod_poly_frobenius_powers_2exp_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_poly_frobenius_powers_2exp_t =
    [fmpz_mod_poly_frobenius_powers_2exp_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_poly_frobenius_powers_struct {
    pub pow: *mut fmpz_mod_poly_struct,
    pub len: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_poly_frobenius_powers_struct"]
        [::std::mem::size_of::<fmpz_mod_poly_frobenius_powers_struct>() - 16usize];
    ["Alignment of fmpz_mod_poly_frobenius_powers_struct"]
        [::std::mem::align_of::<fmpz_mod_poly_frobenius_powers_struct>() - 8usize];
    ["Offset of field: fmpz_mod_poly_frobenius_powers_struct::pow"]
        [::std::mem::offset_of!(fmpz_mod_poly_frobenius_powers_struct, pow) - 0usize];
    ["Offset of field: fmpz_mod_poly_frobenius_powers_struct::len"]
        [::std::mem::offset_of!(fmpz_mod_poly_frobenius_powers_struct, len) - 8usize];
};
impl Default for fmpz_mod_poly_frobenius_powers_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_poly_frobenius_powers_t = [fmpz_mod_poly_frobenius_powers_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmpz_mod_poly_matrix_precompute_arg_t {
    pub A: *mut fmpz_mat_struct,
    pub poly1: *mut fmpz_mod_poly_struct,
    pub poly2: *mut fmpz_mod_poly_struct,
    pub poly2inv: *mut fmpz_mod_poly_struct,
    pub ctx: *const fmpz_mod_ctx_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_poly_matrix_precompute_arg_t"]
        [::std::mem::size_of::<fmpz_mod_poly_matrix_precompute_arg_t>() - 40usize];
    ["Alignment of fmpz_mod_poly_matrix_precompute_arg_t"]
        [::std::mem::align_of::<fmpz_mod_poly_matrix_precompute_arg_t>() - 8usize];
    ["Offset of field: fmpz_mod_poly_matrix_precompute_arg_t::A"]
        [::std::mem::offset_of!(fmpz_mod_poly_matrix_precompute_arg_t, A) - 0usize];
    ["Offset of field: fmpz_mod_poly_matrix_precompute_arg_t::poly1"]
        [::std::mem::offset_of!(fmpz_mod_poly_matrix_precompute_arg_t, poly1) - 8usize];
    ["Offset of field: fmpz_mod_poly_matrix_precompute_arg_t::poly2"]
        [::std::mem::offset_of!(fmpz_mod_poly_matrix_precompute_arg_t, poly2) - 16usize];
    ["Offset of field: fmpz_mod_poly_matrix_precompute_arg_t::poly2inv"]
        [::std::mem::offset_of!(fmpz_mod_poly_matrix_precompute_arg_t, poly2inv) - 24usize];
    ["Offset of field: fmpz_mod_poly_matrix_precompute_arg_t::ctx"]
        [::std::mem::offset_of!(fmpz_mod_poly_matrix_precompute_arg_t, ctx) - 32usize];
};
impl Default for fmpz_mod_poly_matrix_precompute_arg_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmpz_mod_poly_compose_mod_precomp_preinv_arg_t {
    pub A: *mut fmpz_mat_struct,
    pub res: *mut fmpz_mod_poly_struct,
    pub poly1: *mut fmpz_mod_poly_struct,
    pub poly3: *mut fmpz_mod_poly_struct,
    pub poly3inv: *mut fmpz_mod_poly_struct,
    pub ctx: *const fmpz_mod_ctx_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_poly_compose_mod_precomp_preinv_arg_t"]
        [::std::mem::size_of::<fmpz_mod_poly_compose_mod_precomp_preinv_arg_t>() - 48usize];
    ["Alignment of fmpz_mod_poly_compose_mod_precomp_preinv_arg_t"]
        [::std::mem::align_of::<fmpz_mod_poly_compose_mod_precomp_preinv_arg_t>() - 8usize];
    ["Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::A"]
        [::std::mem::offset_of!(fmpz_mod_poly_compose_mod_precomp_preinv_arg_t, A) - 0usize];
    ["Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::res"]
        [::std::mem::offset_of!(fmpz_mod_poly_compose_mod_precomp_preinv_arg_t, res) - 8usize];
    ["Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::poly1"]
        [::std::mem::offset_of!(fmpz_mod_poly_compose_mod_precomp_preinv_arg_t, poly1) - 16usize];
    ["Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::poly3"]
        [::std::mem::offset_of!(fmpz_mod_poly_compose_mod_precomp_preinv_arg_t, poly3) - 24usize];
    ["Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::poly3inv"][::std::mem::offset_of!(
        fmpz_mod_poly_compose_mod_precomp_preinv_arg_t,
        poly3inv
    ) - 32usize];
    ["Offset of field: fmpz_mod_poly_compose_mod_precomp_preinv_arg_t::ctx"]
        [::std::mem::offset_of!(fmpz_mod_poly_compose_mod_precomp_preinv_arg_t, ctx) - 40usize];
};
impl Default for fmpz_mod_poly_compose_mod_precomp_preinv_arg_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct fmpz_mod_poly_radix_struct {
    pub V: *mut fmpz,
    pub W: *mut fmpz,
    pub Rpow: *mut *mut fmpz,
    pub Rinv: *mut *mut fmpz,
    pub degR: mp_limb_signed_t,
    pub k: mp_limb_signed_t,
    pub invL: fmpz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_poly_radix_struct"]
        [::std::mem::size_of::<fmpz_mod_poly_radix_struct>() - 56usize];
    ["Alignment of fmpz_mod_poly_radix_struct"]
        [::std::mem::align_of::<fmpz_mod_poly_radix_struct>() - 8usize];
    ["Offset of field: fmpz_mod_poly_radix_struct::V"]
        [::std::mem::offset_of!(fmpz_mod_poly_radix_struct, V) - 0usize];
    ["Offset of field: fmpz_mod_poly_radix_struct::W"]
        [::std::mem::offset_of!(fmpz_mod_poly_radix_struct, W) - 8usize];
    ["Offset of field: fmpz_mod_poly_radix_struct::Rpow"]
        [::std::mem::offset_of!(fmpz_mod_poly_radix_struct, Rpow) - 16usize];
    ["Offset of field: fmpz_mod_poly_radix_struct::Rinv"]
        [::std::mem::offset_of!(fmpz_mod_poly_radix_struct, Rinv) - 24usize];
    ["Offset of field: fmpz_mod_poly_radix_struct::degR"]
        [::std::mem::offset_of!(fmpz_mod_poly_radix_struct, degR) - 32usize];
    ["Offset of field: fmpz_mod_poly_radix_struct::k"]
        [::std::mem::offset_of!(fmpz_mod_poly_radix_struct, k) - 40usize];
    ["Offset of field: fmpz_mod_poly_radix_struct::invL"]
        [::std::mem::offset_of!(fmpz_mod_poly_radix_struct, invL) - 48usize];
};
impl Default for fmpz_mod_poly_radix_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_poly_radix_t = [fmpz_mod_poly_radix_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_berlekamp_massey_struct {
    pub npoints: mp_limb_signed_t,
    pub R0: fmpz_mod_poly_t,
    pub R1: fmpz_mod_poly_t,
    pub V0: fmpz_mod_poly_t,
    pub V1: fmpz_mod_poly_t,
    pub qt: fmpz_mod_poly_t,
    pub rt: fmpz_mod_poly_t,
    pub points: fmpz_mod_poly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_berlekamp_massey_struct"]
        [::std::mem::size_of::<fmpz_mod_berlekamp_massey_struct>() - 176usize];
    ["Alignment of fmpz_mod_berlekamp_massey_struct"]
        [::std::mem::align_of::<fmpz_mod_berlekamp_massey_struct>() - 8usize];
    ["Offset of field: fmpz_mod_berlekamp_massey_struct::npoints"]
        [::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, npoints) - 0usize];
    ["Offset of field: fmpz_mod_berlekamp_massey_struct::R0"]
        [::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, R0) - 8usize];
    ["Offset of field: fmpz_mod_berlekamp_massey_struct::R1"]
        [::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, R1) - 32usize];
    ["Offset of field: fmpz_mod_berlekamp_massey_struct::V0"]
        [::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, V0) - 56usize];
    ["Offset of field: fmpz_mod_berlekamp_massey_struct::V1"]
        [::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, V1) - 80usize];
    ["Offset of field: fmpz_mod_berlekamp_massey_struct::qt"]
        [::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, qt) - 104usize];
    ["Offset of field: fmpz_mod_berlekamp_massey_struct::rt"]
        [::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, rt) - 128usize];
    ["Offset of field: fmpz_mod_berlekamp_massey_struct::points"]
        [::std::mem::offset_of!(fmpz_mod_berlekamp_massey_struct, points) - 152usize];
};
impl Default for fmpz_mod_berlekamp_massey_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_berlekamp_massey_t = [fmpz_mod_berlekamp_massey_struct; 1usize];
extern "C" {
    #[link_name = "fmpz_mod_poly_init__extern"]
    pub fn fmpz_mod_poly_init(poly: *mut fmpz_mod_poly_struct, ctx: *const fmpz_mod_ctx_struct);
    pub fn fmpz_mod_poly_init2(
        poly: *mut fmpz_mod_poly_struct,
        alloc: mp_limb_signed_t,
        ctx: *const fmpz_mod_ctx_struct,
    );
    pub fn fmpz_mod_poly_clear(poly: *mut fmpz_mod_poly_struct, ctx: *const fmpz_mod_ctx_struct);
    pub fn fmpz_mod_poly_realloc(
        poly: *mut fmpz_mod_poly_struct,
