/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::flint::*;
use crate::fmpz_mod_types::*;
use crate::fmpz_types::*;
use crate::mpoly_types::*;
use crate::nmod_types::*;


#[repr(C)]
pub struct fmpz_mod_mpoly_univar_struct {
    pub coeffs: *mut fmpz_mod_mpoly_struct,
    pub exps: *mut fmpz,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_mpoly_univar_struct"]
        [::std::mem::size_of::<fmpz_mod_mpoly_univar_struct>() - 32usize];
    ["Alignment of fmpz_mod_mpoly_univar_struct"]
        [::std::mem::align_of::<fmpz_mod_mpoly_univar_struct>() - 8usize];
    ["Offset of field: fmpz_mod_mpoly_univar_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_univar_struct, coeffs) - 0usize];
    ["Offset of field: fmpz_mod_mpoly_univar_struct::exps"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_univar_struct, exps) - 8usize];
    ["Offset of field: fmpz_mod_mpoly_univar_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_univar_struct, alloc) - 16usize];
    ["Offset of field: fmpz_mod_mpoly_univar_struct::length"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_univar_struct, length) - 24usize];
};
impl Default for fmpz_mod_mpoly_univar_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_mpoly_univar_t = [fmpz_mod_mpoly_univar_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpoly_geobucket {
    pub polys: [fmpz_mod_mpoly_struct; 32usize],
    pub temps: [fmpz_mod_mpoly_struct; 32usize],
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_mpoly_geobucket"]
        [::std::mem::size_of::<fmpz_mod_mpoly_geobucket>() - 3080usize];
    ["Alignment of fmpz_mod_mpoly_geobucket"]
        [::std::mem::align_of::<fmpz_mod_mpoly_geobucket>() - 8usize];
    ["Offset of field: fmpz_mod_mpoly_geobucket::polys"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_geobucket, polys) - 0usize];
    ["Offset of field: fmpz_mod_mpoly_geobucket::temps"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_geobucket, temps) - 1536usize];
    ["Offset of field: fmpz_mod_mpoly_geobucket::length"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_geobucket, length) - 3072usize];
};
impl Default for fmpz_mod_mpoly_geobucket {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_mpoly_geobucket_struct = fmpz_mod_mpoly_geobucket;
pub type fmpz_mod_mpoly_geobucket_t = [fmpz_mod_mpoly_geobucket_struct; 1usize];
#[repr(C)]
pub struct fmpz_mod_mpoly_vec_struct {
    pub p: *mut fmpz_mod_mpoly_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mod_mpoly_vec_struct"]
        [::std::mem::size_of::<fmpz_mod_mpoly_vec_struct>() - 24usize];
    ["Alignment of fmpz_mod_mpoly_vec_struct"]
        [::std::mem::align_of::<fmpz_mod_mpoly_vec_struct>() - 8usize];
    ["Offset of field: fmpz_mod_mpoly_vec_struct::p"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_vec_struct, p) - 0usize];
    ["Offset of field: fmpz_mod_mpoly_vec_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_vec_struct, alloc) - 8usize];
    ["Offset of field: fmpz_mod_mpoly_vec_struct::length"]
        [::std::mem::offset_of!(fmpz_mod_mpoly_vec_struct, length) - 16usize];
};
impl Default for fmpz_mod_mpoly_vec_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mod_mpoly_vec_t = [fmpz_mod_mpoly_vec_struct; 1usize];
extern "C" {
    pub fn fmpz_mod_mpoly_ctx_init(
        ctx: *mut fmpz_mod_mpoly_ctx_struct,
        nvars: slong,
        ord: ordering_t,
        modulus: *const fmpz,
    );
    pub fn fmpz_mod_mpoly_ctx_init_rand(
        ctx: *mut fmpz_mod_mpoly_ctx_struct,
        state: *mut flint_rand_struct,
        max_nvars: slong,
        modulus: *const fmpz,
    );
    pub fn fmpz_mod_mpoly_ctx_init_rand_bits_prime(
        ctx: *mut fmpz_mod_mpoly_ctx_struct,
        state: *mut flint_rand_struct,
        max_nvars: slong,
