/* automatically generated by rust-bindgen 0.70.1 */

#![allow(non_camel_case_types)]
use crate::deps::*;
use crate::flint::*;
use crate::fmpz_types::*;
use crate::mpoly_types::*;
use libc::{c_char, c_int, c_uint, c_void, size_t, FILE};


#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmpz_mpoly_univar_struct {
    pub coeffs: *mut fmpz_mpoly_struct,
    pub exps: *mut fmpz,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mpoly_univar_struct"]
        [::std::mem::size_of::<fmpz_mpoly_univar_struct>() - 32usize];
    ["Alignment of fmpz_mpoly_univar_struct"]
        [::std::mem::align_of::<fmpz_mpoly_univar_struct>() - 8usize];
    ["Offset of field: fmpz_mpoly_univar_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_mpoly_univar_struct, coeffs) - 0usize];
    ["Offset of field: fmpz_mpoly_univar_struct::exps"]
        [::std::mem::offset_of!(fmpz_mpoly_univar_struct, exps) - 8usize];
    ["Offset of field: fmpz_mpoly_univar_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mpoly_univar_struct, alloc) - 16usize];
    ["Offset of field: fmpz_mpoly_univar_struct::length"]
        [::std::mem::offset_of!(fmpz_mpoly_univar_struct, length) - 24usize];
};
impl Default for fmpz_mpoly_univar_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mpoly_univar_t = [fmpz_mpoly_univar_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmpz_mpolyd_struct {
    pub nvars: mp_limb_signed_t,
    pub degb_alloc: mp_limb_signed_t,
    pub deg_bounds: *mut mp_limb_signed_t,
    pub length: mp_limb_signed_t,
    pub coeff_alloc: mp_limb_signed_t,
    pub coeffs: *mut fmpz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mpolyd_struct"][::std::mem::size_of::<fmpz_mpolyd_struct>() - 48usize];
    ["Alignment of fmpz_mpolyd_struct"][::std::mem::align_of::<fmpz_mpolyd_struct>() - 8usize];
    ["Offset of field: fmpz_mpolyd_struct::nvars"]
        [::std::mem::offset_of!(fmpz_mpolyd_struct, nvars) - 0usize];
    ["Offset of field: fmpz_mpolyd_struct::degb_alloc"]
        [::std::mem::offset_of!(fmpz_mpolyd_struct, degb_alloc) - 8usize];
    ["Offset of field: fmpz_mpolyd_struct::deg_bounds"]
        [::std::mem::offset_of!(fmpz_mpolyd_struct, deg_bounds) - 16usize];
    ["Offset of field: fmpz_mpolyd_struct::length"]
        [::std::mem::offset_of!(fmpz_mpolyd_struct, length) - 24usize];
    ["Offset of field: fmpz_mpolyd_struct::coeff_alloc"]
        [::std::mem::offset_of!(fmpz_mpolyd_struct, coeff_alloc) - 32usize];
    ["Offset of field: fmpz_mpolyd_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_mpolyd_struct, coeffs) - 40usize];
};
impl Default for fmpz_mpolyd_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mpolyd_t = [fmpz_mpolyd_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmpz_mpoly_vec_struct {
    pub p: *mut fmpz_mpoly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mpoly_vec_struct"][::std::mem::size_of::<fmpz_mpoly_vec_struct>() - 24usize];
    ["Alignment of fmpz_mpoly_vec_struct"]
        [::std::mem::align_of::<fmpz_mpoly_vec_struct>() - 8usize];
    ["Offset of field: fmpz_mpoly_vec_struct::p"]
        [::std::mem::offset_of!(fmpz_mpoly_vec_struct, p) - 0usize];
    ["Offset of field: fmpz_mpoly_vec_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mpoly_vec_struct, alloc) - 8usize];
    ["Offset of field: fmpz_mpoly_vec_struct::length"]
        [::std::mem::offset_of!(fmpz_mpoly_vec_struct, length) - 16usize];
};
impl Default for fmpz_mpoly_vec_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mpoly_vec_t = [fmpz_mpoly_vec_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _fmpz_mpoly_stripe_struct {
    pub big_mem: *mut ::std::os::raw::c_char,
    pub big_mem_alloc: mp_limb_signed_t,
    pub N: mp_limb_signed_t,
    pub bits: mp_limb_t,
    pub cmpmask: *const mp_limb_t,
    pub startidx: *mut mp_limb_signed_t,
    pub endidx: *mut mp_limb_signed_t,
    pub emin: *mut mp_limb_t,
    pub emax: *mut mp_limb_t,
    pub coeff_bits: mp_limb_t,
    pub upperclosed: ::std::os::raw::c_int,
    pub flint_small: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fmpz_mpoly_stripe_struct"]
        [::std::mem::size_of::<_fmpz_mpoly_stripe_struct>() - 88usize];
    ["Alignment of _fmpz_mpoly_stripe_struct"]
        [::std::mem::align_of::<_fmpz_mpoly_stripe_struct>() - 8usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::big_mem"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, big_mem) - 0usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::big_mem_alloc"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, big_mem_alloc) - 8usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::N"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, N) - 16usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::bits"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, bits) - 24usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::cmpmask"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, cmpmask) - 32usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::startidx"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, startidx) - 40usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::endidx"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, endidx) - 48usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::emin"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, emin) - 56usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::emax"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, emax) - 64usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::coeff_bits"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, coeff_bits) - 72usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::upperclosed"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, upperclosed) - 80usize];
    ["Offset of field: _fmpz_mpoly_stripe_struct::flint_small"]
        [::std::mem::offset_of!(_fmpz_mpoly_stripe_struct, flint_small) - 84usize];
};
impl Default for _fmpz_mpoly_stripe_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mpoly_stripe_struct = _fmpz_mpoly_stripe_struct;
pub type fmpz_mpoly_stripe_t = [fmpz_mpoly_stripe_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmpz_mpolyd_ctx_struct {
    pub nvars: mp_limb_signed_t,
    pub perm: *mut mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mpolyd_ctx_struct"][::std::mem::size_of::<fmpz_mpolyd_ctx_struct>() - 16usize];
    ["Alignment of fmpz_mpolyd_ctx_struct"]
        [::std::mem::align_of::<fmpz_mpolyd_ctx_struct>() - 8usize];
    ["Offset of field: fmpz_mpolyd_ctx_struct::nvars"]
        [::std::mem::offset_of!(fmpz_mpolyd_ctx_struct, nvars) - 0usize];
    ["Offset of field: fmpz_mpolyd_ctx_struct::perm"]
        [::std::mem::offset_of!(fmpz_mpolyd_ctx_struct, perm) - 8usize];
};
impl Default for fmpz_mpolyd_ctx_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mpolyd_ctx_t = [fmpz_mpolyd_ctx_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_ty_3 {
    pub powers: *mut fmpz,
    pub length: mp_limb_signed_t,
    pub alloc: mp_limb_signed_t,
    pub tmp: fmpz_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_ty_3"][::std::mem::size_of::<_bindgen_ty_3>() - 32usize];
    ["Alignment of _bindgen_ty_3"][::std::mem::align_of::<_bindgen_ty_3>() - 8usize];
    ["Offset of field: _bindgen_ty_3::powers"]
        [::std::mem::offset_of!(_bindgen_ty_3, powers) - 0usize];
    ["Offset of field: _bindgen_ty_3::length"]
        [::std::mem::offset_of!(_bindgen_ty_3, length) - 8usize];
    ["Offset of field: _bindgen_ty_3::alloc"]
        [::std::mem::offset_of!(_bindgen_ty_3, alloc) - 16usize];
    ["Offset of field: _bindgen_ty_3::tmp"][::std::mem::offset_of!(_bindgen_ty_3, tmp) - 24usize];
};
impl Default for _bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_pow_cache_t = [_bindgen_ty_3; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmpz_mpoly_geobucket {
    pub polys: [fmpz_mpoly_struct; 32usize],
    pub temps: [fmpz_mpoly_struct; 32usize],
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mpoly_geobucket"][::std::mem::size_of::<fmpz_mpoly_geobucket>() - 2568usize];
    ["Alignment of fmpz_mpoly_geobucket"][::std::mem::align_of::<fmpz_mpoly_geobucket>() - 8usize];
    ["Offset of field: fmpz_mpoly_geobucket::polys"]
        [::std::mem::offset_of!(fmpz_mpoly_geobucket, polys) - 0usize];
    ["Offset of field: fmpz_mpoly_geobucket::temps"]
        [::std::mem::offset_of!(fmpz_mpoly_geobucket, temps) - 1280usize];
    ["Offset of field: fmpz_mpoly_geobucket::length"]
        [::std::mem::offset_of!(fmpz_mpoly_geobucket, length) - 2560usize];
};
impl Default for fmpz_mpoly_geobucket {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mpoly_geobucket_struct = fmpz_mpoly_geobucket;
pub type fmpz_mpoly_geobucket_t = [fmpz_mpoly_geobucket_struct; 1usize];
extern "C" {
    pub fn fmpz_mpoly_ctx_init(
        ctx: *mut fmpz_mpoly_ctx_struct,
        nvars: mp_limb_signed_t,
        ord: ordering_t,
    );
    pub fn fmpz_mpoly_ctx_init_rand(
        mctx: *mut fmpz_mpoly_ctx_struct,
        state: *mut flint_rand_s,
        max_nvars: mp_limb_signed_t,
    );
    pub fn fmpz_mpoly_ctx_clear(ctx: *mut fmpz_mpoly_ctx_struct);
    pub fn fmpz_mpoly_init(A: *mut fmpz_mpoly_struct, ctx: *const fmpz_mpoly_ctx_struct);
