/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::bindgen::*;
use crate::acb::*;
use crate::acb_calc::*;
use crate::acb_dft::*;
use crate::acb_dirichlet::*;
use crate::acb_elliptic::*;
use crate::acb_hypgeom::*;
use crate::acb_mat::*;
use crate::acb_modular::*;
use crate::acb_poly::*;
use crate::acb_theta::*;
use crate::acb_types::*;
use crate::acf::*;
use crate::acf_types::*;
use crate::aprcl::*;
use crate::arb::*;
use crate::arb_calc::*;
use crate::arb_fmpz_poly::*;
use crate::arb_fpwrap::*;
use crate::arb_hypgeom::*;
use crate::arb_mat::*;
use crate::arb_poly::*;
use crate::arb_types::*;
use crate::arf::*;
use crate::arf_types::*;
use crate::arith::*;
use crate::bernoulli::*;
use crate::bool_mat::*;
use crate::ca::*;
use crate::ca_ext::*;
use crate::ca_field::*;
use crate::ca_mat::*;
use crate::ca_poly::*;
use crate::ca_vec::*;
use crate::calcium::*;
use crate::d_mat::*;
use crate::d_vec::*;
use crate::dirichlet::*;
use crate::dlog::*;
use crate::double_extras::*;
use crate::double_interval::*;
use crate::fexpr::*;
use crate::fexpr_builtin::*;
use crate::fft::*;
use crate::fft_tuning::*;
use crate::flint_config::*;
use crate::flint::*;
use crate::fmpq::*;
use crate::fmpq_mat::*;
use crate::fmpq_mpoly::*;
use crate::fmpq_mpoly_factor::*;
use crate::fmpq_poly::*;
use crate::fmpq_types::*;
use crate::fmpq_vec::*;
use crate::fmpz::*;
use crate::fmpz_extras::*;
use crate::fmpz_factor::*;
use crate::fmpz_lll::*;
use crate::fmpz_mat::*;
use crate::fmpz_mod::*;
use crate::fmpz_mod_mat::*;
use crate::fmpz_mod_mpoly::*;
use crate::fmpz_mod_mpoly_factor::*;
use crate::fmpz_mod_poly::*;
use crate::fmpz_mod_poly_factor::*;
use crate::fmpz_mod_types::*;
use crate::fmpz_mod_vec::*;
use crate::fmpz_mpoly::*;
use crate::fmpz_mpoly_q::*;
use crate::fmpz_poly::*;
use crate::fmpz_poly_factor::*;
use crate::fmpz_poly_mat::*;
use crate::fmpz_poly_q::*;
use crate::fmpz_types::*;
use crate::fmpz_vec::*;
use crate::fmpzi::*;
use crate::fq::*;
use crate::fq_default::*;
use crate::fq_default_mat::*;
use crate::fq_default_poly::*;
use crate::fq_default_poly_factor::*;
use crate::fq_embed::*;
use crate::fq_embed_templates::*;
use crate::fq_mat::*;
use crate::fq_mat_templates::*;
use crate::fq_nmod::*;
use crate::fq_nmod_embed::*;
use crate::fq_nmod_mat::*;
use crate::fq_nmod_mpoly::*;
use crate::fq_nmod_mpoly_factor::*;
use crate::fq_nmod_poly::*;
use crate::fq_nmod_poly_factor::*;
use crate::fq_nmod_types::*;
use crate::fq_nmod_vec::*;
use crate::fq_poly::*;
use crate::fq_poly_factor::*;
use crate::fq_poly_factor_templates::*;
use crate::fq_poly_templates::*;
use crate::fq_templates::*;
use crate::fq_types::*;
use crate::fq_vec::*;
use crate::fq_vec_templates::*;
use crate::fq_zech::*;
use crate::fq_zech_embed::*;
use crate::fq_zech_mat::*;
use crate::fq_zech_mpoly::*;
use crate::fq_zech_mpoly_factor::*;
use crate::fq_zech_poly::*;
use crate::fq_zech_poly_factor::*;
use crate::fq_zech_types::*;
use crate::fq_zech_vec::*;
use crate::gmpcompat::*;
use crate::gr::*;
use crate::gr_generic::*;
use crate::gr_mat::*;
use crate::gr_mpoly::*;
use crate::gr_poly::*;
use crate::gr_special::*;
use crate::gr_vec::*;
use crate::hypgeom::*;
use crate::limb_types::*;
use crate::long_extras::*;
use crate::longlong::*;
use crate::mag::*;
use crate::mpf_impl::*;
use crate::mpfr_mat::*;
use crate::mpfr_vec::*;
use crate::mpoly::*;
use crate::mpoly_types::*;
use crate::n_poly::*;
use crate::n_poly_types::*;
use crate::nf::*;
use crate::nf_elem::*;
use crate::nmod::*;
use crate::nmod_mat::*;
use crate::nmod_mpoly::*;
use crate::nmod_mpoly_factor::*;
use crate::nmod_poly::*;
use crate::nmod_poly_factor::*;
use crate::nmod_poly_mat::*;
use crate::nmod_types::*;
use crate::nmod_vec::*;
use crate::padic::*;
use crate::padic_mat::*;
use crate::padic_poly::*;
use crate::padic_types::*;
use crate::partitions::*;
use crate::perm::*;
use crate::qadic::*;
use crate::qfb::*;
use crate::qqbar::*;
use crate::qsieve::*;
use crate::templates::*;
use crate::thread_pool::*;
use crate::thread_support::*;
use crate::ulong_extras::*;


#[repr(C)]
pub struct fmpz_mpolyv_struct {
    pub coeffs: *mut fmpz_mpoly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mpolyv_struct"][::std::mem::size_of::<fmpz_mpolyv_struct>() - 24usize];
    ["Alignment of fmpz_mpolyv_struct"][::std::mem::align_of::<fmpz_mpolyv_struct>() - 8usize];
    ["Offset of field: fmpz_mpolyv_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_mpolyv_struct, coeffs) - 0usize];
    ["Offset of field: fmpz_mpolyv_struct::alloc"]
        [::std::mem::offset_of!(fmpz_mpolyv_struct, alloc) - 8usize];
    ["Offset of field: fmpz_mpolyv_struct::length"]
        [::std::mem::offset_of!(fmpz_mpolyv_struct, length) - 16usize];
};
impl Default for fmpz_mpolyv_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mpolyv_t = [fmpz_mpolyv_struct; 1usize];
#[repr(C)]
pub struct fmpz_poly_pfrac_struct {
    pub r: mp_limb_signed_t,
    pub bits: *mut mp_limb_t,
    pub a: fmpz_poly_t,
    pub newa: fmpz_poly_t,
    pub t: fmpz_poly_t,
    pub b: *mut fmpz_poly_struct,
    pub bprod: *mut fmpz_poly_struct,
    pub old_pk: fmpz_t,
    pub pk: fmpz_t,
    pub p: fmpz_t,
    pub halfpks: *mut fmpz,
    pub ctxp: fmpz_mod_ctx_t,
    pub ctxs: *mut fmpz_mod_ctx_struct,
    pub T: fmpz_mod_poly_t,
    pub R: fmpz_mod_poly_t,
    pub Q: fmpz_mod_poly_t,
    pub B: *mut fmpz_mod_poly_struct,
    pub invBprod: *mut fmpz_mod_poly_struct,
    pub inwBprod: *mut fmpz_mod_poly_struct,
    pub B_inv: *mut fmpz_mod_poly_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_poly_pfrac_struct"][::std::mem::size_of::<fmpz_poly_pfrac_struct>() - 360usize];
    ["Alignment of fmpz_poly_pfrac_struct"]
        [::std::mem::align_of::<fmpz_poly_pfrac_struct>() - 8usize];
    ["Offset of field: fmpz_poly_pfrac_struct::r"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, r) - 0usize];
    ["Offset of field: fmpz_poly_pfrac_struct::bits"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, bits) - 8usize];
    ["Offset of field: fmpz_poly_pfrac_struct::a"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, a) - 16usize];
    ["Offset of field: fmpz_poly_pfrac_struct::newa"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, newa) - 40usize];
    ["Offset of field: fmpz_poly_pfrac_struct::t"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, t) - 64usize];
    ["Offset of field: fmpz_poly_pfrac_struct::b"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, b) - 88usize];
    ["Offset of field: fmpz_poly_pfrac_struct::bprod"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, bprod) - 96usize];
    ["Offset of field: fmpz_poly_pfrac_struct::old_pk"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, old_pk) - 104usize];
    ["Offset of field: fmpz_poly_pfrac_struct::pk"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, pk) - 112usize];
    ["Offset of field: fmpz_poly_pfrac_struct::p"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, p) - 120usize];
    ["Offset of field: fmpz_poly_pfrac_struct::halfpks"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, halfpks) - 128usize];
    ["Offset of field: fmpz_poly_pfrac_struct::ctxp"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, ctxp) - 136usize];
    ["Offset of field: fmpz_poly_pfrac_struct::ctxs"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, ctxs) - 248usize];
    ["Offset of field: fmpz_poly_pfrac_struct::T"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, T) - 256usize];
    ["Offset of field: fmpz_poly_pfrac_struct::R"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, R) - 280usize];
    ["Offset of field: fmpz_poly_pfrac_struct::Q"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, Q) - 304usize];
    ["Offset of field: fmpz_poly_pfrac_struct::B"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, B) - 328usize];
    ["Offset of field: fmpz_poly_pfrac_struct::invBprod"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, invBprod) - 336usize];
    ["Offset of field: fmpz_poly_pfrac_struct::inwBprod"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, inwBprod) - 344usize];
    ["Offset of field: fmpz_poly_pfrac_struct::B_inv"]
        [::std::mem::offset_of!(fmpz_poly_pfrac_struct, B_inv) - 352usize];
};
impl Default for fmpz_poly_pfrac_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_poly_pfrac_t = [fmpz_poly_pfrac_struct; 1usize];
#[repr(C)]
pub struct fmpz_mpoly_pfrac_struct {
    pub bits: mp_limb_t,
    pub w: mp_limb_signed_t,
    pub r: mp_limb_signed_t,
    pub prod_mbetas: *mut fmpz_mpoly_struct,
    pub prod_mbetas_coeffs: *mut fmpz_mpolyv_struct,
    pub mbetas: *mut fmpz_mpoly_struct,
    pub deltas: *mut fmpz_mpoly_struct,
    pub xalpha: *mut fmpz_mpoly_struct,
    pub q: *mut fmpz_mpoly_struct,
    pub U: *mut fmpz_mpoly_univar_struct,
    pub G: *mut fmpz_mpoly_geobucket_struct,
    pub qt: *mut fmpz_mpoly_struct,
    pub newt: *mut fmpz_mpoly_struct,
    pub delta_coeffs: *mut fmpz_mpolyv_struct,
    pub uni_pfrac: fmpz_poly_pfrac_t,
    pub uni_a: fmpz_poly_t,
    pub uni_c: *mut fmpz_poly_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_mpoly_pfrac_struct"]
        [::std::mem::size_of::<fmpz_mpoly_pfrac_struct>() - 504usize];
    ["Alignment of fmpz_mpoly_pfrac_struct"]
        [::std::mem::align_of::<fmpz_mpoly_pfrac_struct>() - 8usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::bits"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, bits) - 0usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::w"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, w) - 8usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::r"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, r) - 16usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::prod_mbetas"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, prod_mbetas) - 24usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::prod_mbetas_coeffs"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, prod_mbetas_coeffs) - 32usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::mbetas"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, mbetas) - 40usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::deltas"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, deltas) - 48usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::xalpha"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, xalpha) - 56usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::q"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, q) - 64usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::U"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, U) - 72usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::G"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, G) - 80usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::qt"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, qt) - 88usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::newt"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, newt) - 96usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::delta_coeffs"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, delta_coeffs) - 104usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::uni_pfrac"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, uni_pfrac) - 112usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::uni_a"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, uni_a) - 472usize];
    ["Offset of field: fmpz_mpoly_pfrac_struct::uni_c"]
        [::std::mem::offset_of!(fmpz_mpoly_pfrac_struct, uni_c) - 496usize];
};
impl Default for fmpz_mpoly_pfrac_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_mpoly_pfrac_t = [fmpz_mpoly_pfrac_struct; 1usize];
#[repr(C)]
pub struct fmpz_bpoly_struct {
    pub coeffs: *mut fmpz_poly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_bpoly_struct"][::std::mem::size_of::<fmpz_bpoly_struct>() - 24usize];
    ["Alignment of fmpz_bpoly_struct"][::std::mem::align_of::<fmpz_bpoly_struct>() - 8usize];
    ["Offset of field: fmpz_bpoly_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_bpoly_struct, coeffs) - 0usize];
    ["Offset of field: fmpz_bpoly_struct::alloc"]
        [::std::mem::offset_of!(fmpz_bpoly_struct, alloc) - 8usize];
    ["Offset of field: fmpz_bpoly_struct::length"]
        [::std::mem::offset_of!(fmpz_bpoly_struct, length) - 16usize];
};
impl Default for fmpz_bpoly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_bpoly_t = [fmpz_bpoly_struct; 1usize];
#[repr(C)]
pub struct fmpz_tpoly_struct {
    pub coeffs: *mut fmpz_bpoly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_tpoly_struct"][::std::mem::size_of::<fmpz_tpoly_struct>() - 24usize];
    ["Alignment of fmpz_tpoly_struct"][::std::mem::align_of::<fmpz_tpoly_struct>() - 8usize];
    ["Offset of field: fmpz_tpoly_struct::coeffs"]
        [::std::mem::offset_of!(fmpz_tpoly_struct, coeffs) - 0usize];
    ["Offset of field: fmpz_tpoly_struct::alloc"]
        [::std::mem::offset_of!(fmpz_tpoly_struct, alloc) - 8usize];
    ["Offset of field: fmpz_tpoly_struct::length"]
        [::std::mem::offset_of!(fmpz_tpoly_struct, length) - 16usize];
};
impl Default for fmpz_tpoly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_tpoly_t = [fmpz_tpoly_struct; 1usize];
extern "C" {
    pub fn tuple_print(alpha: *mut fmpz, n: mp_limb_signed_t);
    pub fn tuple_saturate(alpha: *mut fmpz, n: mp_limb_signed_t, m: mp_limb_signed_t);
    pub fn tuple_next(alpha: *mut fmpz, n: mp_limb_signed_t);
    #[link_name = "fmpz_mpoly_factor_init__extern"]
    pub fn fmpz_mpoly_factor_init(
        f: *mut fmpz_mpoly_factor_struct,
        ctx: *const fmpz_mpoly_ctx_struct,
    );
    pub fn fmpz_mpoly_factor_init2(
        f: *mut fmpz_mpoly_factor_struct,
        alloc: mp_limb_signed_t,
        ctx: *const fmpz_mpoly_ctx_struct,
    );
