/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::bindgen::*;
use crate::acb::*;
use crate::acb_calc::*;
use crate::acb_dft::*;
use crate::acb_dirichlet::*;
use crate::acb_elliptic::*;
use crate::acb_hypgeom::*;
use crate::acb_mat::*;
use crate::acb_modular::*;
use crate::acb_poly::*;
use crate::acb_theta::*;
use crate::acb_types::*;
use crate::acf::*;
use crate::acf_types::*;
use crate::aprcl::*;
use crate::arb::*;
use crate::arb_calc::*;
use crate::arb_fmpz_poly::*;
use crate::arb_fpwrap::*;
use crate::arb_hypgeom::*;
use crate::arb_mat::*;
use crate::arb_poly::*;
use crate::arb_types::*;
use crate::arf::*;
use crate::arf_types::*;
use crate::arith::*;
use crate::bernoulli::*;
use crate::bool_mat::*;
use crate::ca::*;
use crate::ca_ext::*;
use crate::ca_field::*;
use crate::ca_mat::*;
use crate::ca_poly::*;
use crate::ca_vec::*;
use crate::calcium::*;
use crate::d_mat::*;
use crate::d_vec::*;
use crate::dirichlet::*;
use crate::dlog::*;
use crate::double_extras::*;
use crate::double_interval::*;
use crate::fexpr::*;
use crate::fexpr_builtin::*;
use crate::fft::*;
use crate::fft_tuning::*;
use crate::flint_config::*;
use crate::flint::*;
use crate::fmpq::*;
use crate::fmpq_mat::*;
use crate::fmpq_mpoly::*;
use crate::fmpq_mpoly_factor::*;
use crate::fmpq_poly::*;
use crate::fmpq_types::*;
use crate::fmpq_vec::*;
use crate::fmpz_extras::*;
use crate::fmpz_factor::*;
use crate::fmpz_lll::*;
use crate::fmpz_mat::*;
use crate::fmpz_mod::*;
use crate::fmpz_mod_mat::*;
use crate::fmpz_mod_mpoly::*;
use crate::fmpz_mod_mpoly_factor::*;
use crate::fmpz_mod_poly::*;
use crate::fmpz_mod_poly_factor::*;
use crate::fmpz_mod_types::*;
use crate::fmpz_mod_vec::*;
use crate::fmpz_mpoly::*;
use crate::fmpz_mpoly_factor::*;
use crate::fmpz_mpoly_q::*;
use crate::fmpz_poly::*;
use crate::fmpz_poly_factor::*;
use crate::fmpz_poly_mat::*;
use crate::fmpz_poly_q::*;
use crate::fmpz_types::*;
use crate::fmpz_vec::*;
use crate::fmpzi::*;
use crate::fq::*;
use crate::fq_default::*;
use crate::fq_default_mat::*;
use crate::fq_default_poly::*;
use crate::fq_default_poly_factor::*;
use crate::fq_embed::*;
use crate::fq_embed_templates::*;
use crate::fq_mat::*;
use crate::fq_mat_templates::*;
use crate::fq_nmod::*;
use crate::fq_nmod_embed::*;
use crate::fq_nmod_mat::*;
use crate::fq_nmod_mpoly::*;
use crate::fq_nmod_mpoly_factor::*;
use crate::fq_nmod_poly::*;
use crate::fq_nmod_poly_factor::*;
use crate::fq_nmod_types::*;
use crate::fq_nmod_vec::*;
use crate::fq_poly::*;
use crate::fq_poly_factor::*;
use crate::fq_poly_factor_templates::*;
use crate::fq_poly_templates::*;
use crate::fq_templates::*;
use crate::fq_types::*;
use crate::fq_vec::*;
use crate::fq_vec_templates::*;
use crate::fq_zech::*;
use crate::fq_zech_embed::*;
use crate::fq_zech_mat::*;
use crate::fq_zech_mpoly::*;
use crate::fq_zech_mpoly_factor::*;
use crate::fq_zech_poly::*;
use crate::fq_zech_poly_factor::*;
use crate::fq_zech_types::*;
use crate::fq_zech_vec::*;
use crate::gmpcompat::*;
use crate::gr::*;
use crate::gr_generic::*;
use crate::gr_mat::*;
use crate::gr_mpoly::*;
use crate::gr_poly::*;
use crate::gr_special::*;
use crate::gr_vec::*;
use crate::hypgeom::*;
use crate::limb_types::*;
use crate::long_extras::*;
use crate::longlong::*;
use crate::mag::*;
use crate::mpf_impl::*;
use crate::mpfr_mat::*;
use crate::mpfr_vec::*;
use crate::mpoly::*;
use crate::mpoly_types::*;
use crate::n_poly::*;
use crate::n_poly_types::*;
use crate::nf::*;
use crate::nf_elem::*;
use crate::nmod::*;
use crate::nmod_mat::*;
use crate::nmod_mpoly::*;
use crate::nmod_mpoly_factor::*;
use crate::nmod_poly::*;
use crate::nmod_poly_factor::*;
use crate::nmod_poly_mat::*;
use crate::nmod_types::*;
use crate::nmod_vec::*;
use crate::padic::*;
use crate::padic_mat::*;
use crate::padic_poly::*;
use crate::padic_types::*;
use crate::partitions::*;
use crate::perm::*;
use crate::qadic::*;
use crate::qfb::*;
use crate::qqbar::*;
use crate::qsieve::*;
use crate::templates::*;
use crate::thread_pool::*;
use crate::thread_support::*;
use crate::ulong_extras::*;


#[repr(C)]
pub struct _fmpz_multi_CRT_instr {
    pub a_idx: mp_limb_signed_t,
    pub b_idx: mp_limb_signed_t,
    pub c_idx: mp_limb_signed_t,
    pub b_modulus: fmpz_t,
    pub c_modulus: fmpz_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fmpz_multi_CRT_instr"][::std::mem::size_of::<_fmpz_multi_CRT_instr>() - 40usize];
    ["Alignment of _fmpz_multi_CRT_instr"]
        [::std::mem::align_of::<_fmpz_multi_CRT_instr>() - 8usize];
    ["Offset of field: _fmpz_multi_CRT_instr::a_idx"]
        [::std::mem::offset_of!(_fmpz_multi_CRT_instr, a_idx) - 0usize];
    ["Offset of field: _fmpz_multi_CRT_instr::b_idx"]
        [::std::mem::offset_of!(_fmpz_multi_CRT_instr, b_idx) - 8usize];
    ["Offset of field: _fmpz_multi_CRT_instr::c_idx"]
        [::std::mem::offset_of!(_fmpz_multi_CRT_instr, c_idx) - 16usize];
    ["Offset of field: _fmpz_multi_CRT_instr::b_modulus"]
        [::std::mem::offset_of!(_fmpz_multi_CRT_instr, b_modulus) - 24usize];
    ["Offset of field: _fmpz_multi_CRT_instr::c_modulus"]
        [::std::mem::offset_of!(_fmpz_multi_CRT_instr, c_modulus) - 32usize];
};
impl Default for _fmpz_multi_CRT_instr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct fmpz_multi_CRT_struct {
    pub prog: *mut _fmpz_multi_CRT_instr,
    pub moduli: *mut fmpz,
    pub fracmoduli: *mut fmpz,
    pub final_modulus: fmpz_t,
    pub moduli_count: mp_limb_signed_t,
    pub min_modulus_bits: mp_limb_t,
    pub length: mp_limb_signed_t,
    pub alloc: mp_limb_signed_t,
    pub localsize: mp_limb_signed_t,
    pub temp1loc: mp_limb_signed_t,
    pub temp2loc: mp_limb_signed_t,
    pub temp3loc: mp_limb_signed_t,
    pub temp4loc: mp_limb_signed_t,
    pub good: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_multi_CRT_struct"][::std::mem::size_of::<fmpz_multi_CRT_struct>() - 112usize];
    ["Alignment of fmpz_multi_CRT_struct"]
        [::std::mem::align_of::<fmpz_multi_CRT_struct>() - 8usize];
    ["Offset of field: fmpz_multi_CRT_struct::prog"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, prog) - 0usize];
    ["Offset of field: fmpz_multi_CRT_struct::moduli"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, moduli) - 8usize];
    ["Offset of field: fmpz_multi_CRT_struct::fracmoduli"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, fracmoduli) - 16usize];
    ["Offset of field: fmpz_multi_CRT_struct::final_modulus"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, final_modulus) - 24usize];
    ["Offset of field: fmpz_multi_CRT_struct::moduli_count"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, moduli_count) - 32usize];
    ["Offset of field: fmpz_multi_CRT_struct::min_modulus_bits"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, min_modulus_bits) - 40usize];
    ["Offset of field: fmpz_multi_CRT_struct::length"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, length) - 48usize];
    ["Offset of field: fmpz_multi_CRT_struct::alloc"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, alloc) - 56usize];
    ["Offset of field: fmpz_multi_CRT_struct::localsize"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, localsize) - 64usize];
    ["Offset of field: fmpz_multi_CRT_struct::temp1loc"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, temp1loc) - 72usize];
    ["Offset of field: fmpz_multi_CRT_struct::temp2loc"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, temp2loc) - 80usize];
    ["Offset of field: fmpz_multi_CRT_struct::temp3loc"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, temp3loc) - 88usize];
    ["Offset of field: fmpz_multi_CRT_struct::temp4loc"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, temp4loc) - 96usize];
    ["Offset of field: fmpz_multi_CRT_struct::good"]
        [::std::mem::offset_of!(fmpz_multi_CRT_struct, good) - 104usize];
};
impl Default for fmpz_multi_CRT_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_multi_CRT_t = [fmpz_multi_CRT_struct; 1usize];
#[repr(C)]
pub struct _fmpz_multi_mod_instr {
    pub in_idx: mp_limb_signed_t,
    pub out_idx: mp_limb_signed_t,
    pub modulus: fmpz_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fmpz_multi_mod_instr"][::std::mem::size_of::<_fmpz_multi_mod_instr>() - 24usize];
    ["Alignment of _fmpz_multi_mod_instr"]
        [::std::mem::align_of::<_fmpz_multi_mod_instr>() - 8usize];
    ["Offset of field: _fmpz_multi_mod_instr::in_idx"]
        [::std::mem::offset_of!(_fmpz_multi_mod_instr, in_idx) - 0usize];
    ["Offset of field: _fmpz_multi_mod_instr::out_idx"]
        [::std::mem::offset_of!(_fmpz_multi_mod_instr, out_idx) - 8usize];
    ["Offset of field: _fmpz_multi_mod_instr::modulus"]
        [::std::mem::offset_of!(_fmpz_multi_mod_instr, modulus) - 16usize];
};
impl Default for _fmpz_multi_mod_instr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct fmpz_multi_mod_struct {
    pub prog: *mut _fmpz_multi_mod_instr,
    pub moduli: *mut fmpz,
    pub moduli_count: mp_limb_signed_t,
    pub min_modulus_bits: mp_limb_t,
    pub length: mp_limb_signed_t,
    pub alloc: mp_limb_signed_t,
    pub localsize: mp_limb_signed_t,
    pub temp1loc: mp_limb_signed_t,
    pub good: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_multi_mod_struct"][::std::mem::size_of::<fmpz_multi_mod_struct>() - 72usize];
    ["Alignment of fmpz_multi_mod_struct"]
        [::std::mem::align_of::<fmpz_multi_mod_struct>() - 8usize];
    ["Offset of field: fmpz_multi_mod_struct::prog"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, prog) - 0usize];
    ["Offset of field: fmpz_multi_mod_struct::moduli"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, moduli) - 8usize];
    ["Offset of field: fmpz_multi_mod_struct::moduli_count"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, moduli_count) - 16usize];
    ["Offset of field: fmpz_multi_mod_struct::min_modulus_bits"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, min_modulus_bits) - 24usize];
    ["Offset of field: fmpz_multi_mod_struct::length"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, length) - 32usize];
    ["Offset of field: fmpz_multi_mod_struct::alloc"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, alloc) - 40usize];
    ["Offset of field: fmpz_multi_mod_struct::localsize"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, localsize) - 48usize];
    ["Offset of field: fmpz_multi_mod_struct::temp1loc"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, temp1loc) - 56usize];
    ["Offset of field: fmpz_multi_mod_struct::good"]
        [::std::mem::offset_of!(fmpz_multi_mod_struct, good) - 64usize];
};
impl Default for fmpz_multi_mod_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_multi_mod_t = [fmpz_multi_mod_struct; 1usize];
#[repr(C)]
pub struct crt_lut_entry {
    pub mod_: nmod_t,
    pub i0: mp_limb_t,
    pub i1: mp_limb_t,
    pub i2: mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of crt_lut_entry"][::std::mem::size_of::<crt_lut_entry>() - 48usize];
    ["Alignment of crt_lut_entry"][::std::mem::align_of::<crt_lut_entry>() - 8usize];
    ["Offset of field: crt_lut_entry::mod_"][::std::mem::offset_of!(crt_lut_entry, mod_) - 0usize];
    ["Offset of field: crt_lut_entry::i0"][::std::mem::offset_of!(crt_lut_entry, i0) - 24usize];
    ["Offset of field: crt_lut_entry::i1"][::std::mem::offset_of!(crt_lut_entry, i1) - 32usize];
    ["Offset of field: crt_lut_entry::i2"][::std::mem::offset_of!(crt_lut_entry, i2) - 40usize];
};
impl Default for crt_lut_entry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mod_lut_entry {
    pub mod_: nmod_t,
    pub mod0: nmod_t,
    pub mod1: nmod_t,
    pub mod2: nmod_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mod_lut_entry"][::std::mem::size_of::<mod_lut_entry>() - 96usize];
    ["Alignment of mod_lut_entry"][::std::mem::align_of::<mod_lut_entry>() - 8usize];
    ["Offset of field: mod_lut_entry::mod_"][::std::mem::offset_of!(mod_lut_entry, mod_) - 0usize];
    ["Offset of field: mod_lut_entry::mod0"][::std::mem::offset_of!(mod_lut_entry, mod0) - 24usize];
    ["Offset of field: mod_lut_entry::mod1"][::std::mem::offset_of!(mod_lut_entry, mod1) - 48usize];
    ["Offset of field: mod_lut_entry::mod2"][::std::mem::offset_of!(mod_lut_entry, mod2) - 72usize];
};
impl Default for mod_lut_entry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct fmpz_comb_struct {
    pub crt_P: fmpz_multi_CRT_t,
    pub mod_P: fmpz_multi_mod_t,
    pub packed_multipliers: *mut mp_limb_t,
    pub step: *mut mp_limb_signed_t,
    pub crt_offsets: *mut mp_limb_signed_t,
    pub crt_offsets_alloc: mp_limb_signed_t,
    pub mod_offsets: *mut mp_limb_signed_t,
    pub mod_offsets_alloc: mp_limb_signed_t,
    pub crt_lu: *mut crt_lut_entry,
    pub crt_lu_alloc: mp_limb_signed_t,
    pub crt_klen: mp_limb_signed_t,
    pub mod_lu: *mut mod_lut_entry,
    pub mod_lu_alloc: mp_limb_signed_t,
    pub mod_klen: mp_limb_signed_t,
    pub num_primes: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_comb_struct"][::std::mem::size_of::<fmpz_comb_struct>() - 288usize];
    ["Alignment of fmpz_comb_struct"][::std::mem::align_of::<fmpz_comb_struct>() - 8usize];
    ["Offset of field: fmpz_comb_struct::crt_P"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_P) - 0usize];
    ["Offset of field: fmpz_comb_struct::mod_P"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_P) - 112usize];
    ["Offset of field: fmpz_comb_struct::packed_multipliers"]
        [::std::mem::offset_of!(fmpz_comb_struct, packed_multipliers) - 184usize];
    ["Offset of field: fmpz_comb_struct::step"]
        [::std::mem::offset_of!(fmpz_comb_struct, step) - 192usize];
    ["Offset of field: fmpz_comb_struct::crt_offsets"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_offsets) - 200usize];
    ["Offset of field: fmpz_comb_struct::crt_offsets_alloc"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_offsets_alloc) - 208usize];
    ["Offset of field: fmpz_comb_struct::mod_offsets"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_offsets) - 216usize];
    ["Offset of field: fmpz_comb_struct::mod_offsets_alloc"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_offsets_alloc) - 224usize];
    ["Offset of field: fmpz_comb_struct::crt_lu"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_lu) - 232usize];
    ["Offset of field: fmpz_comb_struct::crt_lu_alloc"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_lu_alloc) - 240usize];
    ["Offset of field: fmpz_comb_struct::crt_klen"]
        [::std::mem::offset_of!(fmpz_comb_struct, crt_klen) - 248usize];
    ["Offset of field: fmpz_comb_struct::mod_lu"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_lu) - 256usize];
    ["Offset of field: fmpz_comb_struct::mod_lu_alloc"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_lu_alloc) - 264usize];
    ["Offset of field: fmpz_comb_struct::mod_klen"]
        [::std::mem::offset_of!(fmpz_comb_struct, mod_klen) - 272usize];
    ["Offset of field: fmpz_comb_struct::num_primes"]
        [::std::mem::offset_of!(fmpz_comb_struct, num_primes) - 280usize];
};
impl Default for fmpz_comb_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_comb_t = [fmpz_comb_struct; 1usize];
#[repr(C)]
pub struct fmpz_comb_temp_struct {
    pub Alen: mp_limb_signed_t,
    pub Tlen: mp_limb_signed_t,
    pub A: *mut fmpz,
    pub T: *mut fmpz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fmpz_comb_temp_struct"][::std::mem::size_of::<fmpz_comb_temp_struct>() - 32usize];
    ["Alignment of fmpz_comb_temp_struct"]
        [::std::mem::align_of::<fmpz_comb_temp_struct>() - 8usize];
    ["Offset of field: fmpz_comb_temp_struct::Alen"]
        [::std::mem::offset_of!(fmpz_comb_temp_struct, Alen) - 0usize];
    ["Offset of field: fmpz_comb_temp_struct::Tlen"]
        [::std::mem::offset_of!(fmpz_comb_temp_struct, Tlen) - 8usize];
    ["Offset of field: fmpz_comb_temp_struct::A"]
        [::std::mem::offset_of!(fmpz_comb_temp_struct, A) - 16usize];
    ["Offset of field: fmpz_comb_temp_struct::T"]
        [::std::mem::offset_of!(fmpz_comb_temp_struct, T) - 24usize];
};
impl Default for fmpz_comb_temp_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fmpz_comb_temp_t = [fmpz_comb_temp_struct; 1usize];
extern "C" {
    pub fn _fmpz_new_mpz() -> mpz_ptr;
    pub fn _fmpz_clear_mpz(f: fmpz);
    pub fn _fmpz_cleanup_mpz_content();
    pub fn _fmpz_cleanup();
    pub fn _fmpz_promote(f: *mut fmpz) -> mpz_ptr;
    pub fn _fmpz_promote_val(f: *mut fmpz) -> mpz_ptr;
    #[link_name = "_fmpz_demote__extern"]
    pub fn _fmpz_demote(f: *mut fmpz);
    pub fn _fmpz_demote_val(f: *mut fmpz);
    #[link_name = "fmpz_init__extern"]
    pub fn fmpz_init(f: *mut fmpz);
    #[link_name = "fmpz_clear__extern"]
    pub fn fmpz_clear(f: *mut fmpz);
