/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::flint::*;
use crate::fmpz_types::*;
use crate::fq_nmod_types::*;
use crate::mpoly_types::*;
use crate::n_poly_types::*;
use crate::nmod_types::*;


#[repr(C)]
pub struct fq_nmod_mpoly_univar_struct {
    pub coeffs: *mut fq_nmod_mpoly_struct,
    pub exps: *mut fmpz,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_nmod_mpoly_univar_struct"]
        [::std::mem::size_of::<fq_nmod_mpoly_univar_struct>() - 32usize];
    ["Alignment of fq_nmod_mpoly_univar_struct"]
        [::std::mem::align_of::<fq_nmod_mpoly_univar_struct>() - 8usize];
    ["Offset of field: fq_nmod_mpoly_univar_struct::coeffs"]
        [::std::mem::offset_of!(fq_nmod_mpoly_univar_struct, coeffs) - 0usize];
    ["Offset of field: fq_nmod_mpoly_univar_struct::exps"]
        [::std::mem::offset_of!(fq_nmod_mpoly_univar_struct, exps) - 8usize];
    ["Offset of field: fq_nmod_mpoly_univar_struct::alloc"]
        [::std::mem::offset_of!(fq_nmod_mpoly_univar_struct, alloc) - 16usize];
    ["Offset of field: fq_nmod_mpoly_univar_struct::length"]
        [::std::mem::offset_of!(fq_nmod_mpoly_univar_struct, length) - 24usize];
};
impl Default for fq_nmod_mpoly_univar_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_nmod_mpoly_univar_t = [fq_nmod_mpoly_univar_struct; 1usize];
#[repr(C)]
pub struct fq_nmod_mpolyu_struct {
    pub coeffs: *mut fq_nmod_mpoly_struct,
    pub exps: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
    pub bits: mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_nmod_mpolyu_struct"][::std::mem::size_of::<fq_nmod_mpolyu_struct>() - 40usize];
    ["Alignment of fq_nmod_mpolyu_struct"]
        [::std::mem::align_of::<fq_nmod_mpolyu_struct>() - 8usize];
    ["Offset of field: fq_nmod_mpolyu_struct::coeffs"]
        [::std::mem::offset_of!(fq_nmod_mpolyu_struct, coeffs) - 0usize];
    ["Offset of field: fq_nmod_mpolyu_struct::exps"]
        [::std::mem::offset_of!(fq_nmod_mpolyu_struct, exps) - 8usize];
    ["Offset of field: fq_nmod_mpolyu_struct::alloc"]
        [::std::mem::offset_of!(fq_nmod_mpolyu_struct, alloc) - 16usize];
    ["Offset of field: fq_nmod_mpolyu_struct::length"]
        [::std::mem::offset_of!(fq_nmod_mpolyu_struct, length) - 24usize];
    ["Offset of field: fq_nmod_mpolyu_struct::bits"]
        [::std::mem::offset_of!(fq_nmod_mpolyu_struct, bits) - 32usize];
};
impl Default for fq_nmod_mpolyu_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_nmod_mpolyu_t = [fq_nmod_mpolyu_struct; 1usize];
#[repr(C)]
pub struct fq_nmod_mpolyn_struct {
    pub coeffs: *mut n_fq_poly_struct,
    pub exps: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
    pub bits: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_nmod_mpolyn_struct"][::std::mem::size_of::<fq_nmod_mpolyn_struct>() - 40usize];
    ["Alignment of fq_nmod_mpolyn_struct"]
        [::std::mem::align_of::<fq_nmod_mpolyn_struct>() - 8usize];
    ["Offset of field: fq_nmod_mpolyn_struct::coeffs"]
        [::std::mem::offset_of!(fq_nmod_mpolyn_struct, coeffs) - 0usize];
    ["Offset of field: fq_nmod_mpolyn_struct::exps"]
        [::std::mem::offset_of!(fq_nmod_mpolyn_struct, exps) - 8usize];
    ["Offset of field: fq_nmod_mpolyn_struct::alloc"]
        [::std::mem::offset_of!(fq_nmod_mpolyn_struct, alloc) - 16usize];
    ["Offset of field: fq_nmod_mpolyn_struct::length"]
        [::std::mem::offset_of!(fq_nmod_mpolyn_struct, length) - 24usize];
    ["Offset of field: fq_nmod_mpolyn_struct::bits"]
        [::std::mem::offset_of!(fq_nmod_mpolyn_struct, bits) - 32usize];
};
impl Default for fq_nmod_mpolyn_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_nmod_mpolyn_t = [fq_nmod_mpolyn_struct; 1usize];
#[repr(C)]
pub struct fq_nmod_mpolyun_struct {
    pub coeffs: *mut fq_nmod_mpolyn_struct,
    pub exps: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
    pub bits: mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_nmod_mpolyun_struct"][::std::mem::size_of::<fq_nmod_mpolyun_struct>() - 40usize];
    ["Alignment of fq_nmod_mpolyun_struct"]
        [::std::mem::align_of::<fq_nmod_mpolyun_struct>() - 8usize];
    ["Offset of field: fq_nmod_mpolyun_struct::coeffs"]
        [::std::mem::offset_of!(fq_nmod_mpolyun_struct, coeffs) - 0usize];
    ["Offset of field: fq_nmod_mpolyun_struct::exps"]
        [::std::mem::offset_of!(fq_nmod_mpolyun_struct, exps) - 8usize];
    ["Offset of field: fq_nmod_mpolyun_struct::alloc"]
        [::std::mem::offset_of!(fq_nmod_mpolyun_struct, alloc) - 16usize];
    ["Offset of field: fq_nmod_mpolyun_struct::length"]
        [::std::mem::offset_of!(fq_nmod_mpolyun_struct, length) - 24usize];
    ["Offset of field: fq_nmod_mpolyun_struct::bits"]
        [::std::mem::offset_of!(fq_nmod_mpolyun_struct, bits) - 32usize];
};
impl Default for fq_nmod_mpolyun_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_nmod_mpolyun_t = [fq_nmod_mpolyun_struct; 1usize];
#[repr(C)]
pub struct bad_fq_nmod_embed {
    pub smctx: *const fq_nmod_ctx_struct,
    pub phi_sm: fq_nmod_poly_t,
    pub h: fq_nmod_poly_t,
    pub h_as_n_fq_poly: n_fq_poly_t,
    pub lgctx: *const fq_nmod_ctx_struct,
    pub theta_lg: fq_nmod_t,
    pub x_lg: fq_nmod_t,
    pub lg_to_sm_mat: nmod_mat_t,
    pub sm_to_lg_mat: nmod_mat_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bad_fq_nmod_embed"][::std::mem::size_of::<bad_fq_nmod_embed>() - 296usize];
    ["Alignment of bad_fq_nmod_embed"][::std::mem::align_of::<bad_fq_nmod_embed>() - 8usize];
    ["Offset of field: bad_fq_nmod_embed::smctx"]
        [::std::mem::offset_of!(bad_fq_nmod_embed, smctx) - 0usize];
    ["Offset of field: bad_fq_nmod_embed::phi_sm"]
        [::std::mem::offset_of!(bad_fq_nmod_embed, phi_sm) - 8usize];
    ["Offset of field: bad_fq_nmod_embed::h"]
        [::std::mem::offset_of!(bad_fq_nmod_embed, h) - 32usize];
    ["Offset of field: bad_fq_nmod_embed::h_as_n_fq_poly"]
        [::std::mem::offset_of!(bad_fq_nmod_embed, h_as_n_fq_poly) - 56usize];
    ["Offset of field: bad_fq_nmod_embed::lgctx"]
        [::std::mem::offset_of!(bad_fq_nmod_embed, lgctx) - 80usize];
    ["Offset of field: bad_fq_nmod_embed::theta_lg"]
        [::std::mem::offset_of!(bad_fq_nmod_embed, theta_lg) - 88usize];
    ["Offset of field: bad_fq_nmod_embed::x_lg"]
        [::std::mem::offset_of!(bad_fq_nmod_embed, x_lg) - 136usize];
    ["Offset of field: bad_fq_nmod_embed::lg_to_sm_mat"]
        [::std::mem::offset_of!(bad_fq_nmod_embed, lg_to_sm_mat) - 184usize];
    ["Offset of field: bad_fq_nmod_embed::sm_to_lg_mat"]
        [::std::mem::offset_of!(bad_fq_nmod_embed, sm_to_lg_mat) - 240usize];
};
impl Default for bad_fq_nmod_embed {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type bad_fq_nmod_embed_struct = bad_fq_nmod_embed;
pub type bad_fq_nmod_embed_t = [bad_fq_nmod_embed_struct; 1usize];
#[repr(C)]
pub struct bad_fq_nmod_mpoly_embed_chooser {
    pub embed: *mut bad_fq_nmod_embed_struct,
    pub m: mp_limb_signed_t,
    pub n: mp_limb_signed_t,
    pub k: mp_limb_signed_t,
    pub p: mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bad_fq_nmod_mpoly_embed_chooser"]
        [::std::mem::size_of::<bad_fq_nmod_mpoly_embed_chooser>() - 40usize];
    ["Alignment of bad_fq_nmod_mpoly_embed_chooser"]
        [::std::mem::align_of::<bad_fq_nmod_mpoly_embed_chooser>() - 8usize];
    ["Offset of field: bad_fq_nmod_mpoly_embed_chooser::embed"]
        [::std::mem::offset_of!(bad_fq_nmod_mpoly_embed_chooser, embed) - 0usize];
    ["Offset of field: bad_fq_nmod_mpoly_embed_chooser::m"]
        [::std::mem::offset_of!(bad_fq_nmod_mpoly_embed_chooser, m) - 8usize];
    ["Offset of field: bad_fq_nmod_mpoly_embed_chooser::n"]
        [::std::mem::offset_of!(bad_fq_nmod_mpoly_embed_chooser, n) - 16usize];
    ["Offset of field: bad_fq_nmod_mpoly_embed_chooser::k"]
        [::std::mem::offset_of!(bad_fq_nmod_mpoly_embed_chooser, k) - 24usize];
    ["Offset of field: bad_fq_nmod_mpoly_embed_chooser::p"]
        [::std::mem::offset_of!(bad_fq_nmod_mpoly_embed_chooser, p) - 32usize];
};
impl Default for bad_fq_nmod_mpoly_embed_chooser {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type bad_fq_nmod_mpoly_embed_chooser_struct = bad_fq_nmod_mpoly_embed_chooser;
pub type bad_fq_nmod_mpoly_embed_chooser_t = [bad_fq_nmod_mpoly_embed_chooser_struct; 1usize];
#[repr(C)]
pub struct fq_nmod_mpoly_geobucket {
    pub polys: [fq_nmod_mpoly_struct; 32usize],
    pub temps: [fq_nmod_mpoly_struct; 32usize],
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_nmod_mpoly_geobucket"]
        [::std::mem::size_of::<fq_nmod_mpoly_geobucket>() - 3080usize];
    ["Alignment of fq_nmod_mpoly_geobucket"]
        [::std::mem::align_of::<fq_nmod_mpoly_geobucket>() - 8usize];
    ["Offset of field: fq_nmod_mpoly_geobucket::polys"]
        [::std::mem::offset_of!(fq_nmod_mpoly_geobucket, polys) - 0usize];
    ["Offset of field: fq_nmod_mpoly_geobucket::temps"]
        [::std::mem::offset_of!(fq_nmod_mpoly_geobucket, temps) - 1536usize];
    ["Offset of field: fq_nmod_mpoly_geobucket::length"]
        [::std::mem::offset_of!(fq_nmod_mpoly_geobucket, length) - 3072usize];
};
impl Default for fq_nmod_mpoly_geobucket {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_nmod_mpoly_geobucket_struct = fq_nmod_mpoly_geobucket;
pub type fq_nmod_mpoly_geobucket_t = [fq_nmod_mpoly_geobucket_struct; 1usize];
extern "C" {
    pub fn bad_fq_nmod_embed_clear(emb: *mut bad_fq_nmod_embed_struct);
    pub fn bad_fq_nmod_embed_array_init(
        emb: *mut bad_fq_nmod_embed_struct,
        bigctx: *const fq_nmod_ctx_struct,
        smallctx: *const fq_nmod_ctx_struct,
    );
    pub fn bad_fq_nmod_embed_sm_to_lg(
        out: *mut nmod_poly_struct,
        in_: *const fq_nmod_poly_struct,
        emb: *const bad_fq_nmod_embed_struct,
    );
