/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::flint::*;
use crate::fmpz_types::*;
use crate::fq_nmod_types::*;
use crate::fq_zech_types::*;
use crate::mpoly_types::*;
use crate::nmod_types::*;


#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fq_zech_mpoly_ctx_struct {
    pub minfo: mpoly_ctx_t,
    pub fqctx: fq_zech_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_mpoly_ctx_struct"]
        [::std::mem::size_of::<fq_zech_mpoly_ctx_struct>() - 696usize];
    ["Alignment of fq_zech_mpoly_ctx_struct"]
        [::std::mem::align_of::<fq_zech_mpoly_ctx_struct>() - 8usize];
    ["Offset of field: fq_zech_mpoly_ctx_struct::minfo"]
        [::std::mem::offset_of!(fq_zech_mpoly_ctx_struct, minfo) - 0usize];
    ["Offset of field: fq_zech_mpoly_ctx_struct::fqctx"]
        [::std::mem::offset_of!(fq_zech_mpoly_ctx_struct, fqctx) - 608usize];
};
impl Default for fq_zech_mpoly_ctx_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_mpoly_ctx_t = [fq_zech_mpoly_ctx_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fq_zech_mpoly_struct {
    pub coeffs: *mut fq_zech_struct,
    pub exps: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
    pub bits: mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_mpoly_struct"][::std::mem::size_of::<fq_zech_mpoly_struct>() - 40usize];
    ["Alignment of fq_zech_mpoly_struct"][::std::mem::align_of::<fq_zech_mpoly_struct>() - 8usize];
    ["Offset of field: fq_zech_mpoly_struct::coeffs"]
        [::std::mem::offset_of!(fq_zech_mpoly_struct, coeffs) - 0usize];
    ["Offset of field: fq_zech_mpoly_struct::exps"]
        [::std::mem::offset_of!(fq_zech_mpoly_struct, exps) - 8usize];
    ["Offset of field: fq_zech_mpoly_struct::alloc"]
        [::std::mem::offset_of!(fq_zech_mpoly_struct, alloc) - 16usize];
    ["Offset of field: fq_zech_mpoly_struct::length"]
        [::std::mem::offset_of!(fq_zech_mpoly_struct, length) - 24usize];
    ["Offset of field: fq_zech_mpoly_struct::bits"]
        [::std::mem::offset_of!(fq_zech_mpoly_struct, bits) - 32usize];
};
impl Default for fq_zech_mpoly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_mpoly_t = [fq_zech_mpoly_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fq_zech_mpoly_univar_struct {
    pub coeffs: *mut fq_zech_mpoly_struct,
    pub exps: *mut fmpz,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_mpoly_univar_struct"]
        [::std::mem::size_of::<fq_zech_mpoly_univar_struct>() - 32usize];
    ["Alignment of fq_zech_mpoly_univar_struct"]
        [::std::mem::align_of::<fq_zech_mpoly_univar_struct>() - 8usize];
    ["Offset of field: fq_zech_mpoly_univar_struct::coeffs"]
        [::std::mem::offset_of!(fq_zech_mpoly_univar_struct, coeffs) - 0usize];
    ["Offset of field: fq_zech_mpoly_univar_struct::exps"]
        [::std::mem::offset_of!(fq_zech_mpoly_univar_struct, exps) - 8usize];
    ["Offset of field: fq_zech_mpoly_univar_struct::alloc"]
        [::std::mem::offset_of!(fq_zech_mpoly_univar_struct, alloc) - 16usize];
    ["Offset of field: fq_zech_mpoly_univar_struct::length"]
        [::std::mem::offset_of!(fq_zech_mpoly_univar_struct, length) - 24usize];
};
impl Default for fq_zech_mpoly_univar_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_mpoly_univar_t = [fq_zech_mpoly_univar_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fq_zech_mpolyu_struct {
    pub coeffs: *mut fq_zech_mpoly_struct,
    pub exps: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
    pub bits: mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_mpolyu_struct"][::std::mem::size_of::<fq_zech_mpolyu_struct>() - 40usize];
    ["Alignment of fq_zech_mpolyu_struct"]
        [::std::mem::align_of::<fq_zech_mpolyu_struct>() - 8usize];
    ["Offset of field: fq_zech_mpolyu_struct::coeffs"]
        [::std::mem::offset_of!(fq_zech_mpolyu_struct, coeffs) - 0usize];
    ["Offset of field: fq_zech_mpolyu_struct::exps"]
        [::std::mem::offset_of!(fq_zech_mpolyu_struct, exps) - 8usize];
    ["Offset of field: fq_zech_mpolyu_struct::alloc"]
        [::std::mem::offset_of!(fq_zech_mpolyu_struct, alloc) - 16usize];
    ["Offset of field: fq_zech_mpolyu_struct::length"]
        [::std::mem::offset_of!(fq_zech_mpolyu_struct, length) - 24usize];
    ["Offset of field: fq_zech_mpolyu_struct::bits"]
        [::std::mem::offset_of!(fq_zech_mpolyu_struct, bits) - 32usize];
};
impl Default for fq_zech_mpolyu_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_mpolyu_t = [fq_zech_mpolyu_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fq_zech_mpolyn_struct {
    pub coeffs: *mut fq_zech_poly_struct,
    pub exps: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
    pub bits: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_mpolyn_struct"][::std::mem::size_of::<fq_zech_mpolyn_struct>() - 40usize];
    ["Alignment of fq_zech_mpolyn_struct"]
        [::std::mem::align_of::<fq_zech_mpolyn_struct>() - 8usize];
    ["Offset of field: fq_zech_mpolyn_struct::coeffs"]
        [::std::mem::offset_of!(fq_zech_mpolyn_struct, coeffs) - 0usize];
    ["Offset of field: fq_zech_mpolyn_struct::exps"]
        [::std::mem::offset_of!(fq_zech_mpolyn_struct, exps) - 8usize];
    ["Offset of field: fq_zech_mpolyn_struct::alloc"]
        [::std::mem::offset_of!(fq_zech_mpolyn_struct, alloc) - 16usize];
    ["Offset of field: fq_zech_mpolyn_struct::length"]
        [::std::mem::offset_of!(fq_zech_mpolyn_struct, length) - 24usize];
    ["Offset of field: fq_zech_mpolyn_struct::bits"]
        [::std::mem::offset_of!(fq_zech_mpolyn_struct, bits) - 32usize];
};
impl Default for fq_zech_mpolyn_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_mpolyn_t = [fq_zech_mpolyn_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fq_zech_mpolyun_struct {
    pub coeffs: *mut fq_zech_mpolyn_struct,
    pub exps: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
    pub bits: mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_mpolyun_struct"][::std::mem::size_of::<fq_zech_mpolyun_struct>() - 40usize];
    ["Alignment of fq_zech_mpolyun_struct"]
        [::std::mem::align_of::<fq_zech_mpolyun_struct>() - 8usize];
    ["Offset of field: fq_zech_mpolyun_struct::coeffs"]
        [::std::mem::offset_of!(fq_zech_mpolyun_struct, coeffs) - 0usize];
    ["Offset of field: fq_zech_mpolyun_struct::exps"]
        [::std::mem::offset_of!(fq_zech_mpolyun_struct, exps) - 8usize];
    ["Offset of field: fq_zech_mpolyun_struct::alloc"]
        [::std::mem::offset_of!(fq_zech_mpolyun_struct, alloc) - 16usize];
    ["Offset of field: fq_zech_mpolyun_struct::length"]
        [::std::mem::offset_of!(fq_zech_mpolyun_struct, length) - 24usize];
    ["Offset of field: fq_zech_mpolyun_struct::bits"]
        [::std::mem::offset_of!(fq_zech_mpolyun_struct, bits) - 32usize];
};
impl Default for fq_zech_mpolyun_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_mpolyun_t = [fq_zech_mpolyun_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fq_zech_mpoly_geobucket {
    pub polys: [fq_zech_mpoly_struct; 32usize],
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_mpoly_geobucket"]
        [::std::mem::size_of::<fq_zech_mpoly_geobucket>() - 1288usize];
    ["Alignment of fq_zech_mpoly_geobucket"]
        [::std::mem::align_of::<fq_zech_mpoly_geobucket>() - 8usize];
    ["Offset of field: fq_zech_mpoly_geobucket::polys"]
        [::std::mem::offset_of!(fq_zech_mpoly_geobucket, polys) - 0usize];
    ["Offset of field: fq_zech_mpoly_geobucket::length"]
        [::std::mem::offset_of!(fq_zech_mpoly_geobucket, length) - 1280usize];
};
impl Default for fq_zech_mpoly_geobucket {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_mpoly_geobucket_struct = fq_zech_mpoly_geobucket;
pub type fq_zech_mpoly_geobucket_t = [fq_zech_mpoly_geobucket_struct; 1usize];
extern "C" {
    #[link_name = "fq_zech_ctx_mod__extern"]
    pub fn fq_zech_ctx_mod(ctx: *const fq_zech_ctx_struct) -> nmod_t;
    pub fn fq_zech_mpoly_ctx_init_deg(
        ctx: *mut fq_zech_mpoly_ctx_struct,
        nvars: mp_limb_signed_t,
        ord: ordering_t,
        p: mp_limb_t,
        deg: mp_limb_signed_t,
    );
    pub fn fq_zech_mpoly_ctx_clear(ctx: *mut fq_zech_mpoly_ctx_struct);
    #[link_name = "fq_zech_mpoly_ctx_nvars__extern"]
