/* automatically generated by rust-bindgen 0.70.1 */

#![allow(non_camel_case_types)]
use crate::deps::*;
use libc::{c_char, c_int, c_uint, c_void, size_t, FILE};


#[repr(C)]
pub struct fq_zech_bpoly_struct {
    pub coeffs: *mut fq_zech_poly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_bpoly_struct"][::std::mem::size_of::<fq_zech_bpoly_struct>() - 24usize];
    ["Alignment of fq_zech_bpoly_struct"][::std::mem::align_of::<fq_zech_bpoly_struct>() - 8usize];
    ["Offset of field: fq_zech_bpoly_struct::coeffs"]
        [::std::mem::offset_of!(fq_zech_bpoly_struct, coeffs) - 0usize];
    ["Offset of field: fq_zech_bpoly_struct::alloc"]
        [::std::mem::offset_of!(fq_zech_bpoly_struct, alloc) - 8usize];
    ["Offset of field: fq_zech_bpoly_struct::length"]
        [::std::mem::offset_of!(fq_zech_bpoly_struct, length) - 16usize];
};
impl Default for fq_zech_bpoly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_bpoly_t = [fq_zech_bpoly_struct; 1usize];
#[repr(C)]
pub struct fq_zech_tpoly_struct {
    pub coeffs: *mut fq_zech_bpoly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_tpoly_struct"][::std::mem::size_of::<fq_zech_tpoly_struct>() - 24usize];
    ["Alignment of fq_zech_tpoly_struct"][::std::mem::align_of::<fq_zech_tpoly_struct>() - 8usize];
    ["Offset of field: fq_zech_tpoly_struct::coeffs"]
        [::std::mem::offset_of!(fq_zech_tpoly_struct, coeffs) - 0usize];
    ["Offset of field: fq_zech_tpoly_struct::alloc"]
        [::std::mem::offset_of!(fq_zech_tpoly_struct, alloc) - 8usize];
    ["Offset of field: fq_zech_tpoly_struct::length"]
        [::std::mem::offset_of!(fq_zech_tpoly_struct, length) - 16usize];
};
impl Default for fq_zech_tpoly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_tpoly_t = [fq_zech_tpoly_struct; 1usize];
#[repr(C)]
pub struct fq_zech_polyu_struct {
    pub exps: *mut mp_limb_t,
    pub coeffs: *mut fq_zech_struct,
    pub length: mp_limb_signed_t,
    pub alloc: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_polyu_struct"][::std::mem::size_of::<fq_zech_polyu_struct>() - 32usize];
    ["Alignment of fq_zech_polyu_struct"][::std::mem::align_of::<fq_zech_polyu_struct>() - 8usize];
    ["Offset of field: fq_zech_polyu_struct::exps"]
        [::std::mem::offset_of!(fq_zech_polyu_struct, exps) - 0usize];
    ["Offset of field: fq_zech_polyu_struct::coeffs"]
        [::std::mem::offset_of!(fq_zech_polyu_struct, coeffs) - 8usize];
    ["Offset of field: fq_zech_polyu_struct::length"]
        [::std::mem::offset_of!(fq_zech_polyu_struct, length) - 16usize];
    ["Offset of field: fq_zech_polyu_struct::alloc"]
        [::std::mem::offset_of!(fq_zech_polyu_struct, alloc) - 24usize];
};
impl Default for fq_zech_polyu_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_polyu_t = [fq_zech_polyu_struct; 1usize];
#[repr(C)]
pub struct fq_zech_polyun_struct {
    pub coeffs: *mut fq_zech_poly_struct,
    pub exps: *mut mp_limb_t,
    pub length: mp_limb_signed_t,
    pub alloc: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_polyun_struct"][::std::mem::size_of::<fq_zech_polyun_struct>() - 32usize];
    ["Alignment of fq_zech_polyun_struct"]
        [::std::mem::align_of::<fq_zech_polyun_struct>() - 8usize];
    ["Offset of field: fq_zech_polyun_struct::coeffs"]
        [::std::mem::offset_of!(fq_zech_polyun_struct, coeffs) - 0usize];
    ["Offset of field: fq_zech_polyun_struct::exps"]
        [::std::mem::offset_of!(fq_zech_polyun_struct, exps) - 8usize];
    ["Offset of field: fq_zech_polyun_struct::length"]
        [::std::mem::offset_of!(fq_zech_polyun_struct, length) - 16usize];
    ["Offset of field: fq_zech_polyun_struct::alloc"]
        [::std::mem::offset_of!(fq_zech_polyun_struct, alloc) - 24usize];
};
impl Default for fq_zech_polyun_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_polyun_t = [fq_zech_polyun_struct; 1usize];
#[repr(C)]
pub struct fq_zech_mpoly_factor_struct {
    pub constant: fq_zech_t,
    pub poly: *mut fq_zech_mpoly_struct,
    pub exp: *mut fmpz,
    pub num: mp_limb_signed_t,
    pub alloc: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_mpoly_factor_struct"]
        [::std::mem::size_of::<fq_zech_mpoly_factor_struct>() - 40usize];
    ["Alignment of fq_zech_mpoly_factor_struct"]
        [::std::mem::align_of::<fq_zech_mpoly_factor_struct>() - 8usize];
    ["Offset of field: fq_zech_mpoly_factor_struct::constant"]
        [::std::mem::offset_of!(fq_zech_mpoly_factor_struct, constant) - 0usize];
    ["Offset of field: fq_zech_mpoly_factor_struct::poly"]
        [::std::mem::offset_of!(fq_zech_mpoly_factor_struct, poly) - 8usize];
    ["Offset of field: fq_zech_mpoly_factor_struct::exp"]
        [::std::mem::offset_of!(fq_zech_mpoly_factor_struct, exp) - 16usize];
    ["Offset of field: fq_zech_mpoly_factor_struct::num"]
        [::std::mem::offset_of!(fq_zech_mpoly_factor_struct, num) - 24usize];
    ["Offset of field: fq_zech_mpoly_factor_struct::alloc"]
        [::std::mem::offset_of!(fq_zech_mpoly_factor_struct, alloc) - 32usize];
};
impl Default for fq_zech_mpoly_factor_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_mpoly_factor_t = [fq_zech_mpoly_factor_struct; 1usize];
#[repr(C)]
pub struct fq_zech_mpolyv_struct {
    pub coeffs: *mut fq_zech_mpoly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_mpolyv_struct"][::std::mem::size_of::<fq_zech_mpolyv_struct>() - 24usize];
    ["Alignment of fq_zech_mpolyv_struct"]
        [::std::mem::align_of::<fq_zech_mpolyv_struct>() - 8usize];
    ["Offset of field: fq_zech_mpolyv_struct::coeffs"]
        [::std::mem::offset_of!(fq_zech_mpolyv_struct, coeffs) - 0usize];
    ["Offset of field: fq_zech_mpolyv_struct::alloc"]
        [::std::mem::offset_of!(fq_zech_mpolyv_struct, alloc) - 8usize];
    ["Offset of field: fq_zech_mpolyv_struct::length"]
        [::std::mem::offset_of!(fq_zech_mpolyv_struct, length) - 16usize];
};
impl Default for fq_zech_mpolyv_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_mpolyv_t = [fq_zech_mpolyv_struct; 1usize];
#[repr(C)]
pub struct fq_zech_mpoly_pfrac_struct {
    pub bits: mp_limb_t,
    pub w: mp_limb_signed_t,
    pub r: mp_limb_signed_t,
    pub inv_prod_dbetas: *mut fq_zech_poly_struct,
    pub inv_prod_dbetas_mvar: *mut fq_zech_mpoly_struct,
    pub dbetas: *mut fq_zech_poly_struct,
    pub dbetas_mvar: *mut fq_zech_mpoly_struct,
    pub prod_mbetas: *mut fq_zech_mpoly_struct,
    pub prod_mbetas_coeffs: *mut fq_zech_mpolyv_struct,
    pub mbetas: *mut fq_zech_mpoly_struct,
    pub deltas: *mut fq_zech_mpoly_struct,
    pub xalpha: *mut fq_zech_mpoly_struct,
    pub q: *mut fq_zech_mpoly_struct,
    pub qt: *mut fq_zech_mpoly_struct,
    pub newt: *mut fq_zech_mpoly_struct,
    pub delta_coeffs: *mut fq_zech_mpolyv_struct,
    pub T: fq_zech_mpoly_t,
    pub Q: fq_zech_mpoly_t,
    pub R: fq_zech_mpoly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fq_zech_mpoly_pfrac_struct"]
        [::std::mem::size_of::<fq_zech_mpoly_pfrac_struct>() - 248usize];
    ["Alignment of fq_zech_mpoly_pfrac_struct"]
        [::std::mem::align_of::<fq_zech_mpoly_pfrac_struct>() - 8usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::bits"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, bits) - 0usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::w"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, w) - 8usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::r"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, r) - 16usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::inv_prod_dbetas"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, inv_prod_dbetas) - 24usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::inv_prod_dbetas_mvar"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, inv_prod_dbetas_mvar) - 32usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::dbetas"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, dbetas) - 40usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::dbetas_mvar"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, dbetas_mvar) - 48usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::prod_mbetas"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, prod_mbetas) - 56usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::prod_mbetas_coeffs"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, prod_mbetas_coeffs) - 64usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::mbetas"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, mbetas) - 72usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::deltas"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, deltas) - 80usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::xalpha"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, xalpha) - 88usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::q"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, q) - 96usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::qt"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, qt) - 104usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::newt"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, newt) - 112usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::delta_coeffs"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, delta_coeffs) - 120usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::T"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, T) - 128usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::Q"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, Q) - 168usize];
    ["Offset of field: fq_zech_mpoly_pfrac_struct::R"]
        [::std::mem::offset_of!(fq_zech_mpoly_pfrac_struct, R) - 208usize];
};
impl Default for fq_zech_mpoly_pfrac_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fq_zech_mpoly_pfrac_t = [fq_zech_mpoly_pfrac_struct; 1usize];
extern "C" {
    pub fn fq_zech_bpoly_clear(A: *mut fq_zech_bpoly_struct, ctx: *const fq_zech_ctx_struct);
    pub fn fq_zech_bpoly_normalise(A: *mut fq_zech_bpoly_struct, ctx: *const fq_zech_ctx_struct);
    pub fn fq_zech_bpoly_realloc(
        A: *mut fq_zech_bpoly_struct,
        len: mp_limb_signed_t,
        ctx: *const fq_zech_ctx_struct,
    );
    pub fn fq_zech_bpoly_equal(
        A: *const fq_zech_bpoly_struct,
        B: *const fq_zech_bpoly_struct,
        ctx: *const fq_zech_ctx_struct,
    ) -> ::std::os::raw::c_int;
