/* automatically generated by rust-bindgen 0.70.1 */

use crate::deps::*;
use crate::dirichlet::*;
use crate::flint::*;
use crate::gr_types::*;


#[repr(C)]
pub struct series_mod_ctx_t {
    pub base_ring: *mut gr_ctx_struct,
    pub n: slong,
    pub var: *mut libc::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of series_mod_ctx_t"][::std::mem::size_of::<series_mod_ctx_t>() - 24usize];
    ["Alignment of series_mod_ctx_t"][::std::mem::align_of::<series_mod_ctx_t>() - 8usize];
    ["Offset of field: series_mod_ctx_t::base_ring"]
        [::std::mem::offset_of!(series_mod_ctx_t, base_ring) - 0usize];
    ["Offset of field: series_mod_ctx_t::n"][::std::mem::offset_of!(series_mod_ctx_t, n) - 8usize];
    ["Offset of field: series_mod_ctx_t::var"]
        [::std::mem::offset_of!(series_mod_ctx_t, var) - 16usize];
};
impl Default for series_mod_ctx_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct series_ctx_t {
    pub base_ring: *mut gr_ctx_struct,
    pub prec: slong,
    pub var: *mut libc::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of series_ctx_t"][::std::mem::size_of::<series_ctx_t>() - 24usize];
    ["Alignment of series_ctx_t"][::std::mem::align_of::<series_ctx_t>() - 8usize];
    ["Offset of field: series_ctx_t::base_ring"]
        [::std::mem::offset_of!(series_ctx_t, base_ring) - 0usize];
    ["Offset of field: series_ctx_t::prec"][::std::mem::offset_of!(series_ctx_t, prec) - 8usize];
    ["Offset of field: series_ctx_t::var"][::std::mem::offset_of!(series_ctx_t, var) - 16usize];
};
impl Default for series_ctx_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct gr_series_struct {
    pub poly: gr_poly_struct,
    pub error: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gr_series_struct"][::std::mem::size_of::<gr_series_struct>() - 32usize];
    ["Alignment of gr_series_struct"][::std::mem::align_of::<gr_series_struct>() - 8usize];
    ["Offset of field: gr_series_struct::poly"]
        [::std::mem::offset_of!(gr_series_struct, poly) - 0usize];
    ["Offset of field: gr_series_struct::error"]
        [::std::mem::offset_of!(gr_series_struct, error) - 24usize];
};
impl Default for gr_series_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type gr_series_t = [gr_series_struct; 1usize];
#[repr(C)]
pub struct gr_series_vec_struct {
    pub entries: *mut gr_series_struct,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gr_series_vec_struct"][::std::mem::size_of::<gr_series_vec_struct>() - 24usize];
    ["Alignment of gr_series_vec_struct"][::std::mem::align_of::<gr_series_vec_struct>() - 8usize];
    ["Offset of field: gr_series_vec_struct::entries"]
        [::std::mem::offset_of!(gr_series_vec_struct, entries) - 0usize];
    ["Offset of field: gr_series_vec_struct::alloc"]
        [::std::mem::offset_of!(gr_series_vec_struct, alloc) - 8usize];
    ["Offset of field: gr_series_vec_struct::length"]
        [::std::mem::offset_of!(gr_series_vec_struct, length) - 16usize];
};
impl Default for gr_series_vec_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type gr_series_vec_t = [gr_series_vec_struct; 1usize];
extern "C" {
    pub fn gr_series_ctx_init(ctx: *mut gr_ctx_struct, base_ring: *mut gr_ctx_struct, prec: slong);
    pub fn gr_series_ctx_clear(ctx: *mut gr_ctx_struct);
    pub fn gr_series_ctx_write(out: *mut gr_stream_struct, ctx: *mut gr_ctx_struct) -> libc::c_int;
    pub fn gr_series_ctx_is_ring(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_ctx_is_commutative_ring(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_ctx_is_integral_domain(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_ctx_is_rational_vector_space(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_ctx_is_real_vector_space(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_ctx_is_complex_vector_space(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_ctx_set_gen_name(
        ctx: *mut gr_ctx_struct,
        s: *const libc::c_char,
    ) -> libc::c_int;
    pub fn gr_series_ctx_set_gen_names(
        ctx: *mut gr_ctx_struct,
        s: *mut *const libc::c_char,
    ) -> libc::c_int;
    pub fn gr_series_init(res: *mut gr_series_struct, ctx: *mut gr_ctx_struct);
    pub fn gr_series_clear(res: *mut gr_series_struct, ctx: *mut gr_ctx_struct);
    pub fn gr_series_swap(
        x: *mut gr_series_struct,
        y: *mut gr_series_struct,
        ctx: *mut gr_ctx_struct,
    );
    pub fn gr_series_set_shallow(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    );
    pub fn _gr_series_get_error(x: *const gr_series_struct, ctx: *mut gr_ctx_struct) -> slong;
    pub fn _gr_series_is_exact(x: *const gr_series_struct, ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn _gr_series_set_error(x: *mut gr_series_struct, err: slong, ctx: *mut gr_ctx_struct);
    pub fn _gr_series_make_exact(x: *mut gr_series_struct, ctx: *mut gr_ctx_struct);
    pub fn gr_series_randtest(
        res: *mut gr_series_struct,
        state: *mut flint_rand_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_write(
        out: *mut gr_stream_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_zero(res: *mut gr_series_struct, ctx: *mut gr_ctx_struct) -> libc::c_int;
    pub fn gr_series_one(res: *mut gr_series_struct, ctx: *mut gr_ctx_struct) -> libc::c_int;
    pub fn gr_series_set(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_gen(res: *mut gr_series_struct, ctx: *mut gr_ctx_struct) -> libc::c_int;
    pub fn gr_series_gens_recursive(
        vec: *mut gr_vec_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_neg(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_set_gr_poly(
        res: *mut gr_series_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_set_scalar(
        res: *mut gr_series_struct,
        x: gr_srcptr,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_set_si(
        res: *mut gr_series_struct,
        c: slong,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_set_ui(
        res: *mut gr_series_struct,
        c: ulong,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_set_fmpz(
        res: *mut gr_series_struct,
        c: *const fmpz,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_set_fmpq(
        res: *mut gr_series_struct,
        c: *const fmpq,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_set_other(
        res: *mut gr_series_struct,
        x: gr_srcptr,
        x_ctx: *mut gr_ctx_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_is_zero(x: *const gr_series_struct, ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_is_one(x: *const gr_series_struct, ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_coeff_is_zero(
        x: *const gr_series_struct,
        i: slong,
        ctx: *mut gr_ctx_struct,
    ) -> truth_t;
    pub fn gr_series_equal(
        x: *const gr_series_struct,
        y: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> truth_t;
    pub fn gr_series_add(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        y: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_sub(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        y: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mul(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        y: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_inv(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_div(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        y: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_divexact(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        y: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_sqrt(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_rsqrt(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_exp(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_log(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_tan(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_asin(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_acos(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_atan(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_asinh(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_acosh(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_atanh(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_gamma(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_rgamma(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_lgamma(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_digamma(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_erf(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_erfc(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_erfi(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_exp_integral_ei(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_cos_integral(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_cosh_integral(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_sin_integral(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_sinh_integral(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_fresnel(
        res1: *mut gr_series_struct,
        res2: *mut gr_series_struct,
        x: *const gr_series_struct,
        normalized: libc::c_int,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_fresnel_s(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        normalized: libc::c_int,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_fresnel_c(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        normalized: libc::c_int,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_airy(
        res1: *mut gr_series_struct,
        res2: *mut gr_series_struct,
        res3: *mut gr_series_struct,
        res4: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_airy_ai(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_airy_ai_prime(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_airy_bi(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_airy_bi_prime(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_log_integral(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        offset: libc::c_int,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_gamma_upper(
        res: *mut gr_series_struct,
        s: *const gr_series_struct,
        x: *const gr_series_struct,
        regularized: libc::c_int,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_gamma_lower(
        res: *mut gr_series_struct,
        s: *const gr_series_struct,
        x: *const gr_series_struct,
        regularized: libc::c_int,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_beta_lower(
        res: *mut gr_series_struct,
        a: *const gr_series_struct,
        b: *const gr_series_struct,
        x: *const gr_series_struct,
        regularized: libc::c_int,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_polylog(
        res: *mut gr_series_struct,
        s: *const gr_series_struct,
        z: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_hurwitz_zeta(
        res: *mut gr_series_struct,
        s: *const gr_series_struct,
        z: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_dirichlet_l(
        res: *mut gr_series_struct,
        G: *const dirichlet_group_struct,
        chi: *const dirichlet_char_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_dirichlet_hardy_theta(
        res: *mut gr_series_struct,
        G: *const dirichlet_group_struct,
        chi: *const dirichlet_char_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_dirichlet_hardy_z(
        res: *mut gr_series_struct,
        G: *const dirichlet_group_struct,
        chi: *const dirichlet_char_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_jacobi_theta(
        res1: *mut gr_series_struct,
        res2: *mut gr_series_struct,
        res3: *mut gr_series_struct,
        res4: *mut gr_series_struct,
        x: *const gr_series_struct,
        tau: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_jacobi_theta_1(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        tau: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_jacobi_theta_2(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        tau: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_jacobi_theta_3(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        tau: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_jacobi_theta_4(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        tau: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_agm1(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_elliptic_k(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_weierstrass_p(
        res: *mut gr_series_struct,
        x: *const gr_series_struct,
        tau: *const gr_series_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_hypgeom_pfq(
        res: *mut gr_series_struct,
        a: *const gr_series_vec_struct,
        b: *const gr_series_vec_struct,
        x: *const gr_series_struct,
        regularized: libc::c_int,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_ctx_init(ctx: *mut gr_ctx_struct, base_ring: *mut gr_ctx_struct, n: slong);
    pub fn gr_series_mod_ctx_clear(ctx: *mut gr_ctx_struct);
    pub fn gr_series_mod_ctx_write(
        out: *mut gr_stream_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_ctx_is_ring(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_mod_ctx_is_commutative_ring(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_mod_ctx_is_integral_domain(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_mod_ctx_is_rational_vector_space(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_mod_ctx_is_real_vector_space(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_mod_ctx_is_complex_vector_space(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_mod_ctx_is_field(ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_mod_ctx_set_gen_name(
        ctx: *mut gr_ctx_struct,
        s: *const libc::c_char,
    ) -> libc::c_int;
    pub fn gr_series_mod_ctx_set_gen_names(
        ctx: *mut gr_ctx_struct,
        s: *mut *const libc::c_char,
    ) -> libc::c_int;
    pub fn gr_series_mod_gens_recursive(
        vec: *mut gr_vec_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_init(res: *mut gr_poly_struct, ctx: *mut gr_ctx_struct);
    pub fn gr_series_mod_clear(res: *mut gr_poly_struct, ctx: *mut gr_ctx_struct);
    pub fn gr_series_mod_swap(
        x: *mut gr_poly_struct,
        y: *mut gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    );
    pub fn gr_series_mod_randtest(
        res: *mut gr_poly_struct,
        state: *mut flint_rand_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_write(
        out: *mut gr_stream_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_zero(res: *mut gr_poly_struct, ctx: *mut gr_ctx_struct) -> libc::c_int;
    pub fn gr_series_mod_one(res: *mut gr_poly_struct, ctx: *mut gr_ctx_struct) -> libc::c_int;
    pub fn gr_series_mod_gen(res: *mut gr_poly_struct, ctx: *mut gr_ctx_struct) -> libc::c_int;
    pub fn gr_series_mod_set(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_set_other(
        res: *mut gr_poly_struct,
        x: gr_srcptr,
        x_ctx: *mut gr_ctx_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_set_shallow(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    );
    pub fn gr_series_mod_set_si(
        res: *mut gr_poly_struct,
        c: slong,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_set_ui(
        res: *mut gr_poly_struct,
        c: ulong,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_set_fmpz(
        res: *mut gr_poly_struct,
        c: *const fmpz,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_set_fmpq(
        res: *mut gr_poly_struct,
        c: *const fmpq,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_is_zero(x: *const gr_poly_struct, ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_mod_is_one(x: *const gr_poly_struct, ctx: *mut gr_ctx_struct) -> truth_t;
    pub fn gr_series_mod_equal(
        x: *const gr_poly_struct,
        y: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> truth_t;
    pub fn gr_series_mod_neg(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_add(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        y: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_sub(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        y: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_mul(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        y: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_inv(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_div(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        y: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_exp(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_log(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_sqrt(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_rsqrt(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_tan(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_asin(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_acos(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_atan(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_asinh(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_acosh(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
    pub fn gr_series_mod_atanh(
        res: *mut gr_poly_struct,
        x: *const gr_poly_struct,
        ctx: *mut gr_ctx_struct,
    ) -> libc::c_int;
}
