/* automatically generated by rust-bindgen 0.70.1 */

use crate::deps::*;
use crate::flint::*;


#[repr(C)]
pub struct mpfr_mat_struct {
    pub entries: *mut __mpfr_struct,
    pub r: mp_limb_signed_t,
    pub c: mp_limb_signed_t,
    pub prec: mp_limb_t,
    pub rows: *mut *mut __mpfr_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpfr_mat_struct"][::std::mem::size_of::<mpfr_mat_struct>() - 40usize];
    ["Alignment of mpfr_mat_struct"][::std::mem::align_of::<mpfr_mat_struct>() - 8usize];
    ["Offset of field: mpfr_mat_struct::entries"]
        [::std::mem::offset_of!(mpfr_mat_struct, entries) - 0usize];
    ["Offset of field: mpfr_mat_struct::r"][::std::mem::offset_of!(mpfr_mat_struct, r) - 8usize];
    ["Offset of field: mpfr_mat_struct::c"][::std::mem::offset_of!(mpfr_mat_struct, c) - 16usize];
    ["Offset of field: mpfr_mat_struct::prec"]
        [::std::mem::offset_of!(mpfr_mat_struct, prec) - 24usize];
    ["Offset of field: mpfr_mat_struct::rows"]
        [::std::mem::offset_of!(mpfr_mat_struct, rows) - 32usize];
};
impl Default for mpfr_mat_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mpfr_mat_t = [mpfr_mat_struct; 1usize];
extern "C" {
    #[link_name = "mpfr_mat_entry__extern"]
    pub fn mpfr_mat_entry(
        mat: *const mpfr_mat_struct,
        i: mp_limb_signed_t,
        j: mp_limb_signed_t,
    ) -> *mut __mpfr_struct;
    #[link_name = "mpfr_mat_nrows__extern"]
    pub fn mpfr_mat_nrows(mat: *const mpfr_mat_struct) -> mp_limb_signed_t;
    #[link_name = "mpfr_mat_ncols__extern"]
    pub fn mpfr_mat_ncols(mat: *const mpfr_mat_struct) -> mp_limb_signed_t;
    pub fn mpfr_mat_init(
        mat: *mut mpfr_mat_struct,
        rows: mp_limb_signed_t,
        cols: mp_limb_signed_t,
        prec: mpfr_prec_t,
    );
    pub fn mpfr_mat_swap(mat1: *mut mpfr_mat_struct, mat2: *mut mpfr_mat_struct);
    #[link_name = "mpfr_mat_swap_entrywise__extern"]
    pub fn mpfr_mat_swap_entrywise(mat1: *mut mpfr_mat_struct, mat2: *mut mpfr_mat_struct);
    pub fn mpfr_mat_set(mat1: *mut mpfr_mat_struct, mat2: *const mpfr_mat_struct);
    pub fn mpfr_mat_clear(mat: *mut mpfr_mat_struct);
    pub fn mpfr_mat_equal(
        mat1: *const mpfr_mat_struct,
        mat2: *const mpfr_mat_struct,
    ) -> libc::c_int;
    pub fn mpfr_mat_zero(mat: *mut mpfr_mat_struct);
    pub fn mpfr_mat_randtest(mat: *mut mpfr_mat_struct, state: *mut flint_rand_s);
    pub fn mpfr_mat_mul_classical(
        C: *mut mpfr_mat_struct,
        A: *const mpfr_mat_struct,
        B: *const mpfr_mat_struct,
        rnd: mpfr_rnd_t,
    );
}
