/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::bindgen::*;
use crate::acb::*;
use crate::acb_calc::*;
use crate::acb_dft::*;
use crate::acb_dirichlet::*;
use crate::acb_elliptic::*;
use crate::acb_hypgeom::*;
use crate::acb_mat::*;
use crate::acb_modular::*;
use crate::acb_poly::*;
use crate::acb_theta::*;
use crate::acb_types::*;
use crate::acf::*;
use crate::acf_types::*;
use crate::aprcl::*;
use crate::arb::*;
use crate::arb_calc::*;
use crate::arb_fmpz_poly::*;
use crate::arb_fpwrap::*;
use crate::arb_hypgeom::*;
use crate::arb_mat::*;
use crate::arb_poly::*;
use crate::arb_types::*;
use crate::arf::*;
use crate::arf_types::*;
use crate::arith::*;
use crate::bernoulli::*;
use crate::bool_mat::*;
use crate::ca::*;
use crate::ca_ext::*;
use crate::ca_field::*;
use crate::ca_mat::*;
use crate::ca_poly::*;
use crate::ca_vec::*;
use crate::calcium::*;
use crate::d_mat::*;
use crate::d_vec::*;
use crate::dirichlet::*;
use crate::dlog::*;
use crate::double_extras::*;
use crate::double_interval::*;
use crate::fexpr::*;
use crate::fexpr_builtin::*;
use crate::fft::*;
use crate::fft_tuning::*;
use crate::flint_config::*;
use crate::flint::*;
use crate::fmpq::*;
use crate::fmpq_mat::*;
use crate::fmpq_mpoly::*;
use crate::fmpq_mpoly_factor::*;
use crate::fmpq_poly::*;
use crate::fmpq_types::*;
use crate::fmpq_vec::*;
use crate::fmpz::*;
use crate::fmpz_extras::*;
use crate::fmpz_factor::*;
use crate::fmpz_lll::*;

use crate::fmpz_mod_types::*;
use crate::fmpz_mod_vec::*;
use crate::fmpz_mpoly::*;
use crate::fmpz_mpoly_factor::*;
use crate::fmpz_mpoly_q::*;
use crate::fmpz_poly::*;
use crate::fmpz_poly_factor::*;
use crate::fmpz_poly_mat::*;
use crate::fmpz_poly_q::*;
use crate::fmpz_types::*;
use crate::fmpz_vec::*;
use crate::fmpzi::*;
use crate::fq::*;
use crate::fq_default::*;
use crate::fq_default_mat::*;
use crate::fq_default_poly::*;
use crate::fq_default_poly_factor::*;
use crate::fq_embed::*;
use crate::fq_embed_templates::*;
use crate::fq_mat::*;
use crate::fq_mat_templates::*;
use crate::fq_nmod::*;
use crate::fq_nmod_embed::*;
use crate::fq_nmod_mat::*;
use crate::fq_nmod_mpoly::*;
use crate::fq_nmod_mpoly_factor::*;
use crate::fq_nmod_poly::*;
use crate::fq_nmod_poly_factor::*;
use crate::fq_nmod_types::*;
use crate::fq_nmod_vec::*;
use crate::fq_poly::*;
use crate::fq_poly_factor::*;
use crate::fq_poly_factor_templates::*;
use crate::fq_poly_templates::*;
use crate::fq_templates::*;
use crate::fq_types::*;
use crate::fq_vec::*;
use crate::fq_vec_templates::*;
use crate::fq_zech::*;
use crate::fq_zech_embed::*;
use crate::fq_zech_mat::*;
use crate::fq_zech_mpoly::*;
use crate::fq_zech_mpoly_factor::*;
use crate::fq_zech_poly::*;
use crate::fq_zech_poly_factor::*;
use crate::fq_zech_types::*;
use crate::fq_zech_vec::*;
use crate::gmpcompat::*;
use crate::gr::*;
use crate::gr_generic::*;
use crate::gr_mat::*;
use crate::gr_mpoly::*;
use crate::gr_poly::*;
use crate::gr_special::*;
use crate::gr_vec::*;
use crate::hypgeom::*;
use crate::limb_types::*;
use crate::long_extras::*;
use crate::longlong::*;
use crate::mag::*;
use crate::mpf_impl::*;
use crate::mpfr_mat::*;
use crate::mpfr_vec::*;
use crate::mpoly_types::*;
use crate::n_poly::*;
use crate::n_poly_types::*;
use crate::nf::*;
use crate::nf_elem::*;
use crate::nmod::*;
use crate::nmod_mat::*;
use crate::nmod_mpoly::*;
use crate::nmod_mpoly_factor::*;
use crate::nmod_poly::*;
use crate::nmod_poly_factor::*;
use crate::nmod_poly_mat::*;
use crate::nmod_types::*;
use crate::nmod_vec::*;
use crate::padic::*;
use crate::padic_mat::*;
use crate::padic_poly::*;
use crate::padic_types::*;
use crate::partitions::*;
use crate::perm::*;
use crate::qadic::*;
use crate::qfb::*;
use crate::qqbar::*;
use crate::qsieve::*;
use crate::templates::*;
use crate::thread_pool::*;
use crate::thread_support::*;
use crate::ulong_extras::*;


pub const MPOLY_GCD_USE_HENSEL: u32 = 1;
pub const MPOLY_GCD_USE_BROWN: u32 = 2;
pub const MPOLY_GCD_USE_ZIPPEL: u32 = 4;
pub const MPOLY_GCD_USE_ZIPPEL2: u32 = 8;
pub const MPOLY_GCD_USE_PRS: u32 = 16;
pub const MPOLY_GCD_USE_ALL: u32 = 31;
pub const MPOLY_FACTOR_USE_ZAS: u32 = 1;
pub const MPOLY_FACTOR_USE_WANG: u32 = 2;
pub const MPOLY_FACTOR_USE_ZIP: u32 = 4;
pub const MPOLY_FACTOR_USE_ALL: u32 = 7;
#[repr(C)]
pub struct mpoly_heap_t {
    pub i: mp_limb_t,
    pub j: mp_limb_t,
    pub next: *mut mpoly_heap_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_heap_t"][::std::mem::size_of::<mpoly_heap_t>() - 24usize];
    ["Alignment of mpoly_heap_t"][::std::mem::align_of::<mpoly_heap_t>() - 8usize];
    ["Offset of field: mpoly_heap_t::i"][::std::mem::offset_of!(mpoly_heap_t, i) - 0usize];
    ["Offset of field: mpoly_heap_t::j"][::std::mem::offset_of!(mpoly_heap_t, j) - 8usize];
    ["Offset of field: mpoly_heap_t::next"][::std::mem::offset_of!(mpoly_heap_t, next) - 16usize];
};
impl Default for mpoly_heap_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_nheap_t {
    pub i: mp_limb_t,
    pub j: mp_limb_t,
    pub next: *mut mpoly_nheap_t,
    pub p: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_nheap_t"][::std::mem::size_of::<mpoly_nheap_t>() - 32usize];
    ["Alignment of mpoly_nheap_t"][::std::mem::align_of::<mpoly_nheap_t>() - 8usize];
    ["Offset of field: mpoly_nheap_t::i"][::std::mem::offset_of!(mpoly_nheap_t, i) - 0usize];
    ["Offset of field: mpoly_nheap_t::j"][::std::mem::offset_of!(mpoly_nheap_t, j) - 8usize];
    ["Offset of field: mpoly_nheap_t::next"][::std::mem::offset_of!(mpoly_nheap_t, next) - 16usize];
    ["Offset of field: mpoly_nheap_t::p"][::std::mem::offset_of!(mpoly_nheap_t, p) - 24usize];
};
impl Default for mpoly_nheap_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_heap1_s {
    pub exp: mp_limb_t,
    pub next: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_heap1_s"][::std::mem::size_of::<mpoly_heap1_s>() - 16usize];
    ["Alignment of mpoly_heap1_s"][::std::mem::align_of::<mpoly_heap1_s>() - 8usize];
    ["Offset of field: mpoly_heap1_s::exp"][::std::mem::offset_of!(mpoly_heap1_s, exp) - 0usize];
    ["Offset of field: mpoly_heap1_s::next"][::std::mem::offset_of!(mpoly_heap1_s, next) - 8usize];
};
impl Default for mpoly_heap1_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpoly_heap_s {
    pub exp: *mut mp_limb_t,
    pub next: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_heap_s"][::std::mem::size_of::<mpoly_heap_s>() - 16usize];
    ["Alignment of mpoly_heap_s"][::std::mem::align_of::<mpoly_heap_s>() - 8usize];
    ["Offset of field: mpoly_heap_s::exp"][::std::mem::offset_of!(mpoly_heap_s, exp) - 0usize];
    ["Offset of field: mpoly_heap_s::next"][::std::mem::offset_of!(mpoly_heap_s, next) - 8usize];
};
impl Default for mpoly_heap_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_rbnode_ui_struct {
    pub key: mp_limb_t,
    pub up: mp_limb_signed_t,
    pub left: mp_limb_signed_t,
    pub right: mp_limb_signed_t,
    pub color: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_rbnode_ui_struct"][::std::mem::size_of::<mpoly_rbnode_ui_struct>() - 40usize];
    ["Alignment of mpoly_rbnode_ui_struct"]
        [::std::mem::align_of::<mpoly_rbnode_ui_struct>() - 8usize];
    ["Offset of field: mpoly_rbnode_ui_struct::key"]
        [::std::mem::offset_of!(mpoly_rbnode_ui_struct, key) - 0usize];
    ["Offset of field: mpoly_rbnode_ui_struct::up"]
        [::std::mem::offset_of!(mpoly_rbnode_ui_struct, up) - 8usize];
    ["Offset of field: mpoly_rbnode_ui_struct::left"]
        [::std::mem::offset_of!(mpoly_rbnode_ui_struct, left) - 16usize];
    ["Offset of field: mpoly_rbnode_ui_struct::right"]
        [::std::mem::offset_of!(mpoly_rbnode_ui_struct, right) - 24usize];
    ["Offset of field: mpoly_rbnode_ui_struct::color"]
        [::std::mem::offset_of!(mpoly_rbnode_ui_struct, color) - 32usize];
};
impl Default for mpoly_rbnode_ui_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_rbtree_ui_struct {
    pub length: mp_limb_signed_t,
    pub nodes: *mut mpoly_rbnode_ui_struct,
    pub node_alloc: mp_limb_signed_t,
    pub data: *mut libc::c_char,
    pub data_alloc: mp_limb_signed_t,
    pub data_size: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_rbtree_ui_struct"][::std::mem::size_of::<mpoly_rbtree_ui_struct>() - 48usize];
    ["Alignment of mpoly_rbtree_ui_struct"]
        [::std::mem::align_of::<mpoly_rbtree_ui_struct>() - 8usize];
    ["Offset of field: mpoly_rbtree_ui_struct::length"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, length) - 0usize];
    ["Offset of field: mpoly_rbtree_ui_struct::nodes"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, nodes) - 8usize];
    ["Offset of field: mpoly_rbtree_ui_struct::node_alloc"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, node_alloc) - 16usize];
    ["Offset of field: mpoly_rbtree_ui_struct::data"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, data) - 24usize];
    ["Offset of field: mpoly_rbtree_ui_struct::data_alloc"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, data_alloc) - 32usize];
    ["Offset of field: mpoly_rbtree_ui_struct::data_size"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, data_size) - 40usize];
};
impl Default for mpoly_rbtree_ui_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mpoly_rbtree_ui_t = [mpoly_rbtree_ui_struct; 1usize];
#[repr(C)]
pub struct mpoly_rbnode_fmpz_struct {
    pub key: fmpz_t,
    pub up: mp_limb_signed_t,
    pub left: mp_limb_signed_t,
    pub right: mp_limb_signed_t,
    pub color: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_rbnode_fmpz_struct"]
        [::std::mem::size_of::<mpoly_rbnode_fmpz_struct>() - 40usize];
    ["Alignment of mpoly_rbnode_fmpz_struct"]
        [::std::mem::align_of::<mpoly_rbnode_fmpz_struct>() - 8usize];
    ["Offset of field: mpoly_rbnode_fmpz_struct::key"]
        [::std::mem::offset_of!(mpoly_rbnode_fmpz_struct, key) - 0usize];
    ["Offset of field: mpoly_rbnode_fmpz_struct::up"]
        [::std::mem::offset_of!(mpoly_rbnode_fmpz_struct, up) - 8usize];
    ["Offset of field: mpoly_rbnode_fmpz_struct::left"]
        [::std::mem::offset_of!(mpoly_rbnode_fmpz_struct, left) - 16usize];
    ["Offset of field: mpoly_rbnode_fmpz_struct::right"]
        [::std::mem::offset_of!(mpoly_rbnode_fmpz_struct, right) - 24usize];
    ["Offset of field: mpoly_rbnode_fmpz_struct::color"]
        [::std::mem::offset_of!(mpoly_rbnode_fmpz_struct, color) - 32usize];
};
impl Default for mpoly_rbnode_fmpz_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_rbtree_fmpz_struct {
    pub length: mp_limb_signed_t,
    pub nodes: *mut mpoly_rbnode_fmpz_struct,
    pub node_alloc: mp_limb_signed_t,
    pub data: *mut libc::c_char,
    pub data_alloc: mp_limb_signed_t,
    pub data_size: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_rbtree_fmpz_struct"]
        [::std::mem::size_of::<mpoly_rbtree_fmpz_struct>() - 48usize];
    ["Alignment of mpoly_rbtree_fmpz_struct"]
        [::std::mem::align_of::<mpoly_rbtree_fmpz_struct>() - 8usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::length"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, length) - 0usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::nodes"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, nodes) - 8usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::node_alloc"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, node_alloc) - 16usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::data"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, data) - 24usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::data_alloc"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, data_alloc) - 32usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::data_size"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, data_size) - 40usize];
};
impl Default for mpoly_rbtree_fmpz_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mpoly_rbtree_fmpz_t = [mpoly_rbtree_fmpz_struct; 1usize];
#[repr(C)]
pub struct mpoly_univar_struct {
    pub coeffs: *mut libc::c_char,
    pub exps: *mut fmpz,
    pub length: mp_limb_signed_t,
    pub alloc: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_univar_struct"][::std::mem::size_of::<mpoly_univar_struct>() - 32usize];
    ["Alignment of mpoly_univar_struct"][::std::mem::align_of::<mpoly_univar_struct>() - 8usize];
    ["Offset of field: mpoly_univar_struct::coeffs"]
        [::std::mem::offset_of!(mpoly_univar_struct, coeffs) - 0usize];
    ["Offset of field: mpoly_univar_struct::exps"]
        [::std::mem::offset_of!(mpoly_univar_struct, exps) - 8usize];
    ["Offset of field: mpoly_univar_struct::length"]
        [::std::mem::offset_of!(mpoly_univar_struct, length) - 16usize];
    ["Offset of field: mpoly_univar_struct::alloc"]
        [::std::mem::offset_of!(mpoly_univar_struct, alloc) - 24usize];
};
impl Default for mpoly_univar_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mpoly_univar_t = [mpoly_univar_struct; 1usize];
#[repr(C)]
pub struct string_with_length_struct {
    pub str_: *mut libc::c_char,
    pub str_len: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of string_with_length_struct"]
        [::std::mem::size_of::<string_with_length_struct>() - 16usize];
    ["Alignment of string_with_length_struct"]
        [::std::mem::align_of::<string_with_length_struct>() - 8usize];
    ["Offset of field: string_with_length_struct::str_"]
        [::std::mem::offset_of!(string_with_length_struct, str_) - 0usize];
    ["Offset of field: string_with_length_struct::str_len"]
        [::std::mem::offset_of!(string_with_length_struct, str_len) - 8usize];
};
impl Default for string_with_length_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_parse_struct {
    pub R: mpoly_void_ring_t,
    pub stack: *mut mp_limb_signed_t,
    pub stack_len: mp_limb_signed_t,
    pub stack_alloc: mp_limb_signed_t,
    pub estore: *mut libc::c_char,
    pub estore_len: mp_limb_signed_t,
    pub estore_alloc: mp_limb_signed_t,
    pub tmp: *mut libc::c_void,
    pub terminal_strings: *mut string_with_length_struct,
    pub terminal_values: *mut libc::c_char,
    pub terminals_alloc: mp_limb_signed_t,
    pub terminals_len: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_parse_struct"][::std::mem::size_of::<mpoly_parse_struct>() - 240usize];
    ["Alignment of mpoly_parse_struct"][::std::mem::align_of::<mpoly_parse_struct>() - 8usize];
    ["Offset of field: mpoly_parse_struct::R"]
        [::std::mem::offset_of!(mpoly_parse_struct, R) - 0usize];
    ["Offset of field: mpoly_parse_struct::stack"]
        [::std::mem::offset_of!(mpoly_parse_struct, stack) - 152usize];
    ["Offset of field: mpoly_parse_struct::stack_len"]
        [::std::mem::offset_of!(mpoly_parse_struct, stack_len) - 160usize];
    ["Offset of field: mpoly_parse_struct::stack_alloc"]
        [::std::mem::offset_of!(mpoly_parse_struct, stack_alloc) - 168usize];
    ["Offset of field: mpoly_parse_struct::estore"]
        [::std::mem::offset_of!(mpoly_parse_struct, estore) - 176usize];
    ["Offset of field: mpoly_parse_struct::estore_len"]
        [::std::mem::offset_of!(mpoly_parse_struct, estore_len) - 184usize];
    ["Offset of field: mpoly_parse_struct::estore_alloc"]
        [::std::mem::offset_of!(mpoly_parse_struct, estore_alloc) - 192usize];
    ["Offset of field: mpoly_parse_struct::tmp"]
        [::std::mem::offset_of!(mpoly_parse_struct, tmp) - 200usize];
    ["Offset of field: mpoly_parse_struct::terminal_strings"]
        [::std::mem::offset_of!(mpoly_parse_struct, terminal_strings) - 208usize];
    ["Offset of field: mpoly_parse_struct::terminal_values"]
        [::std::mem::offset_of!(mpoly_parse_struct, terminal_values) - 216usize];
    ["Offset of field: mpoly_parse_struct::terminals_alloc"]
        [::std::mem::offset_of!(mpoly_parse_struct, terminals_alloc) - 224usize];
    ["Offset of field: mpoly_parse_struct::terminals_len"]
        [::std::mem::offset_of!(mpoly_parse_struct, terminals_len) - 232usize];
};
impl Default for mpoly_parse_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mpoly_parse_t = [mpoly_parse_struct; 1usize];
extern "C" {
    #[link_name = "mpoly_divide_threads__extern"]
    pub fn mpoly_divide_threads(n: mp_limb_signed_t, la: f64, lb: f64) -> mp_limb_signed_t;
    pub fn mpoly_ctx_init(ctx: *mut mpoly_ctx_struct, nvars: mp_limb_signed_t, ord: ordering_t);
    pub fn mpoly_ctx_init_rand(
        mctx: *mut mpoly_ctx_struct,
        state: *mut flint_rand_s,
        max_nvars: mp_limb_signed_t,
    );
    pub fn mpoly_monomial_randbits_fmpz(
        exp: *mut fmpz,
        state: *mut flint_rand_s,
        exp_bits: mp_limb_t,
