/* automatically generated by rust-bindgen 0.70.1 */

use crate::deps::*;
use crate::flint::*;
use crate::fmpz_types::*;
use crate::mpoly_types::*;


pub const MPOLY_GCD_USE_HENSEL: u32 = 1;
pub const MPOLY_GCD_USE_BROWN: u32 = 2;
pub const MPOLY_GCD_USE_ZIPPEL: u32 = 4;
pub const MPOLY_GCD_USE_ZIPPEL2: u32 = 8;
pub const MPOLY_GCD_USE_PRS: u32 = 16;
pub const MPOLY_GCD_USE_ALL: u32 = 31;
pub const MPOLY_FACTOR_USE_ZAS: u32 = 1;
pub const MPOLY_FACTOR_USE_WANG: u32 = 2;
pub const MPOLY_FACTOR_USE_ZIP: u32 = 4;
pub const MPOLY_FACTOR_USE_ALL: u32 = 7;
#[repr(C)]
pub struct mpoly_heap_t {
    pub i: ulong,
    pub j: ulong,
    pub next: *mut mpoly_heap_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_heap_t"][::std::mem::size_of::<mpoly_heap_t>() - 24usize];
    ["Alignment of mpoly_heap_t"][::std::mem::align_of::<mpoly_heap_t>() - 8usize];
    ["Offset of field: mpoly_heap_t::i"][::std::mem::offset_of!(mpoly_heap_t, i) - 0usize];
    ["Offset of field: mpoly_heap_t::j"][::std::mem::offset_of!(mpoly_heap_t, j) - 8usize];
    ["Offset of field: mpoly_heap_t::next"][::std::mem::offset_of!(mpoly_heap_t, next) - 16usize];
};
impl Default for mpoly_heap_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_nheap_t {
    pub i: ulong,
    pub j: ulong,
    pub next: *mut mpoly_nheap_t,
    pub p: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_nheap_t"][::std::mem::size_of::<mpoly_nheap_t>() - 32usize];
    ["Alignment of mpoly_nheap_t"][::std::mem::align_of::<mpoly_nheap_t>() - 8usize];
    ["Offset of field: mpoly_nheap_t::i"][::std::mem::offset_of!(mpoly_nheap_t, i) - 0usize];
    ["Offset of field: mpoly_nheap_t::j"][::std::mem::offset_of!(mpoly_nheap_t, j) - 8usize];
    ["Offset of field: mpoly_nheap_t::next"][::std::mem::offset_of!(mpoly_nheap_t, next) - 16usize];
    ["Offset of field: mpoly_nheap_t::p"][::std::mem::offset_of!(mpoly_nheap_t, p) - 24usize];
};
impl Default for mpoly_nheap_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_heap1_s {
    pub exp: ulong,
    pub next: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_heap1_s"][::std::mem::size_of::<mpoly_heap1_s>() - 16usize];
    ["Alignment of mpoly_heap1_s"][::std::mem::align_of::<mpoly_heap1_s>() - 8usize];
    ["Offset of field: mpoly_heap1_s::exp"][::std::mem::offset_of!(mpoly_heap1_s, exp) - 0usize];
    ["Offset of field: mpoly_heap1_s::next"][::std::mem::offset_of!(mpoly_heap1_s, next) - 8usize];
};
impl Default for mpoly_heap1_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpoly_heap_s {
    pub exp: *mut ulong,
    pub next: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_heap_s"][::std::mem::size_of::<mpoly_heap_s>() - 16usize];
    ["Alignment of mpoly_heap_s"][::std::mem::align_of::<mpoly_heap_s>() - 8usize];
    ["Offset of field: mpoly_heap_s::exp"][::std::mem::offset_of!(mpoly_heap_s, exp) - 0usize];
    ["Offset of field: mpoly_heap_s::next"][::std::mem::offset_of!(mpoly_heap_s, next) - 8usize];
};
impl Default for mpoly_heap_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_rbnode_ui_struct {
    pub key: ulong,
    pub up: slong,
    pub left: slong,
    pub right: slong,
    pub color: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_rbnode_ui_struct"][::std::mem::size_of::<mpoly_rbnode_ui_struct>() - 40usize];
    ["Alignment of mpoly_rbnode_ui_struct"]
        [::std::mem::align_of::<mpoly_rbnode_ui_struct>() - 8usize];
    ["Offset of field: mpoly_rbnode_ui_struct::key"]
        [::std::mem::offset_of!(mpoly_rbnode_ui_struct, key) - 0usize];
    ["Offset of field: mpoly_rbnode_ui_struct::up"]
        [::std::mem::offset_of!(mpoly_rbnode_ui_struct, up) - 8usize];
    ["Offset of field: mpoly_rbnode_ui_struct::left"]
        [::std::mem::offset_of!(mpoly_rbnode_ui_struct, left) - 16usize];
    ["Offset of field: mpoly_rbnode_ui_struct::right"]
        [::std::mem::offset_of!(mpoly_rbnode_ui_struct, right) - 24usize];
    ["Offset of field: mpoly_rbnode_ui_struct::color"]
        [::std::mem::offset_of!(mpoly_rbnode_ui_struct, color) - 32usize];
};
impl Default for mpoly_rbnode_ui_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_rbtree_ui_struct {
    pub length: slong,
    pub nodes: *mut mpoly_rbnode_ui_struct,
    pub node_alloc: slong,
    pub data: *mut libc::c_char,
    pub data_alloc: slong,
    pub data_size: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_rbtree_ui_struct"][::std::mem::size_of::<mpoly_rbtree_ui_struct>() - 48usize];
    ["Alignment of mpoly_rbtree_ui_struct"]
        [::std::mem::align_of::<mpoly_rbtree_ui_struct>() - 8usize];
    ["Offset of field: mpoly_rbtree_ui_struct::length"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, length) - 0usize];
    ["Offset of field: mpoly_rbtree_ui_struct::nodes"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, nodes) - 8usize];
    ["Offset of field: mpoly_rbtree_ui_struct::node_alloc"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, node_alloc) - 16usize];
    ["Offset of field: mpoly_rbtree_ui_struct::data"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, data) - 24usize];
    ["Offset of field: mpoly_rbtree_ui_struct::data_alloc"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, data_alloc) - 32usize];
    ["Offset of field: mpoly_rbtree_ui_struct::data_size"]
        [::std::mem::offset_of!(mpoly_rbtree_ui_struct, data_size) - 40usize];
};
impl Default for mpoly_rbtree_ui_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mpoly_rbtree_ui_t = [mpoly_rbtree_ui_struct; 1usize];
#[repr(C)]
pub struct mpoly_rbnode_fmpz_struct {
    pub key: fmpz_t,
    pub up: slong,
    pub left: slong,
    pub right: slong,
    pub color: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_rbnode_fmpz_struct"]
        [::std::mem::size_of::<mpoly_rbnode_fmpz_struct>() - 40usize];
    ["Alignment of mpoly_rbnode_fmpz_struct"]
        [::std::mem::align_of::<mpoly_rbnode_fmpz_struct>() - 8usize];
    ["Offset of field: mpoly_rbnode_fmpz_struct::key"]
        [::std::mem::offset_of!(mpoly_rbnode_fmpz_struct, key) - 0usize];
    ["Offset of field: mpoly_rbnode_fmpz_struct::up"]
        [::std::mem::offset_of!(mpoly_rbnode_fmpz_struct, up) - 8usize];
    ["Offset of field: mpoly_rbnode_fmpz_struct::left"]
        [::std::mem::offset_of!(mpoly_rbnode_fmpz_struct, left) - 16usize];
    ["Offset of field: mpoly_rbnode_fmpz_struct::right"]
        [::std::mem::offset_of!(mpoly_rbnode_fmpz_struct, right) - 24usize];
    ["Offset of field: mpoly_rbnode_fmpz_struct::color"]
        [::std::mem::offset_of!(mpoly_rbnode_fmpz_struct, color) - 32usize];
};
impl Default for mpoly_rbnode_fmpz_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_rbtree_fmpz_struct {
    pub length: slong,
    pub nodes: *mut mpoly_rbnode_fmpz_struct,
    pub node_alloc: slong,
    pub data: *mut libc::c_char,
    pub data_alloc: slong,
    pub data_size: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_rbtree_fmpz_struct"]
        [::std::mem::size_of::<mpoly_rbtree_fmpz_struct>() - 48usize];
    ["Alignment of mpoly_rbtree_fmpz_struct"]
        [::std::mem::align_of::<mpoly_rbtree_fmpz_struct>() - 8usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::length"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, length) - 0usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::nodes"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, nodes) - 8usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::node_alloc"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, node_alloc) - 16usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::data"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, data) - 24usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::data_alloc"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, data_alloc) - 32usize];
    ["Offset of field: mpoly_rbtree_fmpz_struct::data_size"]
        [::std::mem::offset_of!(mpoly_rbtree_fmpz_struct, data_size) - 40usize];
};
impl Default for mpoly_rbtree_fmpz_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mpoly_rbtree_fmpz_t = [mpoly_rbtree_fmpz_struct; 1usize];
#[repr(C)]
pub struct mpoly_univar_struct {
    pub coeffs: *mut libc::c_char,
    pub exps: *mut fmpz,
    pub length: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_univar_struct"][::std::mem::size_of::<mpoly_univar_struct>() - 32usize];
    ["Alignment of mpoly_univar_struct"][::std::mem::align_of::<mpoly_univar_struct>() - 8usize];
    ["Offset of field: mpoly_univar_struct::coeffs"]
        [::std::mem::offset_of!(mpoly_univar_struct, coeffs) - 0usize];
    ["Offset of field: mpoly_univar_struct::exps"]
        [::std::mem::offset_of!(mpoly_univar_struct, exps) - 8usize];
    ["Offset of field: mpoly_univar_struct::length"]
        [::std::mem::offset_of!(mpoly_univar_struct, length) - 16usize];
    ["Offset of field: mpoly_univar_struct::alloc"]
        [::std::mem::offset_of!(mpoly_univar_struct, alloc) - 24usize];
};
impl Default for mpoly_univar_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mpoly_univar_t = [mpoly_univar_struct; 1usize];
#[repr(C)]
pub struct string_with_length_struct {
    pub str_: *mut libc::c_char,
    pub str_len: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of string_with_length_struct"]
        [::std::mem::size_of::<string_with_length_struct>() - 16usize];
    ["Alignment of string_with_length_struct"]
        [::std::mem::align_of::<string_with_length_struct>() - 8usize];
    ["Offset of field: string_with_length_struct::str_"]
        [::std::mem::offset_of!(string_with_length_struct, str_) - 0usize];
    ["Offset of field: string_with_length_struct::str_len"]
        [::std::mem::offset_of!(string_with_length_struct, str_len) - 8usize];
};
impl Default for string_with_length_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct mpoly_parse_struct {
    pub R: mpoly_void_ring_t,
    pub stack: *mut slong,
    pub stack_len: slong,
    pub stack_alloc: slong,
    pub estore: *mut libc::c_char,
    pub estore_len: slong,
    pub estore_alloc: slong,
    pub tmp: *mut libc::c_void,
    pub terminal_strings: *mut string_with_length_struct,
    pub terminal_values: *mut libc::c_char,
    pub terminals_alloc: slong,
    pub terminals_len: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpoly_parse_struct"][::std::mem::size_of::<mpoly_parse_struct>() - 240usize];
    ["Alignment of mpoly_parse_struct"][::std::mem::align_of::<mpoly_parse_struct>() - 8usize];
    ["Offset of field: mpoly_parse_struct::R"]
        [::std::mem::offset_of!(mpoly_parse_struct, R) - 0usize];
    ["Offset of field: mpoly_parse_struct::stack"]
        [::std::mem::offset_of!(mpoly_parse_struct, stack) - 152usize];
    ["Offset of field: mpoly_parse_struct::stack_len"]
        [::std::mem::offset_of!(mpoly_parse_struct, stack_len) - 160usize];
    ["Offset of field: mpoly_parse_struct::stack_alloc"]
        [::std::mem::offset_of!(mpoly_parse_struct, stack_alloc) - 168usize];
    ["Offset of field: mpoly_parse_struct::estore"]
        [::std::mem::offset_of!(mpoly_parse_struct, estore) - 176usize];
    ["Offset of field: mpoly_parse_struct::estore_len"]
        [::std::mem::offset_of!(mpoly_parse_struct, estore_len) - 184usize];
    ["Offset of field: mpoly_parse_struct::estore_alloc"]
        [::std::mem::offset_of!(mpoly_parse_struct, estore_alloc) - 192usize];
    ["Offset of field: mpoly_parse_struct::tmp"]
        [::std::mem::offset_of!(mpoly_parse_struct, tmp) - 200usize];
    ["Offset of field: mpoly_parse_struct::terminal_strings"]
        [::std::mem::offset_of!(mpoly_parse_struct, terminal_strings) - 208usize];
    ["Offset of field: mpoly_parse_struct::terminal_values"]
        [::std::mem::offset_of!(mpoly_parse_struct, terminal_values) - 216usize];
    ["Offset of field: mpoly_parse_struct::terminals_alloc"]
        [::std::mem::offset_of!(mpoly_parse_struct, terminals_alloc) - 224usize];
    ["Offset of field: mpoly_parse_struct::terminals_len"]
        [::std::mem::offset_of!(mpoly_parse_struct, terminals_len) - 232usize];
};
impl Default for mpoly_parse_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mpoly_parse_t = [mpoly_parse_struct; 1usize];
extern "C" {
    pub fn mpoly_divide_threads(n: slong, la: f64, lb: f64) -> slong;
    pub fn __gmpn_add_n(
        arg1: mp_ptr,
        arg2: mp_srcptr,
        arg3: mp_srcptr,
        arg4: mp_size_t,
    ) -> mp_limb_t;
    pub fn __gmpn_sub_n(
        arg1: mp_ptr,
        arg2: mp_srcptr,
        arg3: mp_srcptr,
        arg4: mp_size_t,
    ) -> mp_limb_t;
    pub fn __gmpn_addmul_1(
        arg1: mp_ptr,
        arg2: mp_srcptr,
        arg3: mp_size_t,
        arg4: mp_limb_t,
    ) -> mp_limb_t;
    pub fn __gmpn_submul_1(
