/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::bindgen::*;
use crate::acb::*;
use crate::acb_calc::*;
use crate::acb_dft::*;
use crate::acb_dirichlet::*;
use crate::acb_elliptic::*;
use crate::acb_hypgeom::*;
use crate::acb_mat::*;
use crate::acb_modular::*;
use crate::acb_poly::*;
use crate::acb_theta::*;
use crate::acb_types::*;
use crate::acf::*;
use crate::acf_types::*;
use crate::aprcl::*;
use crate::arb::*;
use crate::arb_calc::*;
use crate::arb_fmpz_poly::*;
use crate::arb_fpwrap::*;
use crate::arb_hypgeom::*;
use crate::arb_mat::*;
use crate::arb_poly::*;
use crate::arb_types::*;
use crate::arf::*;
use crate::arf_types::*;
use crate::arith::*;
use crate::bernoulli::*;
use crate::bool_mat::*;
use crate::ca::*;
use crate::ca_ext::*;
use crate::ca_field::*;
use crate::ca_mat::*;
use crate::ca_poly::*;
use crate::ca_vec::*;
use crate::calcium::*;
use crate::d_mat::*;
use crate::d_vec::*;
use crate::dirichlet::*;
use crate::dlog::*;
use crate::double_extras::*;
use crate::double_interval::*;
use crate::fexpr::*;
use crate::fexpr_builtin::*;
use crate::fft::*;
use crate::fft_tuning::*;
use crate::flint_config::*;
use crate::flint::*;
use crate::fmpq::*;
use crate::fmpq_mat::*;
use crate::fmpq_mpoly::*;
use crate::fmpq_mpoly_factor::*;
use crate::fmpq_poly::*;
use crate::fmpq_types::*;
use crate::fmpq_vec::*;
use crate::fmpz::*;
use crate::fmpz_extras::*;
use crate::fmpz_factor::*;
use crate::fmpz_lll::*;
use crate::fmpz_mat::*;
use crate::fmpz_mod::*;
use crate::fmpz_mod_mat::*;
use crate::fmpz_mod_mpoly::*;
use crate::fmpz_mod_mpoly_factor::*;
use crate::fmpz_mod_poly::*;
use crate::fmpz_mod_poly_factor::*;
use crate::fmpz_mod_types::*;
use crate::fmpz_mod_vec::*;
use crate::fmpz_mpoly::*;
use crate::fmpz_mpoly_factor::*;
use crate::fmpz_mpoly_q::*;
use crate::fmpz_poly::*;
use crate::fmpz_poly_factor::*;
use crate::fmpz_poly_mat::*;
use crate::fmpz_poly_q::*;
use crate::fmpz_types::*;
use crate::fmpz_vec::*;
use crate::fmpzi::*;
use crate::fq::*;
use crate::fq_default::*;
use crate::fq_default_mat::*;
use crate::fq_default_poly::*;
use crate::fq_default_poly_factor::*;
use crate::fq_embed::*;
use crate::fq_embed_templates::*;
use crate::fq_mat::*;
use crate::fq_mat_templates::*;
use crate::fq_nmod::*;
use crate::fq_nmod_embed::*;
use crate::fq_nmod_mat::*;
use crate::fq_nmod_mpoly::*;
use crate::fq_nmod_mpoly_factor::*;
use crate::fq_nmod_poly::*;
use crate::fq_nmod_poly_factor::*;
use crate::fq_nmod_types::*;
use crate::fq_nmod_vec::*;
use crate::fq_poly::*;
use crate::fq_poly_factor::*;
use crate::fq_poly_factor_templates::*;
use crate::fq_poly_templates::*;
use crate::fq_templates::*;
use crate::fq_types::*;
use crate::fq_vec::*;
use crate::fq_vec_templates::*;
use crate::fq_zech::*;
use crate::fq_zech_embed::*;
use crate::fq_zech_mat::*;
use crate::fq_zech_mpoly::*;
use crate::fq_zech_mpoly_factor::*;
use crate::fq_zech_poly::*;
use crate::fq_zech_poly_factor::*;
use crate::fq_zech_types::*;
use crate::fq_zech_vec::*;
use crate::gmpcompat::*;
use crate::gr::*;
use crate::gr_generic::*;
use crate::gr_mat::*;
use crate::gr_mpoly::*;
use crate::gr_poly::*;
use crate::gr_special::*;
use crate::gr_vec::*;
use crate::hypgeom::*;
use crate::limb_types::*;
use crate::long_extras::*;
use crate::longlong::*;
use crate::mag::*;
use crate::mpf_impl::*;
use crate::mpfr_mat::*;
use crate::mpfr_vec::*;
use crate::mpoly::*;
use crate::mpoly_types::*;
use crate::n_poly::*;
use crate::nf::*;
use crate::nf_elem::*;
use crate::nmod::*;
use crate::nmod_mat::*;
use crate::nmod_mpoly::*;
use crate::nmod_mpoly_factor::*;
use crate::nmod_poly::*;
use crate::nmod_poly_factor::*;
use crate::nmod_poly_mat::*;
use crate::nmod_types::*;
use crate::nmod_vec::*;
use crate::padic::*;
use crate::padic_mat::*;
use crate::padic_poly::*;
use crate::padic_types::*;
use crate::partitions::*;
use crate::perm::*;
use crate::qadic::*;
use crate::qfb::*;
use crate::qqbar::*;
use crate::qsieve::*;
use crate::templates::*;
use crate::thread_pool::*;
use crate::thread_support::*;
use crate::ulong_extras::*;


#[repr(C)]
pub struct n_poly_struct {
    pub coeffs: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_poly_struct"][::std::mem::size_of::<n_poly_struct>() - 24usize];
    ["Alignment of n_poly_struct"][::std::mem::align_of::<n_poly_struct>() - 8usize];
    ["Offset of field: n_poly_struct::coeffs"]
        [::std::mem::offset_of!(n_poly_struct, coeffs) - 0usize];
    ["Offset of field: n_poly_struct::alloc"]
        [::std::mem::offset_of!(n_poly_struct, alloc) - 8usize];
    ["Offset of field: n_poly_struct::length"]
        [::std::mem::offset_of!(n_poly_struct, length) - 16usize];
};
impl Default for n_poly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type n_poly_t = [n_poly_struct; 1usize];
pub type n_fq_poly_struct = n_poly_struct;
pub type n_fq_poly_t = n_poly_t;
#[repr(C)]
pub struct n_bpoly_struct {
    pub coeffs: *mut n_poly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_bpoly_struct"][::std::mem::size_of::<n_bpoly_struct>() - 24usize];
    ["Alignment of n_bpoly_struct"][::std::mem::align_of::<n_bpoly_struct>() - 8usize];
    ["Offset of field: n_bpoly_struct::coeffs"]
        [::std::mem::offset_of!(n_bpoly_struct, coeffs) - 0usize];
    ["Offset of field: n_bpoly_struct::alloc"]
        [::std::mem::offset_of!(n_bpoly_struct, alloc) - 8usize];
    ["Offset of field: n_bpoly_struct::length"]
        [::std::mem::offset_of!(n_bpoly_struct, length) - 16usize];
};
impl Default for n_bpoly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type n_bpoly_t = [n_bpoly_struct; 1usize];
pub type n_fq_bpoly_struct = n_bpoly_struct;
pub type n_fq_bpoly_t = n_bpoly_t;
#[repr(C)]
pub struct n_tpoly_struct {
    pub coeffs: *mut n_bpoly_struct,
    pub alloc: mp_limb_signed_t,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_tpoly_struct"][::std::mem::size_of::<n_tpoly_struct>() - 24usize];
    ["Alignment of n_tpoly_struct"][::std::mem::align_of::<n_tpoly_struct>() - 8usize];
    ["Offset of field: n_tpoly_struct::coeffs"]
        [::std::mem::offset_of!(n_tpoly_struct, coeffs) - 0usize];
    ["Offset of field: n_tpoly_struct::alloc"]
        [::std::mem::offset_of!(n_tpoly_struct, alloc) - 8usize];
    ["Offset of field: n_tpoly_struct::length"]
        [::std::mem::offset_of!(n_tpoly_struct, length) - 16usize];
};
impl Default for n_tpoly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type n_tpoly_t = [n_tpoly_struct; 1usize];
pub type n_fq_tpoly_struct = n_tpoly_struct;
pub type n_fq_tpoly_t = n_tpoly_t;
#[repr(C)]
pub struct n_polyu_struct {
    pub exps: *mut mp_limb_t,
    pub coeffs: *mut mp_limb_t,
    pub length: mp_limb_signed_t,
    pub alloc: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_polyu_struct"][::std::mem::size_of::<n_polyu_struct>() - 32usize];
    ["Alignment of n_polyu_struct"][::std::mem::align_of::<n_polyu_struct>() - 8usize];
    ["Offset of field: n_polyu_struct::exps"]
        [::std::mem::offset_of!(n_polyu_struct, exps) - 0usize];
    ["Offset of field: n_polyu_struct::coeffs"]
        [::std::mem::offset_of!(n_polyu_struct, coeffs) - 8usize];
    ["Offset of field: n_polyu_struct::length"]
        [::std::mem::offset_of!(n_polyu_struct, length) - 16usize];
    ["Offset of field: n_polyu_struct::alloc"]
        [::std::mem::offset_of!(n_polyu_struct, alloc) - 24usize];
};
impl Default for n_polyu_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type n_polyu_t = [n_polyu_struct; 1usize];
pub type n_fq_polyu_struct = n_polyu_struct;
pub type n_fq_polyu_t = n_polyu_t;
#[repr(C)]
pub struct n_polyun_struct {
    pub coeffs: *mut n_poly_struct,
    pub exps: *mut mp_limb_t,
    pub length: mp_limb_signed_t,
    pub alloc: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_polyun_struct"][::std::mem::size_of::<n_polyun_struct>() - 32usize];
    ["Alignment of n_polyun_struct"][::std::mem::align_of::<n_polyun_struct>() - 8usize];
    ["Offset of field: n_polyun_struct::coeffs"]
        [::std::mem::offset_of!(n_polyun_struct, coeffs) - 0usize];
    ["Offset of field: n_polyun_struct::exps"]
        [::std::mem::offset_of!(n_polyun_struct, exps) - 8usize];
    ["Offset of field: n_polyun_struct::length"]
        [::std::mem::offset_of!(n_polyun_struct, length) - 16usize];
    ["Offset of field: n_polyun_struct::alloc"]
        [::std::mem::offset_of!(n_polyun_struct, alloc) - 24usize];
};
impl Default for n_polyun_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type n_polyun_t = [n_polyun_struct; 1usize];
pub type n_fq_polyun_struct = n_polyun_struct;
pub type n_fq_polyun_t = n_polyun_t;
#[repr(C)]
pub struct n_poly_stack_struct {
    pub array: *mut *mut n_poly_struct,
    pub alloc: mp_limb_signed_t,
    pub top: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_poly_stack_struct"][::std::mem::size_of::<n_poly_stack_struct>() - 24usize];
    ["Alignment of n_poly_stack_struct"][::std::mem::align_of::<n_poly_stack_struct>() - 8usize];
    ["Offset of field: n_poly_stack_struct::array"]
        [::std::mem::offset_of!(n_poly_stack_struct, array) - 0usize];
    ["Offset of field: n_poly_stack_struct::alloc"]
        [::std::mem::offset_of!(n_poly_stack_struct, alloc) - 8usize];
    ["Offset of field: n_poly_stack_struct::top"]
        [::std::mem::offset_of!(n_poly_stack_struct, top) - 16usize];
};
impl Default for n_poly_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type n_poly_stack_t = [n_poly_stack_struct; 1usize];
#[repr(C)]
pub struct n_bpoly_stack_struct {
    pub array: *mut *mut n_bpoly_struct,
    pub alloc: mp_limb_signed_t,
    pub top: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_bpoly_stack_struct"][::std::mem::size_of::<n_bpoly_stack_struct>() - 24usize];
    ["Alignment of n_bpoly_stack_struct"][::std::mem::align_of::<n_bpoly_stack_struct>() - 8usize];
    ["Offset of field: n_bpoly_stack_struct::array"]
        [::std::mem::offset_of!(n_bpoly_stack_struct, array) - 0usize];
    ["Offset of field: n_bpoly_stack_struct::alloc"]
        [::std::mem::offset_of!(n_bpoly_stack_struct, alloc) - 8usize];
    ["Offset of field: n_bpoly_stack_struct::top"]
        [::std::mem::offset_of!(n_bpoly_stack_struct, top) - 16usize];
};
impl Default for n_bpoly_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type n_bpoly_stack_t = [n_bpoly_stack_struct; 1usize];
#[repr(C)]
pub struct n_poly_bpoly_stack_struct {
    pub poly_stack: n_poly_stack_t,
    pub bpoly_stack: n_bpoly_stack_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_poly_bpoly_stack_struct"]
        [::std::mem::size_of::<n_poly_bpoly_stack_struct>() - 48usize];
    ["Alignment of n_poly_bpoly_stack_struct"]
        [::std::mem::align_of::<n_poly_bpoly_stack_struct>() - 8usize];
    ["Offset of field: n_poly_bpoly_stack_struct::poly_stack"]
        [::std::mem::offset_of!(n_poly_bpoly_stack_struct, poly_stack) - 0usize];
    ["Offset of field: n_poly_bpoly_stack_struct::bpoly_stack"]
        [::std::mem::offset_of!(n_poly_bpoly_stack_struct, bpoly_stack) - 24usize];
};
impl Default for n_poly_bpoly_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type n_poly_bpoly_stack_t = [n_poly_bpoly_stack_struct; 1usize];
#[repr(C)]
pub struct nmod_eval_interp_struct {
    pub M: *mut mp_limb_t,
    pub T: *mut mp_limb_t,
    pub Q: *mut mp_limb_t,
    pub array: *mut mp_limb_t,
    pub alloc: mp_limb_signed_t,
    pub d: mp_limb_signed_t,
    pub radix: mp_limb_signed_t,
    pub w: mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_eval_interp_struct"][::std::mem::size_of::<nmod_eval_interp_struct>() - 64usize];
    ["Alignment of nmod_eval_interp_struct"]
        [::std::mem::align_of::<nmod_eval_interp_struct>() - 8usize];
    ["Offset of field: nmod_eval_interp_struct::M"]
        [::std::mem::offset_of!(nmod_eval_interp_struct, M) - 0usize];
    ["Offset of field: nmod_eval_interp_struct::T"]
        [::std::mem::offset_of!(nmod_eval_interp_struct, T) - 8usize];
    ["Offset of field: nmod_eval_interp_struct::Q"]
        [::std::mem::offset_of!(nmod_eval_interp_struct, Q) - 16usize];
    ["Offset of field: nmod_eval_interp_struct::array"]
        [::std::mem::offset_of!(nmod_eval_interp_struct, array) - 24usize];
    ["Offset of field: nmod_eval_interp_struct::alloc"]
        [::std::mem::offset_of!(nmod_eval_interp_struct, alloc) - 32usize];
    ["Offset of field: nmod_eval_interp_struct::d"]
        [::std::mem::offset_of!(nmod_eval_interp_struct, d) - 40usize];
    ["Offset of field: nmod_eval_interp_struct::radix"]
        [::std::mem::offset_of!(nmod_eval_interp_struct, radix) - 48usize];
    ["Offset of field: nmod_eval_interp_struct::w"]
        [::std::mem::offset_of!(nmod_eval_interp_struct, w) - 56usize];
};
impl Default for nmod_eval_interp_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_eval_interp_t = [nmod_eval_interp_struct; 1usize];
