/* automatically generated by rust-bindgen 0.70.1 */

#![allow(non_camel_case_types)]
use crate::deps::*;
use crate::flint::*;
use crate::n_poly_types::*;
use libc::{c_char, c_int, c_uint, c_void, size_t, FILE};


pub const N_FQ_REDUCE_ITCH: u32 = 2;
pub const N_FQ_MUL_ITCH: u32 = 4;
pub const N_FQ_LAZY_ITCH: u32 = 6;
pub const N_FQ_INV_ITCH: u32 = 1;
pub const N_FQ_POLY_DIVREM_DIVCONQUER_CUTOFF: u32 = 20;
#[repr(C)]
pub struct n_polyun_stack_struct {
    pub array: *mut *mut n_polyun_struct,
    pub alloc: mp_limb_signed_t,
    pub top: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_polyun_stack_struct"][::std::mem::size_of::<n_polyun_stack_struct>() - 24usize];
    ["Alignment of n_polyun_stack_struct"]
        [::std::mem::align_of::<n_polyun_stack_struct>() - 8usize];
    ["Offset of field: n_polyun_stack_struct::array"]
        [::std::mem::offset_of!(n_polyun_stack_struct, array) - 0usize];
    ["Offset of field: n_polyun_stack_struct::alloc"]
        [::std::mem::offset_of!(n_polyun_stack_struct, alloc) - 8usize];
    ["Offset of field: n_polyun_stack_struct::top"]
        [::std::mem::offset_of!(n_polyun_stack_struct, top) - 16usize];
};
impl Default for n_polyun_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type n_polyun_stack_t = [n_polyun_stack_struct; 1usize];
#[repr(C)]
pub struct n_poly_polyun_stack_struct {
    pub poly_stack: n_poly_stack_t,
    pub polyun_stack: n_polyun_stack_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of n_poly_polyun_stack_struct"]
        [::std::mem::size_of::<n_poly_polyun_stack_struct>() - 48usize];
    ["Alignment of n_poly_polyun_stack_struct"]
        [::std::mem::align_of::<n_poly_polyun_stack_struct>() - 8usize];
    ["Offset of field: n_poly_polyun_stack_struct::poly_stack"]
        [::std::mem::offset_of!(n_poly_polyun_stack_struct, poly_stack) - 0usize];
    ["Offset of field: n_poly_polyun_stack_struct::polyun_stack"]
        [::std::mem::offset_of!(n_poly_polyun_stack_struct, polyun_stack) - 24usize];
};
impl Default for n_poly_polyun_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type n_poly_polyun_stack_t = [n_poly_polyun_stack_struct; 1usize];
extern "C" {
    pub fn n_poly_is_canonical(A: *const n_poly_struct) -> ::std::os::raw::c_int;
    pub fn n_poly_realloc(A: *mut n_poly_struct, len: mp_limb_signed_t);
    pub fn n_poly_print_pretty(A: *const n_poly_struct, x: *const ::std::os::raw::c_char);
    pub fn n_poly_mod_is_canonical(A: *const n_poly_struct, mod_: nmod_t) -> ::std::os::raw::c_int;
    pub fn n_poly_set_coeff(A: *mut n_poly_struct, e: mp_limb_signed_t, c: mp_limb_t);
    pub fn n_poly_mod_set_coeff_ui(
        A: *mut n_poly_struct,
