/* automatically generated by rust-bindgen 0.70.1 */

use crate::deps::*;
use crate::flint::*;
use crate::gr_types::*;


pub const NFLOAT_MIN_LIMBS: u32 = 1;
pub const NFLOAT_MAX_LIMBS: u32 = 66;
pub const NFLOAT_HEADER_LIMBS: u32 = 2;
pub const NFLOAT_MAX_ALLOC: u32 = 68;
pub const NFLOAT_ALLOW_UNDERFLOW: u32 = 1;
pub const NFLOAT_ALLOW_INF: u32 = 2;
pub const NFLOAT_ALLOW_NAN: u32 = 4;
pub const NFLOAT_RND_FLOOR: u32 = 8;
pub const NFLOAT_RND_CEIL: u32 = 16;
#[repr(C)]
pub struct _nfloat_ctx_struct {
    pub nlimbs: slong,
    pub flags: libc::c_int,
    pub rnd: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _nfloat_ctx_struct"][::std::mem::size_of::<_nfloat_ctx_struct>() - 16usize];
    ["Alignment of _nfloat_ctx_struct"][::std::mem::align_of::<_nfloat_ctx_struct>() - 8usize];
    ["Offset of field: _nfloat_ctx_struct::nlimbs"]
        [::std::mem::offset_of!(_nfloat_ctx_struct, nlimbs) - 0usize];
    ["Offset of field: _nfloat_ctx_struct::flags"]
        [::std::mem::offset_of!(_nfloat_ctx_struct, flags) - 8usize];
    ["Offset of field: _nfloat_ctx_struct::rnd"]
        [::std::mem::offset_of!(_nfloat_ctx_struct, rnd) - 12usize];
};
impl Default for _nfloat_ctx_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nfloat_ptr = *mut libc::c_void;
pub type nfloat_srcptr = *const libc::c_void;
#[repr(C)]
pub struct nfloat64_struct {
    pub head: [ulong; 2usize],
    pub d: [ulong; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nfloat64_struct"][::std::mem::size_of::<nfloat64_struct>() - 24usize];
    ["Alignment of nfloat64_struct"][::std::mem::align_of::<nfloat64_struct>() - 8usize];
    ["Offset of field: nfloat64_struct::head"]
        [::std::mem::offset_of!(nfloat64_struct, head) - 0usize];
    ["Offset of field: nfloat64_struct::d"][::std::mem::offset_of!(nfloat64_struct, d) - 16usize];
};
impl Default for nfloat64_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nfloat128_struct {
    pub head: [ulong; 2usize],
    pub d: [ulong; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nfloat128_struct"][::std::mem::size_of::<nfloat128_struct>() - 32usize];
    ["Alignment of nfloat128_struct"][::std::mem::align_of::<nfloat128_struct>() - 8usize];
    ["Offset of field: nfloat128_struct::head"]
        [::std::mem::offset_of!(nfloat128_struct, head) - 0usize];
    ["Offset of field: nfloat128_struct::d"][::std::mem::offset_of!(nfloat128_struct, d) - 16usize];
};
impl Default for nfloat128_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nfloat192_struct {
    pub head: [ulong; 2usize],
    pub d: [ulong; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nfloat192_struct"][::std::mem::size_of::<nfloat192_struct>() - 40usize];
    ["Alignment of nfloat192_struct"][::std::mem::align_of::<nfloat192_struct>() - 8usize];
    ["Offset of field: nfloat192_struct::head"]
        [::std::mem::offset_of!(nfloat192_struct, head) - 0usize];
    ["Offset of field: nfloat192_struct::d"][::std::mem::offset_of!(nfloat192_struct, d) - 16usize];
};
impl Default for nfloat192_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nfloat256_struct {
    pub head: [ulong; 2usize],
    pub d: [ulong; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nfloat256_struct"][::std::mem::size_of::<nfloat256_struct>() - 48usize];
    ["Alignment of nfloat256_struct"][::std::mem::align_of::<nfloat256_struct>() - 8usize];
    ["Offset of field: nfloat256_struct::head"]
        [::std::mem::offset_of!(nfloat256_struct, head) - 0usize];
    ["Offset of field: nfloat256_struct::d"][::std::mem::offset_of!(nfloat256_struct, d) - 16usize];
};
impl Default for nfloat256_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nfloat384_struct {
    pub head: [ulong; 2usize],
    pub d: [ulong; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nfloat384_struct"][::std::mem::size_of::<nfloat384_struct>() - 64usize];
    ["Alignment of nfloat384_struct"][::std::mem::align_of::<nfloat384_struct>() - 8usize];
    ["Offset of field: nfloat384_struct::head"]
        [::std::mem::offset_of!(nfloat384_struct, head) - 0usize];
    ["Offset of field: nfloat384_struct::d"][::std::mem::offset_of!(nfloat384_struct, d) - 16usize];
};
impl Default for nfloat384_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nfloat512_struct {
    pub head: [ulong; 2usize],
    pub d: [ulong; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nfloat512_struct"][::std::mem::size_of::<nfloat512_struct>() - 80usize];
    ["Alignment of nfloat512_struct"][::std::mem::align_of::<nfloat512_struct>() - 8usize];
    ["Offset of field: nfloat512_struct::head"]
        [::std::mem::offset_of!(nfloat512_struct, head) - 0usize];
    ["Offset of field: nfloat512_struct::d"][::std::mem::offset_of!(nfloat512_struct, d) - 16usize];
};
impl Default for nfloat512_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nfloat1024_struct {
    pub head: [ulong; 2usize],
    pub d: [ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nfloat1024_struct"][::std::mem::size_of::<nfloat1024_struct>() - 144usize];
    ["Alignment of nfloat1024_struct"][::std::mem::align_of::<nfloat1024_struct>() - 8usize];
    ["Offset of field: nfloat1024_struct::head"]
        [::std::mem::offset_of!(nfloat1024_struct, head) - 0usize];
    ["Offset of field: nfloat1024_struct::d"]
        [::std::mem::offset_of!(nfloat1024_struct, d) - 16usize];
};
impl Default for nfloat1024_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nfloat2048_struct {
    pub head: [ulong; 2usize],
    pub d: [ulong; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nfloat2048_struct"][::std::mem::size_of::<nfloat2048_struct>() - 272usize];
    ["Alignment of nfloat2048_struct"][::std::mem::align_of::<nfloat2048_struct>() - 8usize];
    ["Offset of field: nfloat2048_struct::head"]
        [::std::mem::offset_of!(nfloat2048_struct, head) - 0usize];
    ["Offset of field: nfloat2048_struct::d"]
        [::std::mem::offset_of!(nfloat2048_struct, d) - 16usize];
};
impl Default for nfloat2048_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nfloat4096_struct {
    pub head: [ulong; 2usize],
    pub d: [ulong; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nfloat4096_struct"][::std::mem::size_of::<nfloat4096_struct>() - 528usize];
    ["Alignment of nfloat4096_struct"][::std::mem::align_of::<nfloat4096_struct>() - 8usize];
    ["Offset of field: nfloat4096_struct::head"]
        [::std::mem::offset_of!(nfloat4096_struct, head) - 0usize];
    ["Offset of field: nfloat4096_struct::d"]
        [::std::mem::offset_of!(nfloat4096_struct, d) - 16usize];
};
impl Default for nfloat4096_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nfloat64_t = [nfloat64_struct; 1usize];
pub type nfloat128_t = [nfloat128_struct; 1usize];
pub type nfloat192_t = [nfloat192_struct; 1usize];
pub type nfloat256_t = [nfloat256_struct; 1usize];
pub type nfloat384_t = [nfloat384_struct; 1usize];
pub type nfloat512_t = [nfloat512_struct; 1usize];
pub type nfloat1024_t = [nfloat1024_struct; 1usize];
pub type nfloat2048_t = [nfloat2048_struct; 1usize];
pub type nfloat4096_t = [nfloat4096_struct; 1usize];
pub type nfloat_complex_ptr = nfloat_ptr;
pub type nfloat_complex_srcptr = nfloat_srcptr;
extern "C" {
