/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::bindgen::*;
use crate::acb::*;
use crate::acb_calc::*;
use crate::acb_dft::*;
use crate::acb_dirichlet::*;
use crate::acb_elliptic::*;
use crate::acb_hypgeom::*;
use crate::acb_mat::*;
use crate::acb_modular::*;
use crate::acb_poly::*;
use crate::acb_theta::*;
use crate::acb_types::*;
use crate::acf::*;
use crate::acf_types::*;
use crate::aprcl::*;
use crate::arb::*;
use crate::arb_calc::*;
use crate::arb_fmpz_poly::*;
use crate::arb_fpwrap::*;
use crate::arb_hypgeom::*;
use crate::arb_mat::*;
use crate::arb_poly::*;
use crate::arb_types::*;
use crate::arf::*;
use crate::arf_types::*;
use crate::arith::*;
use crate::bernoulli::*;
use crate::bool_mat::*;
use crate::ca::*;
use crate::ca_ext::*;
use crate::ca_field::*;
use crate::ca_mat::*;
use crate::ca_poly::*;
use crate::ca_vec::*;
use crate::calcium::*;
use crate::d_mat::*;
use crate::d_vec::*;
use crate::dirichlet::*;
use crate::dlog::*;
use crate::double_extras::*;
use crate::double_interval::*;
use crate::fexpr::*;
use crate::fexpr_builtin::*;
use crate::fft::*;
use crate::fft_tuning::*;
use crate::flint_config::*;
use crate::flint::*;
use crate::fmpq::*;
use crate::fmpq_mat::*;
use crate::fmpq_mpoly::*;
use crate::fmpq_mpoly_factor::*;
use crate::fmpq_poly::*;
use crate::fmpq_types::*;
use crate::fmpq_vec::*;
use crate::fmpz::*;
use crate::fmpz_extras::*;
use crate::fmpz_factor::*;
use crate::fmpz_lll::*;

use crate::fmpz_mod::*;
use crate::fmpz_mod_mat::*;
use crate::fmpz_mod_mpoly::*;
use crate::fmpz_mod_mpoly_factor::*;
use crate::fmpz_mod_poly::*;
use crate::fmpz_mod_poly_factor::*;
use crate::fmpz_mod_types::*;
use crate::fmpz_mod_vec::*;
use crate::fmpz_mpoly::*;
use crate::fmpz_mpoly_factor::*;
use crate::fmpz_mpoly_q::*;
use crate::fmpz_poly::*;
use crate::fmpz_poly_factor::*;
use crate::fmpz_poly_mat::*;
use crate::fmpz_poly_q::*;
use crate::fmpz_types::*;
use crate::fmpz_vec::*;
use crate::fmpzi::*;
use crate::fq::*;
use crate::fq_default::*;
use crate::fq_default_mat::*;
use crate::fq_default_poly::*;
use crate::fq_default_poly_factor::*;
use crate::fq_embed::*;
use crate::fq_embed_templates::*;
use crate::fq_mat::*;
use crate::fq_mat_templates::*;
use crate::fq_nmod::*;
use crate::fq_nmod_embed::*;
use crate::fq_nmod_mat::*;
use crate::fq_nmod_mpoly::*;
use crate::fq_nmod_mpoly_factor::*;
use crate::fq_nmod_poly::*;
use crate::fq_nmod_poly_factor::*;
use crate::fq_nmod_types::*;
use crate::fq_nmod_vec::*;
use crate::fq_poly::*;
use crate::fq_poly_factor::*;
use crate::fq_poly_factor_templates::*;
use crate::fq_poly_templates::*;
use crate::fq_templates::*;
use crate::fq_types::*;
use crate::fq_vec::*;
use crate::fq_vec_templates::*;
use crate::fq_zech::*;
use crate::fq_zech_embed::*;
use crate::fq_zech_mat::*;
use crate::fq_zech_mpoly::*;
use crate::fq_zech_mpoly_factor::*;
use crate::fq_zech_poly::*;
use crate::fq_zech_poly_factor::*;
use crate::fq_zech_types::*;
use crate::fq_zech_vec::*;
use crate::gmpcompat::*;
use crate::gr::*;
use crate::gr_generic::*;
use crate::gr_mat::*;
use crate::gr_mpoly::*;
use crate::gr_poly::*;
use crate::gr_special::*;
use crate::gr_vec::*;
use crate::hypgeom::*;
use crate::limb_types::*;
use crate::long_extras::*;
use crate::longlong::*;
use crate::mag::*;
use crate::mpf_impl::*;
use crate::mpfr_mat::*;
use crate::mpfr_vec::*;
use crate::mpoly::*;
use crate::mpoly_types::*;
use crate::n_poly::*;
use crate::n_poly_types::*;
use crate::nf::*;
use crate::nf_elem::*;
use crate::nmod::*;
use crate::nmod_mat::*;
use crate::nmod_mpoly::*;
use crate::nmod_mpoly_factor::*;
use crate::nmod_poly_factor::*;
use crate::nmod_poly_mat::*;
use crate::nmod_types::*;
use crate::nmod_vec::*;
use crate::padic::*;
use crate::padic_mat::*;
use crate::padic_poly::*;
use crate::padic_types::*;
use crate::partitions::*;
use crate::perm::*;
use crate::qadic::*;
use crate::qfb::*;
use crate::qqbar::*;
use crate::qsieve::*;
use crate::templates::*;
use crate::thread_pool::*;
use crate::thread_support::*;
use crate::ulong_extras::*;


pub const NMOD_POLY_HGCD_CUTOFF: u32 = 100;
pub const NMOD_POLY_GCD_CUTOFF: u32 = 340;
pub const NMOD_POLY_SMALL_GCD_CUTOFF: u32 = 200;
#[repr(C)]
pub struct nmod_poly_res_struct {
    pub res: mp_limb_t,
    pub lc: mp_limb_t,
    pub len0: mp_limb_signed_t,
    pub len1: mp_limb_signed_t,
    pub off: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_res_struct"][::std::mem::size_of::<nmod_poly_res_struct>() - 40usize];
    ["Alignment of nmod_poly_res_struct"][::std::mem::align_of::<nmod_poly_res_struct>() - 8usize];
    ["Offset of field: nmod_poly_res_struct::res"]
        [::std::mem::offset_of!(nmod_poly_res_struct, res) - 0usize];
    ["Offset of field: nmod_poly_res_struct::lc"]
        [::std::mem::offset_of!(nmod_poly_res_struct, lc) - 8usize];
    ["Offset of field: nmod_poly_res_struct::len0"]
        [::std::mem::offset_of!(nmod_poly_res_struct, len0) - 16usize];
    ["Offset of field: nmod_poly_res_struct::len1"]
        [::std::mem::offset_of!(nmod_poly_res_struct, len1) - 24usize];
    ["Offset of field: nmod_poly_res_struct::off"]
        [::std::mem::offset_of!(nmod_poly_res_struct, off) - 32usize];
};
impl Default for nmod_poly_res_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_poly_res_t = [nmod_poly_res_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nmod_poly_matrix_precompute_arg_t {
    pub A: *mut nmod_mat_struct,
    pub poly1: *mut nmod_poly_struct,
    pub poly2: *mut nmod_poly_struct,
    pub poly2inv: *mut nmod_poly_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_matrix_precompute_arg_t"]
        [::std::mem::size_of::<nmod_poly_matrix_precompute_arg_t>() - 32usize];
    ["Alignment of nmod_poly_matrix_precompute_arg_t"]
        [::std::mem::align_of::<nmod_poly_matrix_precompute_arg_t>() - 8usize];
    ["Offset of field: nmod_poly_matrix_precompute_arg_t::A"]
        [::std::mem::offset_of!(nmod_poly_matrix_precompute_arg_t, A) - 0usize];
    ["Offset of field: nmod_poly_matrix_precompute_arg_t::poly1"]
        [::std::mem::offset_of!(nmod_poly_matrix_precompute_arg_t, poly1) - 8usize];
    ["Offset of field: nmod_poly_matrix_precompute_arg_t::poly2"]
        [::std::mem::offset_of!(nmod_poly_matrix_precompute_arg_t, poly2) - 16usize];
    ["Offset of field: nmod_poly_matrix_precompute_arg_t::poly2inv"]
        [::std::mem::offset_of!(nmod_poly_matrix_precompute_arg_t, poly2inv) - 24usize];
};
impl Default for nmod_poly_matrix_precompute_arg_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nmod_poly_compose_mod_precomp_preinv_arg_t {
    pub A: *mut nmod_mat_struct,
    pub res: *mut nmod_poly_struct,
    pub poly1: *mut nmod_poly_struct,
    pub poly3: *mut nmod_poly_struct,
    pub poly3inv: *mut nmod_poly_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_compose_mod_precomp_preinv_arg_t"]
        [::std::mem::size_of::<nmod_poly_compose_mod_precomp_preinv_arg_t>() - 40usize];
    ["Alignment of nmod_poly_compose_mod_precomp_preinv_arg_t"]
        [::std::mem::align_of::<nmod_poly_compose_mod_precomp_preinv_arg_t>() - 8usize];
    ["Offset of field: nmod_poly_compose_mod_precomp_preinv_arg_t::A"]
        [::std::mem::offset_of!(nmod_poly_compose_mod_precomp_preinv_arg_t, A) - 0usize];
    ["Offset of field: nmod_poly_compose_mod_precomp_preinv_arg_t::res"]
        [::std::mem::offset_of!(nmod_poly_compose_mod_precomp_preinv_arg_t, res) - 8usize];
    ["Offset of field: nmod_poly_compose_mod_precomp_preinv_arg_t::poly1"]
        [::std::mem::offset_of!(nmod_poly_compose_mod_precomp_preinv_arg_t, poly1) - 16usize];
    ["Offset of field: nmod_poly_compose_mod_precomp_preinv_arg_t::poly3"]
        [::std::mem::offset_of!(nmod_poly_compose_mod_precomp_preinv_arg_t, poly3) - 24usize];
    ["Offset of field: nmod_poly_compose_mod_precomp_preinv_arg_t::poly3inv"]
        [::std::mem::offset_of!(nmod_poly_compose_mod_precomp_preinv_arg_t, poly3inv) - 32usize];
};
impl Default for nmod_poly_compose_mod_precomp_preinv_arg_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct _nmod_poly_multi_crt_prog_instr {
    pub a_idx: mp_limb_signed_t,
    pub b_idx: mp_limb_signed_t,
    pub c_idx: mp_limb_signed_t,
    pub idem: nmod_poly_t,
    pub modulus: nmod_poly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _nmod_poly_multi_crt_prog_instr"]
        [::std::mem::size_of::<_nmod_poly_multi_crt_prog_instr>() - 120usize];
    ["Alignment of _nmod_poly_multi_crt_prog_instr"]
        [::std::mem::align_of::<_nmod_poly_multi_crt_prog_instr>() - 8usize];
    ["Offset of field: _nmod_poly_multi_crt_prog_instr::a_idx"]
        [::std::mem::offset_of!(_nmod_poly_multi_crt_prog_instr, a_idx) - 0usize];
    ["Offset of field: _nmod_poly_multi_crt_prog_instr::b_idx"]
        [::std::mem::offset_of!(_nmod_poly_multi_crt_prog_instr, b_idx) - 8usize];
    ["Offset of field: _nmod_poly_multi_crt_prog_instr::c_idx"]
        [::std::mem::offset_of!(_nmod_poly_multi_crt_prog_instr, c_idx) - 16usize];
    ["Offset of field: _nmod_poly_multi_crt_prog_instr::idem"]
        [::std::mem::offset_of!(_nmod_poly_multi_crt_prog_instr, idem) - 24usize];
    ["Offset of field: _nmod_poly_multi_crt_prog_instr::modulus"]
        [::std::mem::offset_of!(_nmod_poly_multi_crt_prog_instr, modulus) - 72usize];
};
impl Default for _nmod_poly_multi_crt_prog_instr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nmod_poly_multi_crt_struct {
    pub prog: *mut _nmod_poly_multi_crt_prog_instr,
    pub length: mp_limb_signed_t,
    pub alloc: mp_limb_signed_t,
    pub localsize: mp_limb_signed_t,
    pub temp1loc: mp_limb_signed_t,
    pub temp2loc: mp_limb_signed_t,
    pub good: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_multi_crt_struct"]
        [::std::mem::size_of::<nmod_poly_multi_crt_struct>() - 56usize];
    ["Alignment of nmod_poly_multi_crt_struct"]
        [::std::mem::align_of::<nmod_poly_multi_crt_struct>() - 8usize];
    ["Offset of field: nmod_poly_multi_crt_struct::prog"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, prog) - 0usize];
    ["Offset of field: nmod_poly_multi_crt_struct::length"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, length) - 8usize];
    ["Offset of field: nmod_poly_multi_crt_struct::alloc"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, alloc) - 16usize];
    ["Offset of field: nmod_poly_multi_crt_struct::localsize"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, localsize) - 24usize];
    ["Offset of field: nmod_poly_multi_crt_struct::temp1loc"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, temp1loc) - 32usize];
    ["Offset of field: nmod_poly_multi_crt_struct::temp2loc"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, temp2loc) - 40usize];
    ["Offset of field: nmod_poly_multi_crt_struct::good"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, good) - 48usize];
};
impl Default for nmod_poly_multi_crt_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_poly_multi_crt_t = [nmod_poly_multi_crt_struct; 1usize];
#[repr(C)]
pub struct nmod_berlekamp_massey_struct {
    pub npoints: mp_limb_signed_t,
    pub R0: nmod_poly_t,
    pub R1: nmod_poly_t,
    pub V0: nmod_poly_t,
    pub V1: nmod_poly_t,
    pub qt: nmod_poly_t,
    pub rt: nmod_poly_t,
    pub points: nmod_poly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_berlekamp_massey_struct"]
        [::std::mem::size_of::<nmod_berlekamp_massey_struct>() - 344usize];
    ["Alignment of nmod_berlekamp_massey_struct"]
        [::std::mem::align_of::<nmod_berlekamp_massey_struct>() - 8usize];
    ["Offset of field: nmod_berlekamp_massey_struct::npoints"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, npoints) - 0usize];
    ["Offset of field: nmod_berlekamp_massey_struct::R0"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, R0) - 8usize];
    ["Offset of field: nmod_berlekamp_massey_struct::R1"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, R1) - 56usize];
    ["Offset of field: nmod_berlekamp_massey_struct::V0"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, V0) - 104usize];
    ["Offset of field: nmod_berlekamp_massey_struct::V1"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, V1) - 152usize];
    ["Offset of field: nmod_berlekamp_massey_struct::qt"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, qt) - 200usize];
    ["Offset of field: nmod_berlekamp_massey_struct::rt"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, rt) - 248usize];
    ["Offset of field: nmod_berlekamp_massey_struct::points"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, points) - 296usize];
};
impl Default for nmod_berlekamp_massey_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_berlekamp_massey_t = [nmod_berlekamp_massey_struct; 1usize];
extern "C" {
    #[link_name = "signed_mpn_sub_n__extern"]
    pub fn signed_mpn_sub_n(
        res: mp_ptr,
        op1: mp_srcptr,
        op2: mp_srcptr,
        n: mp_limb_signed_t,
    ) -> libc::c_int;
    pub fn nmod_poly_init(poly: *mut nmod_poly_struct, n: mp_limb_t);
    pub fn nmod_poly_init_preinv(poly: *mut nmod_poly_struct, n: mp_limb_t, ninv: mp_limb_t);
    pub fn nmod_poly_init2(poly: *mut nmod_poly_struct, n: mp_limb_t, alloc: mp_limb_signed_t);
    pub fn nmod_poly_init2_preinv(
