/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::flint::*;
use crate::fmpz_types::*;
use crate::mpoly_types::*;
use crate::n_poly_types::*;
use crate::nmod_types::*;


#[repr(C)]
pub struct nmod_mpoly_univar_struct {
    pub coeffs: *mut nmod_mpoly_struct,
    pub exps: *mut fmpz,
    pub alloc: slong,
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_mpoly_univar_struct"]
        [::std::mem::size_of::<nmod_mpoly_univar_struct>() - 32usize];
    ["Alignment of nmod_mpoly_univar_struct"]
        [::std::mem::align_of::<nmod_mpoly_univar_struct>() - 8usize];
    ["Offset of field: nmod_mpoly_univar_struct::coeffs"]
        [::std::mem::offset_of!(nmod_mpoly_univar_struct, coeffs) - 0usize];
    ["Offset of field: nmod_mpoly_univar_struct::exps"]
        [::std::mem::offset_of!(nmod_mpoly_univar_struct, exps) - 8usize];
    ["Offset of field: nmod_mpoly_univar_struct::alloc"]
        [::std::mem::offset_of!(nmod_mpoly_univar_struct, alloc) - 16usize];
    ["Offset of field: nmod_mpoly_univar_struct::length"]
        [::std::mem::offset_of!(nmod_mpoly_univar_struct, length) - 24usize];
};
impl Default for nmod_mpoly_univar_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_mpoly_univar_t = [nmod_mpoly_univar_struct; 1usize];
#[repr(C)]
pub struct nmod_mpolyu_struct {
    pub coeffs: *mut nmod_mpoly_struct,
    pub exps: *mut ulong,
    pub alloc: slong,
    pub length: slong,
    pub bits: flint_bitcnt_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_mpolyu_struct"][::std::mem::size_of::<nmod_mpolyu_struct>() - 40usize];
    ["Alignment of nmod_mpolyu_struct"][::std::mem::align_of::<nmod_mpolyu_struct>() - 8usize];
    ["Offset of field: nmod_mpolyu_struct::coeffs"]
        [::std::mem::offset_of!(nmod_mpolyu_struct, coeffs) - 0usize];
    ["Offset of field: nmod_mpolyu_struct::exps"]
        [::std::mem::offset_of!(nmod_mpolyu_struct, exps) - 8usize];
    ["Offset of field: nmod_mpolyu_struct::alloc"]
        [::std::mem::offset_of!(nmod_mpolyu_struct, alloc) - 16usize];
    ["Offset of field: nmod_mpolyu_struct::length"]
        [::std::mem::offset_of!(nmod_mpolyu_struct, length) - 24usize];
    ["Offset of field: nmod_mpolyu_struct::bits"]
        [::std::mem::offset_of!(nmod_mpolyu_struct, bits) - 32usize];
};
impl Default for nmod_mpolyu_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_mpolyu_t = [nmod_mpolyu_struct; 1usize];
#[repr(C)]
pub struct nmod_mpolyd_struct {
    pub nvars: slong,
    pub degb_alloc: slong,
    pub deg_bounds: *mut slong,
    pub coeff_alloc: slong,
    pub coeffs: *mut ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_mpolyd_struct"][::std::mem::size_of::<nmod_mpolyd_struct>() - 40usize];
    ["Alignment of nmod_mpolyd_struct"][::std::mem::align_of::<nmod_mpolyd_struct>() - 8usize];
    ["Offset of field: nmod_mpolyd_struct::nvars"]
        [::std::mem::offset_of!(nmod_mpolyd_struct, nvars) - 0usize];
    ["Offset of field: nmod_mpolyd_struct::degb_alloc"]
        [::std::mem::offset_of!(nmod_mpolyd_struct, degb_alloc) - 8usize];
    ["Offset of field: nmod_mpolyd_struct::deg_bounds"]
        [::std::mem::offset_of!(nmod_mpolyd_struct, deg_bounds) - 16usize];
    ["Offset of field: nmod_mpolyd_struct::coeff_alloc"]
        [::std::mem::offset_of!(nmod_mpolyd_struct, coeff_alloc) - 24usize];
    ["Offset of field: nmod_mpolyd_struct::coeffs"]
        [::std::mem::offset_of!(nmod_mpolyd_struct, coeffs) - 32usize];
};
impl Default for nmod_mpolyd_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_mpolyd_t = [nmod_mpolyd_struct; 1usize];
#[repr(C)]
pub struct nmod_poly_stack_struct {
    pub poly_array: *mut *mut n_poly_struct,
    pub poly_alloc: slong,
    pub poly_top: slong,
    pub mpolyun_array: *mut *mut nmod_mpolyun_struct,
    pub mpolyun_alloc: slong,
    pub mpolyun_top: slong,
    pub mpolyn_array: *mut *mut nmod_mpolyn_struct,
    pub mpolyn_alloc: slong,
    pub mpolyn_top: slong,
    pub ctx: *const nmod_mpoly_ctx_struct,
    pub bits: flint_bitcnt_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_stack_struct"][::std::mem::size_of::<nmod_poly_stack_struct>() - 88usize];
    ["Alignment of nmod_poly_stack_struct"]
        [::std::mem::align_of::<nmod_poly_stack_struct>() - 8usize];
    ["Offset of field: nmod_poly_stack_struct::poly_array"]
        [::std::mem::offset_of!(nmod_poly_stack_struct, poly_array) - 0usize];
    ["Offset of field: nmod_poly_stack_struct::poly_alloc"]
        [::std::mem::offset_of!(nmod_poly_stack_struct, poly_alloc) - 8usize];
    ["Offset of field: nmod_poly_stack_struct::poly_top"]
        [::std::mem::offset_of!(nmod_poly_stack_struct, poly_top) - 16usize];
    ["Offset of field: nmod_poly_stack_struct::mpolyun_array"]
        [::std::mem::offset_of!(nmod_poly_stack_struct, mpolyun_array) - 24usize];
    ["Offset of field: nmod_poly_stack_struct::mpolyun_alloc"]
        [::std::mem::offset_of!(nmod_poly_stack_struct, mpolyun_alloc) - 32usize];
    ["Offset of field: nmod_poly_stack_struct::mpolyun_top"]
        [::std::mem::offset_of!(nmod_poly_stack_struct, mpolyun_top) - 40usize];
    ["Offset of field: nmod_poly_stack_struct::mpolyn_array"]
        [::std::mem::offset_of!(nmod_poly_stack_struct, mpolyn_array) - 48usize];
    ["Offset of field: nmod_poly_stack_struct::mpolyn_alloc"]
        [::std::mem::offset_of!(nmod_poly_stack_struct, mpolyn_alloc) - 56usize];
    ["Offset of field: nmod_poly_stack_struct::mpolyn_top"]
        [::std::mem::offset_of!(nmod_poly_stack_struct, mpolyn_top) - 64usize];
    ["Offset of field: nmod_poly_stack_struct::ctx"]
        [::std::mem::offset_of!(nmod_poly_stack_struct, ctx) - 72usize];
    ["Offset of field: nmod_poly_stack_struct::bits"]
        [::std::mem::offset_of!(nmod_poly_stack_struct, bits) - 80usize];
};
impl Default for nmod_poly_stack_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_poly_stack_t = [nmod_poly_stack_struct; 1usize];
#[repr(C)]
pub struct nmod_mpolyd_ctx_struct {
    pub nvars: slong,
    pub perm: *mut slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_mpolyd_ctx_struct"][::std::mem::size_of::<nmod_mpolyd_ctx_struct>() - 16usize];
    ["Alignment of nmod_mpolyd_ctx_struct"]
        [::std::mem::align_of::<nmod_mpolyd_ctx_struct>() - 8usize];
    ["Offset of field: nmod_mpolyd_ctx_struct::nvars"]
        [::std::mem::offset_of!(nmod_mpolyd_ctx_struct, nvars) - 0usize];
    ["Offset of field: nmod_mpolyd_ctx_struct::perm"]
        [::std::mem::offset_of!(nmod_mpolyd_ctx_struct, perm) - 8usize];
};
impl Default for nmod_mpolyd_ctx_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_mpolyd_ctx_t = [nmod_mpolyd_ctx_struct; 1usize];
#[repr(C)]
pub struct _nmod_mpoly_stripe_struct {
    pub big_mem: *mut libc::c_char,
    pub big_mem_alloc: slong,
    pub ctx: *const nmod_mpoly_ctx_struct,
    pub N: slong,
    pub bits: flint_bitcnt_t,
    pub mod_: nmod_t,
    pub lc_minus_inv: ulong,
    pub cmpmask: *const ulong,
    pub startidx: *mut slong,
    pub endidx: *mut slong,
    pub emin: *mut ulong,
    pub emax: *mut ulong,
    pub upperclosed: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _nmod_mpoly_stripe_struct"]
        [::std::mem::size_of::<_nmod_mpoly_stripe_struct>() - 120usize];
    ["Alignment of _nmod_mpoly_stripe_struct"]
        [::std::mem::align_of::<_nmod_mpoly_stripe_struct>() - 8usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::big_mem"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, big_mem) - 0usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::big_mem_alloc"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, big_mem_alloc) - 8usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::ctx"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, ctx) - 16usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::N"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, N) - 24usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::bits"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, bits) - 32usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::mod_"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, mod_) - 40usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::lc_minus_inv"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, lc_minus_inv) - 64usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::cmpmask"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, cmpmask) - 72usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::startidx"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, startidx) - 80usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::endidx"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, endidx) - 88usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::emin"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, emin) - 96usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::emax"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, emax) - 104usize];
    ["Offset of field: _nmod_mpoly_stripe_struct::upperclosed"]
        [::std::mem::offset_of!(_nmod_mpoly_stripe_struct, upperclosed) - 112usize];
};
impl Default for _nmod_mpoly_stripe_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_mpoly_stripe_struct = _nmod_mpoly_stripe_struct;
pub type nmod_mpoly_stripe_t = [nmod_mpoly_stripe_struct; 1usize];
#[repr(C)]
pub struct nmod_mpoly_geobucket {
    pub polys: [nmod_mpoly_struct; 32usize],
    pub temps: [nmod_mpoly_struct; 32usize],
    pub length: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_mpoly_geobucket"][::std::mem::size_of::<nmod_mpoly_geobucket>() - 3080usize];
    ["Alignment of nmod_mpoly_geobucket"][::std::mem::align_of::<nmod_mpoly_geobucket>() - 8usize];
    ["Offset of field: nmod_mpoly_geobucket::polys"]
        [::std::mem::offset_of!(nmod_mpoly_geobucket, polys) - 0usize];
    ["Offset of field: nmod_mpoly_geobucket::temps"]
        [::std::mem::offset_of!(nmod_mpoly_geobucket, temps) - 1536usize];
    ["Offset of field: nmod_mpoly_geobucket::length"]
        [::std::mem::offset_of!(nmod_mpoly_geobucket, length) - 3072usize];
};
impl Default for nmod_mpoly_geobucket {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_mpoly_geobucket_struct = nmod_mpoly_geobucket;
pub type nmod_mpoly_geobucket_t = [nmod_mpoly_geobucket_struct; 1usize];
extern "C" {
    #[link_name = "nmod_mpoly_term_coeff_ref__extern"]
    pub fn nmod_mpoly_term_coeff_ref(
        A: *mut nmod_mpoly_struct,
        i: slong,
        UNUSED_ctx: *const nmod_mpoly_ctx_struct,
    ) -> *mut ulong;
    #[link_name = "evil_cast_nmod_poly_to_n_poly__extern"]
    pub fn evil_cast_nmod_poly_to_n_poly(a: *mut nmod_poly_struct) -> *mut n_poly_struct;
    #[link_name = "evil_const_cast_nmod_poly_to_n_poly__extern"]
