/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::flint::*;
use crate::nmod_types::*;


pub const NMOD_POLY_MULMOD_PRECOND_NONE: u32 = 0;
pub const NMOD_POLY_MULMOD_PRECOND_SHOUP: u32 = 1;
pub const NMOD_POLY_MULMOD_PRECOND_MATRIX: u32 = 2;
#[repr(C)]
pub struct nmod_poly_res_struct {
    pub res: ulong,
    pub lc: ulong,
    pub len0: slong,
    pub len1: slong,
    pub off: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_res_struct"][::std::mem::size_of::<nmod_poly_res_struct>() - 40usize];
    ["Alignment of nmod_poly_res_struct"][::std::mem::align_of::<nmod_poly_res_struct>() - 8usize];
    ["Offset of field: nmod_poly_res_struct::res"]
        [::std::mem::offset_of!(nmod_poly_res_struct, res) - 0usize];
    ["Offset of field: nmod_poly_res_struct::lc"]
        [::std::mem::offset_of!(nmod_poly_res_struct, lc) - 8usize];
    ["Offset of field: nmod_poly_res_struct::len0"]
        [::std::mem::offset_of!(nmod_poly_res_struct, len0) - 16usize];
    ["Offset of field: nmod_poly_res_struct::len1"]
        [::std::mem::offset_of!(nmod_poly_res_struct, len1) - 24usize];
    ["Offset of field: nmod_poly_res_struct::off"]
        [::std::mem::offset_of!(nmod_poly_res_struct, off) - 32usize];
};
impl Default for nmod_poly_res_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_poly_res_t = [nmod_poly_res_struct; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nmod_poly_matrix_precompute_arg_t {
    pub A: *mut nmod_mat_struct,
    pub poly1: *mut nmod_poly_struct,
    pub poly2: *mut nmod_poly_struct,
    pub poly2inv: *mut nmod_poly_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_matrix_precompute_arg_t"]
        [::std::mem::size_of::<nmod_poly_matrix_precompute_arg_t>() - 32usize];
    ["Alignment of nmod_poly_matrix_precompute_arg_t"]
        [::std::mem::align_of::<nmod_poly_matrix_precompute_arg_t>() - 8usize];
    ["Offset of field: nmod_poly_matrix_precompute_arg_t::A"]
        [::std::mem::offset_of!(nmod_poly_matrix_precompute_arg_t, A) - 0usize];
    ["Offset of field: nmod_poly_matrix_precompute_arg_t::poly1"]
        [::std::mem::offset_of!(nmod_poly_matrix_precompute_arg_t, poly1) - 8usize];
    ["Offset of field: nmod_poly_matrix_precompute_arg_t::poly2"]
        [::std::mem::offset_of!(nmod_poly_matrix_precompute_arg_t, poly2) - 16usize];
    ["Offset of field: nmod_poly_matrix_precompute_arg_t::poly2inv"]
        [::std::mem::offset_of!(nmod_poly_matrix_precompute_arg_t, poly2inv) - 24usize];
};
impl Default for nmod_poly_matrix_precompute_arg_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nmod_poly_compose_mod_precomp_preinv_arg_t {
    pub A: *mut nmod_mat_struct,
    pub res: *mut nmod_poly_struct,
    pub poly1: *mut nmod_poly_struct,
    pub poly3: *mut nmod_poly_struct,
    pub poly3inv: *mut nmod_poly_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_compose_mod_precomp_preinv_arg_t"]
        [::std::mem::size_of::<nmod_poly_compose_mod_precomp_preinv_arg_t>() - 40usize];
    ["Alignment of nmod_poly_compose_mod_precomp_preinv_arg_t"]
        [::std::mem::align_of::<nmod_poly_compose_mod_precomp_preinv_arg_t>() - 8usize];
    ["Offset of field: nmod_poly_compose_mod_precomp_preinv_arg_t::A"]
        [::std::mem::offset_of!(nmod_poly_compose_mod_precomp_preinv_arg_t, A) - 0usize];
    ["Offset of field: nmod_poly_compose_mod_precomp_preinv_arg_t::res"]
        [::std::mem::offset_of!(nmod_poly_compose_mod_precomp_preinv_arg_t, res) - 8usize];
    ["Offset of field: nmod_poly_compose_mod_precomp_preinv_arg_t::poly1"]
        [::std::mem::offset_of!(nmod_poly_compose_mod_precomp_preinv_arg_t, poly1) - 16usize];
    ["Offset of field: nmod_poly_compose_mod_precomp_preinv_arg_t::poly3"]
        [::std::mem::offset_of!(nmod_poly_compose_mod_precomp_preinv_arg_t, poly3) - 24usize];
    ["Offset of field: nmod_poly_compose_mod_precomp_preinv_arg_t::poly3inv"]
        [::std::mem::offset_of!(nmod_poly_compose_mod_precomp_preinv_arg_t, poly3inv) - 32usize];
};
impl Default for nmod_poly_compose_mod_precomp_preinv_arg_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nmod_geometric_progression_struct {
    pub x: nn_ptr,
    pub t: nn_ptr,
    pub w: nn_ptr,
    pub y: nn_ptr,
    pub z: nn_ptr,
    pub f: nmod_poly_t,
    pub g1: nmod_poly_t,
    pub g2: nmod_poly_t,
    pub mod_: nmod_t,
    pub len: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_geometric_progression_struct"]
        [::std::mem::size_of::<nmod_geometric_progression_struct>() - 216usize];
    ["Alignment of nmod_geometric_progression_struct"]
        [::std::mem::align_of::<nmod_geometric_progression_struct>() - 8usize];
    ["Offset of field: nmod_geometric_progression_struct::x"]
        [::std::mem::offset_of!(nmod_geometric_progression_struct, x) - 0usize];
    ["Offset of field: nmod_geometric_progression_struct::t"]
        [::std::mem::offset_of!(nmod_geometric_progression_struct, t) - 8usize];
    ["Offset of field: nmod_geometric_progression_struct::w"]
        [::std::mem::offset_of!(nmod_geometric_progression_struct, w) - 16usize];
    ["Offset of field: nmod_geometric_progression_struct::y"]
        [::std::mem::offset_of!(nmod_geometric_progression_struct, y) - 24usize];
    ["Offset of field: nmod_geometric_progression_struct::z"]
        [::std::mem::offset_of!(nmod_geometric_progression_struct, z) - 32usize];
    ["Offset of field: nmod_geometric_progression_struct::f"]
        [::std::mem::offset_of!(nmod_geometric_progression_struct, f) - 40usize];
    ["Offset of field: nmod_geometric_progression_struct::g1"]
        [::std::mem::offset_of!(nmod_geometric_progression_struct, g1) - 88usize];
    ["Offset of field: nmod_geometric_progression_struct::g2"]
        [::std::mem::offset_of!(nmod_geometric_progression_struct, g2) - 136usize];
    ["Offset of field: nmod_geometric_progression_struct::mod_"]
        [::std::mem::offset_of!(nmod_geometric_progression_struct, mod_) - 184usize];
    ["Offset of field: nmod_geometric_progression_struct::len"]
        [::std::mem::offset_of!(nmod_geometric_progression_struct, len) - 208usize];
};
impl Default for nmod_geometric_progression_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_geometric_progression_t = [nmod_geometric_progression_struct; 1usize];
#[repr(C)]
pub struct nmod_poly_mulmod_precond_struct {
    pub method: libc::c_int,
    pub n: slong,
    pub a: nn_srcptr,
    pub alen: slong,
    pub d: nn_srcptr,
    pub dinv: nn_srcptr,
    pub lendinv: slong,
    pub adivd: nn_ptr,
    pub matrix: nn_ptr,
    pub packing: libc::c_int,
    pub dot_params: dot_params_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_mulmod_precond_struct"]
        [::std::mem::size_of::<nmod_poly_mulmod_precond_struct>() - 96usize];
    ["Alignment of nmod_poly_mulmod_precond_struct"]
        [::std::mem::align_of::<nmod_poly_mulmod_precond_struct>() - 8usize];
    ["Offset of field: nmod_poly_mulmod_precond_struct::method"]
        [::std::mem::offset_of!(nmod_poly_mulmod_precond_struct, method) - 0usize];
    ["Offset of field: nmod_poly_mulmod_precond_struct::n"]
        [::std::mem::offset_of!(nmod_poly_mulmod_precond_struct, n) - 8usize];
    ["Offset of field: nmod_poly_mulmod_precond_struct::a"]
        [::std::mem::offset_of!(nmod_poly_mulmod_precond_struct, a) - 16usize];
    ["Offset of field: nmod_poly_mulmod_precond_struct::alen"]
        [::std::mem::offset_of!(nmod_poly_mulmod_precond_struct, alen) - 24usize];
    ["Offset of field: nmod_poly_mulmod_precond_struct::d"]
        [::std::mem::offset_of!(nmod_poly_mulmod_precond_struct, d) - 32usize];
    ["Offset of field: nmod_poly_mulmod_precond_struct::dinv"]
        [::std::mem::offset_of!(nmod_poly_mulmod_precond_struct, dinv) - 40usize];
    ["Offset of field: nmod_poly_mulmod_precond_struct::lendinv"]
        [::std::mem::offset_of!(nmod_poly_mulmod_precond_struct, lendinv) - 48usize];
    ["Offset of field: nmod_poly_mulmod_precond_struct::adivd"]
        [::std::mem::offset_of!(nmod_poly_mulmod_precond_struct, adivd) - 56usize];
    ["Offset of field: nmod_poly_mulmod_precond_struct::matrix"]
        [::std::mem::offset_of!(nmod_poly_mulmod_precond_struct, matrix) - 64usize];
    ["Offset of field: nmod_poly_mulmod_precond_struct::packing"]
        [::std::mem::offset_of!(nmod_poly_mulmod_precond_struct, packing) - 72usize];
    ["Offset of field: nmod_poly_mulmod_precond_struct::dot_params"]
        [::std::mem::offset_of!(nmod_poly_mulmod_precond_struct, dot_params) - 80usize];
};
impl Default for nmod_poly_mulmod_precond_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_poly_mulmod_precond_t = [nmod_poly_mulmod_precond_struct; 1usize];
#[repr(C)]
pub struct _nmod_poly_multi_crt_prog_instr {
    pub a_idx: slong,
    pub b_idx: slong,
    pub c_idx: slong,
    pub idem: nmod_poly_t,
    pub modulus: nmod_poly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _nmod_poly_multi_crt_prog_instr"]
        [::std::mem::size_of::<_nmod_poly_multi_crt_prog_instr>() - 120usize];
    ["Alignment of _nmod_poly_multi_crt_prog_instr"]
        [::std::mem::align_of::<_nmod_poly_multi_crt_prog_instr>() - 8usize];
    ["Offset of field: _nmod_poly_multi_crt_prog_instr::a_idx"]
        [::std::mem::offset_of!(_nmod_poly_multi_crt_prog_instr, a_idx) - 0usize];
    ["Offset of field: _nmod_poly_multi_crt_prog_instr::b_idx"]
        [::std::mem::offset_of!(_nmod_poly_multi_crt_prog_instr, b_idx) - 8usize];
    ["Offset of field: _nmod_poly_multi_crt_prog_instr::c_idx"]
        [::std::mem::offset_of!(_nmod_poly_multi_crt_prog_instr, c_idx) - 16usize];
    ["Offset of field: _nmod_poly_multi_crt_prog_instr::idem"]
        [::std::mem::offset_of!(_nmod_poly_multi_crt_prog_instr, idem) - 24usize];
    ["Offset of field: _nmod_poly_multi_crt_prog_instr::modulus"]
        [::std::mem::offset_of!(_nmod_poly_multi_crt_prog_instr, modulus) - 72usize];
};
impl Default for _nmod_poly_multi_crt_prog_instr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nmod_poly_multi_crt_struct {
    pub prog: *mut _nmod_poly_multi_crt_prog_instr,
    pub length: slong,
    pub alloc: slong,
    pub localsize: slong,
    pub temp1loc: slong,
    pub temp2loc: slong,
    pub good: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_multi_crt_struct"]
        [::std::mem::size_of::<nmod_poly_multi_crt_struct>() - 56usize];
    ["Alignment of nmod_poly_multi_crt_struct"]
        [::std::mem::align_of::<nmod_poly_multi_crt_struct>() - 8usize];
    ["Offset of field: nmod_poly_multi_crt_struct::prog"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, prog) - 0usize];
    ["Offset of field: nmod_poly_multi_crt_struct::length"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, length) - 8usize];
    ["Offset of field: nmod_poly_multi_crt_struct::alloc"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, alloc) - 16usize];
    ["Offset of field: nmod_poly_multi_crt_struct::localsize"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, localsize) - 24usize];
    ["Offset of field: nmod_poly_multi_crt_struct::temp1loc"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, temp1loc) - 32usize];
    ["Offset of field: nmod_poly_multi_crt_struct::temp2loc"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, temp2loc) - 40usize];
    ["Offset of field: nmod_poly_multi_crt_struct::good"]
        [::std::mem::offset_of!(nmod_poly_multi_crt_struct, good) - 48usize];
};
impl Default for nmod_poly_multi_crt_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_poly_multi_crt_t = [nmod_poly_multi_crt_struct; 1usize];
#[repr(C)]
pub struct nmod_berlekamp_massey_struct {
    pub npoints: slong,
    pub R0: nmod_poly_t,
    pub R1: nmod_poly_t,
    pub V0: nmod_poly_t,
    pub V1: nmod_poly_t,
    pub qt: nmod_poly_t,
    pub rt: nmod_poly_t,
    pub points: nmod_poly_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_berlekamp_massey_struct"]
        [::std::mem::size_of::<nmod_berlekamp_massey_struct>() - 344usize];
    ["Alignment of nmod_berlekamp_massey_struct"]
        [::std::mem::align_of::<nmod_berlekamp_massey_struct>() - 8usize];
    ["Offset of field: nmod_berlekamp_massey_struct::npoints"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, npoints) - 0usize];
    ["Offset of field: nmod_berlekamp_massey_struct::R0"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, R0) - 8usize];
    ["Offset of field: nmod_berlekamp_massey_struct::R1"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, R1) - 56usize];
    ["Offset of field: nmod_berlekamp_massey_struct::V0"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, V0) - 104usize];
    ["Offset of field: nmod_berlekamp_massey_struct::V1"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, V1) - 152usize];
    ["Offset of field: nmod_berlekamp_massey_struct::qt"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, qt) - 200usize];
    ["Offset of field: nmod_berlekamp_massey_struct::rt"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, rt) - 248usize];
    ["Offset of field: nmod_berlekamp_massey_struct::points"]
        [::std::mem::offset_of!(nmod_berlekamp_massey_struct, points) - 296usize];
};
impl Default for nmod_berlekamp_massey_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_berlekamp_massey_t = [nmod_berlekamp_massey_struct; 1usize];
extern "C" {
    pub fn nmod_poly_init(poly: *mut nmod_poly_struct, n: ulong);
    pub fn nmod_poly_init_preinv(poly: *mut nmod_poly_struct, n: ulong, ninv: ulong);
    pub fn nmod_poly_init2(poly: *mut nmod_poly_struct, n: ulong, alloc: slong);
    pub fn nmod_poly_init2_preinv(poly: *mut nmod_poly_struct, n: ulong, ninv: ulong, alloc: slong);
    pub fn nmod_poly_realloc(poly: *mut nmod_poly_struct, alloc: slong);
    pub fn nmod_poly_clear(poly: *mut nmod_poly_struct);
