/* automatically generated by rust-bindgen 0.70.1 */

use crate::deps::*;
use crate::flint::*;


#[repr(C)]
pub struct nmod_mat_struct {
    pub entries: *mut ulong,
    pub r: slong,
    pub c: slong,
    pub stride: slong,
    pub mod_: nmod_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_mat_struct"][::std::mem::size_of::<nmod_mat_struct>() - 56usize];
    ["Alignment of nmod_mat_struct"][::std::mem::align_of::<nmod_mat_struct>() - 8usize];
    ["Offset of field: nmod_mat_struct::entries"]
        [::std::mem::offset_of!(nmod_mat_struct, entries) - 0usize];
    ["Offset of field: nmod_mat_struct::r"][::std::mem::offset_of!(nmod_mat_struct, r) - 8usize];
    ["Offset of field: nmod_mat_struct::c"][::std::mem::offset_of!(nmod_mat_struct, c) - 16usize];
    ["Offset of field: nmod_mat_struct::stride"]
        [::std::mem::offset_of!(nmod_mat_struct, stride) - 24usize];
    ["Offset of field: nmod_mat_struct::mod_"]
        [::std::mem::offset_of!(nmod_mat_struct, mod_) - 32usize];
};
impl Default for nmod_mat_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_mat_t = [nmod_mat_struct; 1usize];
#[repr(C)]
pub struct nmod_poly_struct {
    pub coeffs: nn_ptr,
    pub alloc: slong,
    pub length: slong,
    pub mod_: nmod_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_struct"][::std::mem::size_of::<nmod_poly_struct>() - 48usize];
    ["Alignment of nmod_poly_struct"][::std::mem::align_of::<nmod_poly_struct>() - 8usize];
    ["Offset of field: nmod_poly_struct::coeffs"]
        [::std::mem::offset_of!(nmod_poly_struct, coeffs) - 0usize];
    ["Offset of field: nmod_poly_struct::alloc"]
        [::std::mem::offset_of!(nmod_poly_struct, alloc) - 8usize];
    ["Offset of field: nmod_poly_struct::length"]
        [::std::mem::offset_of!(nmod_poly_struct, length) - 16usize];
    ["Offset of field: nmod_poly_struct::mod_"]
        [::std::mem::offset_of!(nmod_poly_struct, mod_) - 24usize];
};
impl Default for nmod_poly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_poly_t = [nmod_poly_struct; 1usize];
#[repr(C)]
pub struct nmod_poly_factor_struct {
    pub p: *mut nmod_poly_struct,
    pub exp: *mut slong,
    pub num: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_factor_struct"][::std::mem::size_of::<nmod_poly_factor_struct>() - 32usize];
    ["Alignment of nmod_poly_factor_struct"]
        [::std::mem::align_of::<nmod_poly_factor_struct>() - 8usize];
    ["Offset of field: nmod_poly_factor_struct::p"]
        [::std::mem::offset_of!(nmod_poly_factor_struct, p) - 0usize];
    ["Offset of field: nmod_poly_factor_struct::exp"]
        [::std::mem::offset_of!(nmod_poly_factor_struct, exp) - 8usize];
    ["Offset of field: nmod_poly_factor_struct::num"]
        [::std::mem::offset_of!(nmod_poly_factor_struct, num) - 16usize];
    ["Offset of field: nmod_poly_factor_struct::alloc"]
        [::std::mem::offset_of!(nmod_poly_factor_struct, alloc) - 24usize];
};
impl Default for nmod_poly_factor_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_poly_factor_t = [nmod_poly_factor_struct; 1usize];
#[repr(C)]
pub struct nmod_poly_mat_struct {
    pub entries: *mut nmod_poly_struct,
    pub r: slong,
    pub c: slong,
    pub stride: slong,
    pub modulus: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_poly_mat_struct"][::std::mem::size_of::<nmod_poly_mat_struct>() - 40usize];
    ["Alignment of nmod_poly_mat_struct"][::std::mem::align_of::<nmod_poly_mat_struct>() - 8usize];
    ["Offset of field: nmod_poly_mat_struct::entries"]
        [::std::mem::offset_of!(nmod_poly_mat_struct, entries) - 0usize];
    ["Offset of field: nmod_poly_mat_struct::r"]
        [::std::mem::offset_of!(nmod_poly_mat_struct, r) - 8usize];
    ["Offset of field: nmod_poly_mat_struct::c"]
        [::std::mem::offset_of!(nmod_poly_mat_struct, c) - 16usize];
    ["Offset of field: nmod_poly_mat_struct::stride"]
        [::std::mem::offset_of!(nmod_poly_mat_struct, stride) - 24usize];
    ["Offset of field: nmod_poly_mat_struct::modulus"]
        [::std::mem::offset_of!(nmod_poly_mat_struct, modulus) - 32usize];
};
impl Default for nmod_poly_mat_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_poly_mat_t = [nmod_poly_mat_struct; 1usize];
#[repr(C)]
pub struct nmod_mpoly_struct {
    pub coeffs: *mut ulong,
    pub exps: *mut ulong,
    pub length: slong,
    pub bits: flint_bitcnt_t,
    pub coeffs_alloc: slong,
    pub exps_alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_mpoly_struct"][::std::mem::size_of::<nmod_mpoly_struct>() - 48usize];
    ["Alignment of nmod_mpoly_struct"][::std::mem::align_of::<nmod_mpoly_struct>() - 8usize];
    ["Offset of field: nmod_mpoly_struct::coeffs"]
        [::std::mem::offset_of!(nmod_mpoly_struct, coeffs) - 0usize];
    ["Offset of field: nmod_mpoly_struct::exps"]
        [::std::mem::offset_of!(nmod_mpoly_struct, exps) - 8usize];
    ["Offset of field: nmod_mpoly_struct::length"]
        [::std::mem::offset_of!(nmod_mpoly_struct, length) - 16usize];
    ["Offset of field: nmod_mpoly_struct::bits"]
        [::std::mem::offset_of!(nmod_mpoly_struct, bits) - 24usize];
    ["Offset of field: nmod_mpoly_struct::coeffs_alloc"]
        [::std::mem::offset_of!(nmod_mpoly_struct, coeffs_alloc) - 32usize];
    ["Offset of field: nmod_mpoly_struct::exps_alloc"]
        [::std::mem::offset_of!(nmod_mpoly_struct, exps_alloc) - 40usize];
};
impl Default for nmod_mpoly_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_mpoly_t = [nmod_mpoly_struct; 1usize];
#[repr(C)]
pub struct nmod_mpoly_factor_struct {
    pub constant: ulong,
    pub poly: *mut nmod_mpoly_struct,
    pub exp: *mut fmpz,
    pub num: slong,
    pub alloc: slong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_mpoly_factor_struct"]
        [::std::mem::size_of::<nmod_mpoly_factor_struct>() - 40usize];
    ["Alignment of nmod_mpoly_factor_struct"]
        [::std::mem::align_of::<nmod_mpoly_factor_struct>() - 8usize];
    ["Offset of field: nmod_mpoly_factor_struct::constant"]
        [::std::mem::offset_of!(nmod_mpoly_factor_struct, constant) - 0usize];
    ["Offset of field: nmod_mpoly_factor_struct::poly"]
        [::std::mem::offset_of!(nmod_mpoly_factor_struct, poly) - 8usize];
    ["Offset of field: nmod_mpoly_factor_struct::exp"]
        [::std::mem::offset_of!(nmod_mpoly_factor_struct, exp) - 16usize];
    ["Offset of field: nmod_mpoly_factor_struct::num"]
        [::std::mem::offset_of!(nmod_mpoly_factor_struct, num) - 24usize];
    ["Offset of field: nmod_mpoly_factor_struct::alloc"]
        [::std::mem::offset_of!(nmod_mpoly_factor_struct, alloc) - 32usize];
};
impl Default for nmod_mpoly_factor_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_mpoly_factor_t = [nmod_mpoly_factor_struct; 1usize];
pub const dot_method_t__DOT0: dot_method_t = 0;
pub const dot_method_t__DOT1: dot_method_t = 1;
pub const dot_method_t__DOT2_SPLIT: dot_method_t = 2;
pub const dot_method_t__DOT2_HALF: dot_method_t = 3;
pub const dot_method_t__DOT2: dot_method_t = 4;
pub const dot_method_t__DOT3_ACC: dot_method_t = 5;
pub const dot_method_t__DOT3: dot_method_t = 6;
pub const dot_method_t__DOT_POW2: dot_method_t = 7;
pub type dot_method_t = libc::c_uint;
#[repr(C)]
pub struct dot_params_t {
    pub method: dot_method_t,
    pub pow2_precomp: ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dot_params_t"][::std::mem::size_of::<dot_params_t>() - 16usize];
    ["Alignment of dot_params_t"][::std::mem::align_of::<dot_params_t>() - 8usize];
    ["Offset of field: dot_params_t::method"]
        [::std::mem::offset_of!(dot_params_t, method) - 0usize];
    ["Offset of field: dot_params_t::pow2_precomp"]
        [::std::mem::offset_of!(dot_params_t, pow2_precomp) - 8usize];
};
impl Default for dot_params_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
