/* automatically generated by rust-bindgen 0.70.1 */

use crate::deps::*;
use crate::flint::*;


#[repr(C)]
pub struct nmod_discrete_log_pohlig_hellman_table_entry_struct {
    pub gammapow: mp_limb_t,
    pub cm: mp_limb_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_discrete_log_pohlig_hellman_table_entry_struct"]
        [::std::mem::size_of::<nmod_discrete_log_pohlig_hellman_table_entry_struct>() - 16usize];
    ["Alignment of nmod_discrete_log_pohlig_hellman_table_entry_struct"]
        [::std::mem::align_of::<nmod_discrete_log_pohlig_hellman_table_entry_struct>() - 8usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_table_entry_struct::gammapow"][::std::mem::offset_of!(
        nmod_discrete_log_pohlig_hellman_table_entry_struct,
        gammapow
    ) - 0usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_table_entry_struct::cm"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_table_entry_struct, cm) - 8usize];
};
impl Default for nmod_discrete_log_pohlig_hellman_table_entry_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nmod_discrete_log_pohlig_hellman_entry_struct {
    pub exp: mp_limb_signed_t,
    pub prime: mp_limb_t,
    pub gamma: mp_limb_t,
    pub gammainv: mp_limb_t,
    pub startingbeta: mp_limb_t,
    pub co: mp_limb_t,
    pub startinge: mp_limb_t,
    pub idem: mp_limb_t,
    pub cbound: mp_limb_t,
    pub dbound: mp_limb_t,
    pub table: *mut nmod_discrete_log_pohlig_hellman_table_entry_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_discrete_log_pohlig_hellman_entry_struct"]
        [::std::mem::size_of::<nmod_discrete_log_pohlig_hellman_entry_struct>() - 88usize];
    ["Alignment of nmod_discrete_log_pohlig_hellman_entry_struct"]
        [::std::mem::align_of::<nmod_discrete_log_pohlig_hellman_entry_struct>() - 8usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::exp"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, exp) - 0usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::prime"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, prime) - 8usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::gamma"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, gamma) - 16usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::gammainv"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, gammainv) - 24usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::startingbeta"][::std::mem::offset_of!(
        nmod_discrete_log_pohlig_hellman_entry_struct,
        startingbeta
    ) - 32usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::co"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, co) - 40usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::startinge"][::std::mem::offset_of!(
        nmod_discrete_log_pohlig_hellman_entry_struct,
        startinge
    ) - 48usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::idem"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, idem) - 56usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::cbound"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, cbound) - 64usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::dbound"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, dbound) - 72usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_entry_struct::table"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_entry_struct, table) - 80usize];
};
impl Default for nmod_discrete_log_pohlig_hellman_entry_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct nmod_discrete_log_pohlig_hellman_struct {
    pub mod_: nmod_t,
    pub alpha: mp_limb_t,
    pub alphainv: mp_limb_t,
    pub num_factors: mp_limb_signed_t,
    pub entries: *mut nmod_discrete_log_pohlig_hellman_entry_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nmod_discrete_log_pohlig_hellman_struct"]
        [::std::mem::size_of::<nmod_discrete_log_pohlig_hellman_struct>() - 56usize];
    ["Alignment of nmod_discrete_log_pohlig_hellman_struct"]
        [::std::mem::align_of::<nmod_discrete_log_pohlig_hellman_struct>() - 8usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_struct::mod_"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_struct, mod_) - 0usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_struct::alpha"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_struct, alpha) - 24usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_struct::alphainv"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_struct, alphainv) - 32usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_struct::num_factors"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_struct, num_factors) - 40usize];
    ["Offset of field: nmod_discrete_log_pohlig_hellman_struct::entries"]
        [::std::mem::offset_of!(nmod_discrete_log_pohlig_hellman_struct, entries) - 48usize];
};
impl Default for nmod_discrete_log_pohlig_hellman_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type nmod_discrete_log_pohlig_hellman_t = [nmod_discrete_log_pohlig_hellman_struct; 1usize];
extern "C" {
    #[link_name = "nmod_set_ui__extern"]
    pub fn nmod_set_ui(x: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "nmod_set_si__extern"]
    pub fn nmod_set_si(x: mp_limb_signed_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "_nmod_add__extern"]
    pub fn _nmod_add(a: mp_limb_t, b: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "_nmod_sub__extern"]
    pub fn _nmod_sub(a: mp_limb_t, b: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "nmod_add__extern"]
    pub fn nmod_add(a: mp_limb_t, b: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "nmod_sub__extern"]
    pub fn nmod_sub(a: mp_limb_t, b: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "nmod_neg__extern"]
    pub fn nmod_neg(a: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "nmod_mul__extern"]
    pub fn nmod_mul(a: mp_limb_t, b: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "_nmod_mul_fullword__extern"]
    pub fn _nmod_mul_fullword(a: mp_limb_t, b: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "nmod_addmul__extern"]
    pub fn nmod_addmul(a: mp_limb_t, b: mp_limb_t, c: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "nmod_inv__extern"]
    pub fn nmod_inv(a: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "nmod_div__extern"]
    pub fn nmod_div(a: mp_limb_t, b: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    pub fn nmod_divides(a: *mut mp_limb_t, b: mp_limb_t, c: mp_limb_t, mod_: nmod_t)
        -> libc::c_int;
    #[link_name = "nmod_pow_ui__extern"]
    pub fn nmod_pow_ui(a: mp_limb_t, exp: mp_limb_t, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "nmod_pow_fmpz__extern"]
    pub fn nmod_pow_fmpz(a: mp_limb_t, exp: *const fmpz, mod_: nmod_t) -> mp_limb_t;
    #[link_name = "nmod_init__extern"]
    pub fn nmod_init(mod_: *mut nmod_t, n: mp_limb_t);
    pub fn nmod_discrete_log_pohlig_hellman_init(L: *mut nmod_discrete_log_pohlig_hellman_struct);
    pub fn nmod_discrete_log_pohlig_hellman_clear(L: *mut nmod_discrete_log_pohlig_hellman_struct);
    pub fn nmod_discrete_log_pohlig_hellman_precompute_prime(
        L: *mut nmod_discrete_log_pohlig_hellman_struct,
        p: mp_limb_t,
    ) -> f64;
    pub fn nmod_discrete_log_pohlig_hellman_run(
        L: *const nmod_discrete_log_pohlig_hellman_struct,
        y: mp_limb_t,
    ) -> mp_limb_t;
    #[link_name = "nmod_discrete_log_pohlig_hellman_primitive_root__extern"]
    pub fn nmod_discrete_log_pohlig_hellman_primitive_root(
        L: *const nmod_discrete_log_pohlig_hellman_struct,
    ) -> mp_limb_t;
}
