/* automatically generated by rust-bindgen 0.70.1 */

use libc::*;
use crate::deps::*;
use crate::bindgen::*;
use crate::acb::*;
use crate::acb_calc::*;
use crate::acb_dft::*;
use crate::acb_dirichlet::*;
use crate::acb_elliptic::*;
use crate::acb_hypgeom::*;
use crate::acb_mat::*;
use crate::acb_modular::*;
use crate::acb_poly::*;
use crate::acb_theta::*;
use crate::acb_types::*;
use crate::acf::*;
use crate::acf_types::*;
use crate::aprcl::*;
use crate::arb::*;
use crate::arb_calc::*;
use crate::arb_fmpz_poly::*;
use crate::arb_fpwrap::*;
use crate::arb_hypgeom::*;
use crate::arb_mat::*;
use crate::arb_poly::*;
use crate::arb_types::*;
use crate::arf::*;
use crate::arf_types::*;
use crate::arith::*;
use crate::bernoulli::*;
use crate::bool_mat::*;
use crate::ca::*;
use crate::ca_ext::*;
use crate::ca_field::*;
use crate::ca_mat::*;
use crate::ca_poly::*;
use crate::ca_vec::*;
use crate::calcium::*;
use crate::d_mat::*;
use crate::d_vec::*;
use crate::dirichlet::*;
use crate::dlog::*;
use crate::double_extras::*;
use crate::double_interval::*;
use crate::fexpr::*;
use crate::fexpr_builtin::*;
use crate::fft::*;
use crate::fft_tuning::*;
use crate::flint_config::*;
use crate::flint::*;
use crate::fmpq::*;
use crate::fmpq_mat::*;
use crate::fmpq_mpoly::*;
use crate::fmpq_mpoly_factor::*;
use crate::fmpq_poly::*;
use crate::fmpq_types::*;
use crate::fmpq_vec::*;
use crate::fmpz::*;
use crate::fmpz_extras::*;
use crate::fmpz_factor::*;
use crate::fmpz_lll::*;
use crate::fmpz_mat::*;
use crate::fmpz_mod::*;
use crate::fmpz_mod_mat::*;
use crate::fmpz_mod_mpoly::*;
use crate::fmpz_mod_mpoly_factor::*;
use crate::fmpz_mod_poly::*;
use crate::fmpz_mod_poly_factor::*;
use crate::fmpz_mod_types::*;
use crate::fmpz_mod_vec::*;
use crate::fmpz_mpoly::*;
use crate::fmpz_mpoly_factor::*;
use crate::fmpz_mpoly_q::*;
use crate::fmpz_poly::*;
use crate::fmpz_poly_factor::*;
use crate::fmpz_poly_mat::*;
use crate::fmpz_poly_q::*;
use crate::fmpz_types::*;
use crate::fmpz_vec::*;
use crate::fmpzi::*;
use crate::fq::*;
use crate::fq_default::*;
use crate::fq_default_mat::*;
use crate::fq_default_poly::*;
use crate::fq_default_poly_factor::*;
use crate::fq_embed::*;
use crate::fq_embed_templates::*;
use crate::fq_mat::*;
use crate::fq_mat_templates::*;
use crate::fq_nmod::*;
use crate::fq_nmod_embed::*;
use crate::fq_nmod_mat::*;
use crate::fq_nmod_mpoly::*;
use crate::fq_nmod_mpoly_factor::*;
use crate::fq_nmod_poly::*;
use crate::fq_nmod_poly_factor::*;
use crate::fq_nmod_types::*;
use crate::fq_nmod_vec::*;
use crate::fq_poly::*;
use crate::fq_poly_factor::*;
use crate::fq_poly_factor_templates::*;
use crate::fq_poly_templates::*;
use crate::fq_templates::*;
use crate::fq_types::*;
use crate::fq_vec::*;
use crate::fq_vec_templates::*;
use crate::fq_zech::*;
use crate::fq_zech_embed::*;
use crate::fq_zech_mat::*;
use crate::fq_zech_mpoly::*;
use crate::fq_zech_mpoly_factor::*;
use crate::fq_zech_poly::*;
use crate::fq_zech_poly_factor::*;
use crate::fq_zech_types::*;
use crate::fq_zech_vec::*;
use crate::gmpcompat::*;
use crate::gr::*;
use crate::gr_generic::*;
use crate::gr_mat::*;
use crate::gr_mpoly::*;
use crate::gr_poly::*;
use crate::gr_special::*;
use crate::gr_vec::*;
use crate::hypgeom::*;
use crate::limb_types::*;
use crate::long_extras::*;
use crate::longlong::*;
use crate::mag::*;
use crate::mpf_impl::*;
use crate::mpfr_mat::*;
use crate::mpfr_vec::*;
use crate::mpoly::*;
use crate::mpoly_types::*;
use crate::n_poly::*;
use crate::n_poly_types::*;
use crate::nf::*;
use crate::nf_elem::*;
use crate::nmod::*;
use crate::nmod_mat::*;
use crate::nmod_mpoly::*;
use crate::nmod_mpoly_factor::*;
use crate::nmod_poly::*;
use crate::nmod_poly_factor::*;
use crate::nmod_poly_mat::*;
use crate::nmod_types::*;
use crate::nmod_vec::*;
use crate::padic::*;
use crate::padic_mat::*;
use crate::padic_poly::*;
use crate::padic_types::*;
use crate::partitions::*;
use crate::perm::*;
use crate::qadic::*;
use crate::qfb::*;
use crate::qqbar::*;
use crate::qsieve::*;
use crate::templates::*;
use crate::thread_support::*;
use crate::ulong_extras::*;


#[repr(C)]
pub struct thread_pool_entry_struct {
    pub pth: pthread_t,
    pub mutex: pthread_mutex_t,
    pub sleep1: pthread_cond_t,
    pub sleep2: pthread_cond_t,
    pub idx: libc::c_int,
    pub available: libc::c_int,
    pub max_workers: libc::c_int,
    pub fxn: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    pub fxnarg: *mut libc::c_void,
    pub working: libc::c_int,
    pub exit: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_pool_entry_struct"]
        [::std::mem::size_of::<thread_pool_entry_struct>() - 184usize];
    ["Alignment of thread_pool_entry_struct"]
        [::std::mem::align_of::<thread_pool_entry_struct>() - 8usize];
    ["Offset of field: thread_pool_entry_struct::pth"]
        [::std::mem::offset_of!(thread_pool_entry_struct, pth) - 0usize];
    ["Offset of field: thread_pool_entry_struct::mutex"]
        [::std::mem::offset_of!(thread_pool_entry_struct, mutex) - 8usize];
    ["Offset of field: thread_pool_entry_struct::sleep1"]
        [::std::mem::offset_of!(thread_pool_entry_struct, sleep1) - 48usize];
    ["Offset of field: thread_pool_entry_struct::sleep2"]
        [::std::mem::offset_of!(thread_pool_entry_struct, sleep2) - 96usize];
    ["Offset of field: thread_pool_entry_struct::idx"]
        [::std::mem::offset_of!(thread_pool_entry_struct, idx) - 144usize];
    ["Offset of field: thread_pool_entry_struct::available"]
        [::std::mem::offset_of!(thread_pool_entry_struct, available) - 148usize];
    ["Offset of field: thread_pool_entry_struct::max_workers"]
        [::std::mem::offset_of!(thread_pool_entry_struct, max_workers) - 152usize];
    ["Offset of field: thread_pool_entry_struct::fxn"]
        [::std::mem::offset_of!(thread_pool_entry_struct, fxn) - 160usize];
    ["Offset of field: thread_pool_entry_struct::fxnarg"]
        [::std::mem::offset_of!(thread_pool_entry_struct, fxnarg) - 168usize];
    ["Offset of field: thread_pool_entry_struct::working"]
        [::std::mem::offset_of!(thread_pool_entry_struct, working) - 176usize];
    ["Offset of field: thread_pool_entry_struct::exit"]
        [::std::mem::offset_of!(thread_pool_entry_struct, exit) - 180usize];
};
impl Default for thread_pool_entry_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type thread_pool_entry_t = [thread_pool_entry_struct; 1usize];
#[repr(C)]
pub struct thread_pool_struct {
    pub original_affinity: *mut libc::c_void,
    pub mutex: pthread_mutex_t,
    pub tdata: *mut thread_pool_entry_struct,
    pub length: mp_limb_signed_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_pool_struct"][::std::mem::size_of::<thread_pool_struct>() - 64usize];
    ["Alignment of thread_pool_struct"][::std::mem::align_of::<thread_pool_struct>() - 8usize];
    ["Offset of field: thread_pool_struct::original_affinity"]
        [::std::mem::offset_of!(thread_pool_struct, original_affinity) - 0usize];
    ["Offset of field: thread_pool_struct::mutex"]
        [::std::mem::offset_of!(thread_pool_struct, mutex) - 8usize];
    ["Offset of field: thread_pool_struct::tdata"]
        [::std::mem::offset_of!(thread_pool_struct, tdata) - 48usize];
    ["Offset of field: thread_pool_struct::length"]
        [::std::mem::offset_of!(thread_pool_struct, length) - 56usize];
};
impl Default for thread_pool_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type thread_pool_t = [thread_pool_struct; 1usize];
extern "C" {
    pub static mut global_thread_pool: thread_pool_t;
    pub static mut global_thread_pool_initialized: libc::c_int;
    pub fn thread_pool_idle_loop(varg: *mut libc::c_void) -> *mut libc::c_void;
    pub fn thread_pool_init(T: *mut thread_pool_struct, l: mp_limb_signed_t);
    pub fn thread_pool_set_affinity(
        T: *mut thread_pool_struct,
        cpus: *mut libc::c_int,
        length: mp_limb_signed_t,
    ) -> libc::c_int;
    pub fn thread_pool_restore_affinity(T: *mut thread_pool_struct) -> libc::c_int;
    pub fn thread_pool_get_size(T: *mut thread_pool_struct) -> mp_limb_signed_t;
    pub fn thread_pool_set_size(
        T: *mut thread_pool_struct,
        new_size: mp_limb_signed_t,
    ) -> libc::c_int;
    pub fn thread_pool_request(
        T: *mut thread_pool_struct,
        out: *mut thread_pool_handle,
        requested: mp_limb_signed_t,
    ) -> mp_limb_signed_t;
    pub fn thread_pool_wake(
        T: *mut thread_pool_struct,
        i: thread_pool_handle,
        max_workers: libc::c_int,
        f: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
        a: *mut libc::c_void,
    );
    pub fn thread_pool_wait(T: *mut thread_pool_struct, i: thread_pool_handle);
    pub fn thread_pool_give_back(T: *mut thread_pool_struct, i: thread_pool_handle);
    pub fn thread_pool_clear(T: *mut thread_pool_struct);
    pub fn _thread_pool_distribute_work_2(
        start: mp_limb_signed_t,
        stop: mp_limb_signed_t,
        Astart: *mut mp_limb_signed_t,
        Astop: *mut mp_limb_signed_t,
        Alen: mp_limb_signed_t,
        Bstart: *mut mp_limb_signed_t,
        Bstop: *mut mp_limb_signed_t,
        Blen: mp_limb_signed_t,
    );
    pub fn _thread_pool_find_work_2(
        a: mp_limb_t,
        alpha: mp_limb_t,
        b: mp_limb_t,
        beta: mp_limb_t,
        yn: mp_limb_t,
        yd: mp_limb_t,
    ) -> mp_limb_t;
}
